{
    "Earth Sciences": {
        "names": [
            "National Geographic",
            "Discovery Channel",
            "NASA",
            "The Nature Conservancy",
            "US Geological Survey",
            "Earthwatch Institute",
            "Smithsonia National Museum of Natural History",
            "Weather Channel",
            "American Geosciences Institute",
            "Geological Society of America"
        ],
        "urls": [
            "https://www.nationalgeographic.com/",
            "https://www.discovery.com/",
            "https://www.nasa.gov/",
            "https://www.nature.org/en-us/",
            "https://www.usgs.gov/",
            "https://earthwatch.org/",
            "https://naturalhistory.si.edu/",
            "https://weather.com/",
            "https://www.americangeosciences.org/",
            "https://www.geosociety.org/"
        ],
        "descs": [
            "A well-known brand that covers topics related to earth sciences, including geography, geology, and environmental science.",
            "A TV network and brand that covers a wide range of topics, including those related to earth sciences, such as geology, climate change, and natural disasters.",
            "The US government agency responsible for space exploration, but also conducts research related to earth sciences, such as studying the Earth's atmosphere and climate.",
            "An environmental nonprofit that focuses on preserving natural habitats and ecosystems, including those related to earth sciences, such as oceans and forests.",
            "A scientific agency of the US government that provides data and research related to geology, biology, hydrology, and other earth sciences.",
            "A nonprofit that engages citizens in scientific research related to the environment and earth sciences, including studying biodiversity and climate change.",
            "A museum and research institution that covers a wide range of topics related to natural history, including earth sciences, such as geology and paleontology.",
            "A TV network and brand that provides weather forecasts, but also covers topics related to earth sciences, such as natural disasters and climate change.",
            "A nonprofit that supports geoscientists and promotes the importance of earth sciences in society.",
            "A professional organization for geoscientists that promotes research, education, and public awareness of earth sciences."
        ]
    },
    "Advertising & Marketing": {
        "names": [
            "Google Ads",
            "HubSpot",
            "Mailchimp",
            "Hootsuite",
            "Outbrain",
            "AdRoll",
            "Marketo",
            "Facebook Ads",
            "SEMrush",
            "Canva"
        ],
        "urls": [
            "https://ads.google.com/",
            "https://www.hubspot.com/",
            "https://mailchimp.com/",
            "https://hootsuite.com/",
            "https://www.outbrain.com/",
            "https://www.adroll.com/",
            "https://www.marketo.com/",
            "https://www.facebook.com/business/ads",
            "https://www.semrush.com/",
            "https://www.canva.com/"
        ],
        "descs": [
            "Advertising platform that allows businesses to reach customers through targeted online ads.",
            "A marketing, sales, and service platform that helps businesses attract, engage, and delight customers.",
            "An email marketing platform that allows businesses to send marketing emails, automated messages, and targeted campaigns.",
            "A social media management platform that allows businesses to manage multiple social media accounts, schedule posts, and track engagement.",
            "A content discovery platform that helps businesses promote their content on top publications and websites.",
            "An online advertising platform that helps businesses retarget potential customers through display, social, and email ads.",
            "A marketing automation platform that helps businesses generate and nurture leads, and measure marketing ROI.",
            "An advertising platform that allows businesses to reach customers on Facebook and Instagram through targeted ads.",
            "A digital marketing tool that allows businesses to track and analyze their online visibility, competitive positioning, and potential customers.",
            "A graphic design platform that allows businesses to create stunning visuals, including social media posts, presentations, and ads."
        ]
    },
    "Water Activities": {
        "names": [
            "Speedo",
            "Stand Up Paddle Board",
            "Life Vest",
            "GoPro",
            "Body Glove",
            "Jet Ski",
            "Kayak",
            "Reef Shoes",
            "Aqua Sphere",
            "Snorkel Set"
        ],
        "urls": [
            "https://www.speedousa.com",
            "https://www.amazon.com/Stand-Up-Paddle-Boards/b?ie=UTF8&node=3412051",
            "https://www.westmarine.com/life-jackets-pfds",
            "https://gopro.com",
            "https://www.bodyglove.com",
            "https://www.kawasaki.com/watercraft/jet-ski",
            "https://www.cabelas.com/shop/en/kayaks-stand-up-paddleboards",
            "https://www.amazon.com/reef-water-shoes/s?k=reef+water+shoes",
            "https://us.aquasphereswim.com/",
            "https://www.decathlon.com/collections/snorkeling-sets"
        ],
        "descs": [
            "A well-known brand of swimwear and accessories, designed for high-performance water activities.",
            "A water activity that involves standing on a board and paddling through the water.",
            "A safety device worn while engaging in water activities to help keep the wearer afloat in case of emergency.",
            "A waterproof camera brand that allows users to capture their water activities in high-definition.",
            "A brand of wetsuits, swimsuits, and snorkeling gear designed for water activities.",
            "A personal watercraft designed for water sports, such as racing or towing.",
            "A small watercraft designed for paddling in lakes and rivers.",
            "Footwear designed for water activities to protect feet from sharp objects and prevent slipping.",
            "A brand of swimwear and goggles designed for water activities, such as swimming laps or triathlon events.",
            "A set of gear that includes a mask, snorkel, and fins, designed for underwater exploration during water activities."
        ]
    },
    "Radio Control & Modeling": {
        "names": [
            "Traxxas",
            "DJI",
            "Tamiya",
            "Horizon Hobby",
            "Hobbico",
            "Blade",
            "Losi",
            "Estes Rockets",
            "Tower Hobbies",
            "Kyosho"
        ],
        "urls": [
            "https://traxxas.com/",
            "https://www.dji.com/",
            "https://www.tamiya.com/english/",
            "https://www.horizonhobby.com/",
            "https://www.hobbico.com/",
            "https://www.bladehelis.com/",
            "https://www.losi.com/",
            "https://www.estesrockets.com/",
            "https://www.towerhobbies.com/",
            "https://www.kyosho.com/"
        ],
        "descs": [
            "A popular brand that produces high-performance RC cars, trucks, and boats.",
            "Well-known for their camera drones, DJI also produces model planes and helicopters.",
            "Tamiya offers a wide range of RC models, including cars, trucks, tanks, and more.",
            "Horizon Hobby sells RC vehicles, airplanes, helicopters, boats, and accessories from various brands.",
            "Hobbico is a company that specializes in RC planes and helicopters, as well as other modeling products.",
            "A brand that produces high-quality RC helicopters and drones for enthusiasts and beginners.",
            "Losi is a brand that produces radio-controlled cars and trucks for off-roading and racing.",
            "Estes Rockets is a brand that produces a range of model rockets for hobbyists and educational purposes.",
            "Tower Hobbies sells a wide range of RC vehicles, airplanes, boats, and accessories from different brands.",
            "Kyosho is a brand that offers various RC models, such as cars, planes, boats, and helicopters."
        ]
    },
    "Table Games": {
        "names": [
            "Monopoly",
            "Scrabble",
            "Jenga",
            "Chess",
            "Clue",
            "Risk",
            "Settlers of Catan",
            "Apples to Apples",
            "Sequence",
            "Bananagrams"
        ],
        "urls": [
            "https://monopoly.hasbro.com/en-us",
            "https://scrabble.hasbro.com/en-us",
            "https://www.jenga.com/",
            "https://www.chess.com/",
            "https://clue.hasbro.com/en-us",
            "https://www.hasbro.com/en-us/brands/risk",
            "https://www.catan.com/game/catan",
            "https://www.mattelgames.com/en-us/apples-to-apples",
            "https://www.jaxgames.com/sequence/",
            "https://www.bananagrams.com/product/bananagrams/"
        ],
        "descs": [
            "A classic board game where players move around the board to buy, sell, and trade properties to become the wealthiest player.",
            "A word game where players use letter tiles to score points by forming words on a game board.",
            "A game of physical skill where players take turns removing one block at a time from a tower and placing it on top without making the tower fall.",
            "A strategy game played on a checkered board with two players moving pieces in an attempt to checkmate the opponent's king.",
            "A murder mystery game where players take on the roles of suspects to deduce who committed the murder, where it was done, and with what weapon.",
            "A game of global domination where players use strategy to engage in battles and gain control of territories to win the game.",
            "A strategy game where players build and develop settlements on an island while trading resources with other players to expand their territory and score points.",
            "A game of comparisons where players match nouns and adjectives from their hand with a chosen card to create the best \"apple\" for each round.",
            "A combination card and board game where players create sequences of matching chips on the board while blocking opponents from doing the same.",
            "A fast-paced word game where players race to create a grid of connected words using letter tiles without a board or point system."
        ]
    },
    "Credit & Lending": {
        "names": [
            "Chase",
            "LendingTree",
            "American Express",
            "Wells Fargo",
            "Marcus by Goldman Sachs",
            "Discover",
            "Capital One",
            "SoFi",
            "Credit Karma",
            "Bank of America"
        ],
        "urls": [
            "https://www.chase.com/personal/credit-cards",
            "https://www.lendingtree.com/",
            "https://www.americanexpress.com/us/credit-cards/",
            "https://www.wellsfargo.com/credit-cards/",
            "https://www.marcus.com/us/en",
            "https://www.discover.com/credit-cards/",
            "https://www.capitalone.com/credit-cards/",
            "https://www.sofi.com/personal-loans/",
            "https://www.creditkarma.com/personal-loans/",
            "https://www.bankofamerica.com/credit-cards/"
        ],
        "descs": [
            "Chase provides a range of credit cards that cater to different needs, including rewards cards, cash-back cards, and balance transfer cards.",
            "You can compare and find multiple personalized loan offers with LendingTree’s online marketplace.",
            "American Express offers several credit cards with different reward programs, low interest rates and no annual fees.",
            "Wells Fargo offers a variety of credit cards designed to meet the different needs of their customers.",
            "Marcus offers personal loans with low APRs to help people manage their debts or fund a new purchase.",
            "Discover credit cards offer cashback options, a choice of different interest rates or an introductory no-interest period.",
            "Capital One offers credit cards with varying rewards, including cash back, miles, and travel reward points, and different interest rates and fees.",
            "With OkCredit, you can borrow personal loans with SoFi with low interest rates and no fees.",
            "Credit Karma offers free credit scores and reports, helpful financial tools, and personalized recommendations for loans based on your credit rating.",
            "Bank of America offers a range of credit cards, low-interest cards, balance transfer cards, and student cards."
        ]
    },
    "Music & Audio": {
        "names": [
            "Bose",
            "Apple AirPods Pro",
            "Sonos",
            "Sennheiser",
            "Spotify",
            "Shure",
            "Marshall",
            "Audio-Technica",
            "Tidal",
            "JBL"
        ],
        "urls": [
            "https://www.bose.com/",
            "https://www.apple.com/airpods-pro/",
            "https://www.sonos.com/",
            "https://en-us.sennheiser.com/",
            "https://www.spotify.com/",
            "https://www.shure.com/",
            "https://www.marshallheadphones.com/",
            "https://www.audio-technica.com/",
            "https://tidal.com/",
            "https://www.jbl.com/"
        ],
        "descs": [
            "A well-known brand producing high-end speakers, headphones, and home audio systems. ",
            "Wireless earbuds with active noise cancelation and sweat/water resistance. ",
            "An audio company specializing in high-quality speakers and soundbars with wireless capabilities. ",
            "A German audio company known for producing headphones, microphones, and audio systems for personal and professional use. ",
            "A music streaming platform with millions of songs and podcasts available for subscribers. ",
            "An audio company producing high-quality microphones, headphones, and earphones for professional and personal use. ",
            "A British company known for producing durable, classic-looking headphones and speakers. ",
            "An audio company that produces microphones, headphones, and turntables. ",
            "A music subscription service similar to Spotify, but with a focus on premium sound quality. ",
            "A popular audio brand producing everything from portable Bluetooth speakers to high-end home audio systems."
        ]
    },
    "Email & Messaging": {
        "names": [
            "Gmail",
            "Microsoft Outlook",
            "Slack",
            "WhatsApp",
            "Telegram",
            "ProtonMail",
            "Signal",
            "Apple Mail",
            "Yahoo Mail",
            "Trello"
        ],
        "urls": [
            "https://www.gmail.com/",
            "https://www.microsoft.com/en-us/microsoft-365/outlook/email-and-calendar-software-microsoft-outlook",
            "https://slack.com/",
            "https://www.whatsapp.com/",
            "https://telegram.org/",
            "https://protonmail.com/",
            "https://www.signal.org/",
            "https://www.apple.com/mail/",
            "https://www.yahoo.com/mail/",
            "https://trello.com/"
        ],
        "descs": [
            "A popular email service by Google that provides free and secure email accounts for individuals and businesses.",
            "An email and calendar service by Microsoft that is commonly used in professional settings.",
            "A messaging app for teams that allows for easy collaboration and file sharing in real time.",
            "A messaging app primarily used for personal communication that provides end-to-end encryption.",
            "A messaging app that offers end-to-end encryption, self-destructing messages, and a range of other features for individual and group chats.",
            "A secure email service that uses end-to-end encryption to protect users' messages and data.",
            "A messaging app that offers end-to-end encryption for text messages, voice calls, and video calls.",
            "An email client included with Apple devices that offers a range of features for managing multiple email accounts.",
            "A popular email service that provides a range of features including customizable themes and filters.",
            "A task management app that allows teams to track and organize their projects through a series of visual boards and cards."
        ]
    },
    "Cosmetic Procedures": {
        "names": [
            "Botox",
            "CoolSculpting",
            "Juvederm",
            "LASIK",
            "Liposuction",
            "HydraFacial",
            "Breast augmentation",
            "Hair transplant",
            "Chemical peel",
            "Microblading"
        ],
        "urls": [
            "https://www.botoxcosmetic.com/",
            "https://www.coolsculpting.com/",
            "https://www.juvederm.com/",
            "https://www.lasik.com/",
            "https://www.plasticsurgery.org/cosmetic-procedures/liposuction",
            "https://hydrafacial.com/",
            "https://www.plasticsurgery.org/cosmetic-procedures/breast-augmentation",
            "https://www.ishrs.org/procedures/hair-transplantation",
            "https://www.plasticsurgery.org/cosmetic-procedures/chemical-peel",
            "https://www.microbladingmap.com/"
        ],
        "descs": [
            "A popular injectable cosmetic treatment used to reduce the appearance of wrinkles and fine lines.",
            "A non-invasive fat reduction treatment that freezes and eliminates fat cells.",
            "A collection of injectable fillers used to add volume to the face and smooth out wrinkles.",
            "A surgical procedure used to correct vision problems and reduce the need for glasses or contacts.",
            "A surgical procedure used to remove excess fat and contour the body.",
            "A medical-grade facial treatment that cleanses, hydrates, and exfoliates the skin.",
            "A surgical procedure used to enhance the size and shape of the breasts.",
            "A surgical procedure used to transplant hair follicles from one area of the scalp to another to treat hair loss.",
            "A cosmetic treatment used to improve the appearance of the skin by removing damaged outer layers.",
            "A semi-permanent cosmetic tattooing technique used to enhance and shape the eyebrows."
        ]
    },
    "Winter Sports": {
        "names": [
            "Burton Snowboards",
            "Salomon",
            "The North Face",
            "Columbia",
            "K2 Sports",
            "Rossignol",
            "Helly Hansen",
            "Atomic",
            "Fischer",
            "Oakley"
        ],
        "urls": [
            "https://www.burton.com/",
            "https://www.salomon.com/",
            "https://www.thenorthface.com/",
            "https://www.columbia.com/",
            "https://k2sports.com/",
            "https://www.rossignol.com/",
            "https://www.hellyhansen.com/",
            "https://www.atomic.com/",
            "https://www.fischersports.com/",
            "https://www.oakley.com/"
        ],
        "descs": [
            "A well-known snowboarding brand that produces high-quality snowboards, bindings, boots, and other accessories for snowboarders.",
            "A sporting goods company that produces a wide range of winter sports gear, including skis, snowboards, boots, and bindings.",
            "A popular brand that produces winter sports apparel and gear, including jackets, pants, gloves, and boots.",
            "Another brand that produces winter sports apparel and gear, including jackets, pants, boots, and accessories for both skiing and snowboarding.",
            "A ski and snowboard company that produces a wide range of winter sports equipment, including skis, snowboards, and accessories.",
            "A ski brand that produces high-quality skis, boots, bindings, and other accessories for skiers of all levels.",
            "A brand that produces winter sports apparel and gear, including jackets, pants, gloves, and other accessories for skiing, snowboarding, and other winter activities.",
            "A ski brand that produces skis, boots, bindings, and other equipment for skiers of all levels, from beginners to pro athletes.",
            "Another ski brand that produces high-quality skis, boots, bindings, and other accessories for skiers of all levels.",
            "A popular brand that produces winter sports eyewear, including goggles and sunglasses, that are designed for skiing, snowboarding, and other activities."
        ]
    },
    "Hospitality Industry": {
        "names": [
            "Hilton",
            "Marriott International",
            "Airbnb",
            "Expedia",
            "TripAdvisor",
            "Booking.com",
            "InterContinental Hotels Group",
            "Wyndham Hotels & Resorts",
            "American Express Global Business Travel",
            "Accor"
        ],
        "urls": [
            "https://www.hilton.com/",
            "https://www.marriott.com/",
            "https://www.airbnb.com/",
            "https://www.expedia.com/",
            "https://www.tripadvisor.com/",
            "https://www.booking.com/",
            "https://www.ihg.com/",
            "https://www.wyndhamhotels.com/",
            "https://www.amexglobalbusinesstravel.com/",
            "https://www.accor.com/"
        ],
        "descs": [
            "One of the largest and most well-known hotel chains, operating over 5,900 hotels and resorts around the world.",
            "Another major hotel chain with over 7,600 properties in more than 130 countries.",
            "A popular online platform for booking unique accommodations worldwide, including apartments, condos, and houses.",
            "A global travel company offering deals on flights, hotels, rental cars, and vacation packages.",
            "A website that features reviews and ratings for hotels, restaurants, and attractions, with over 830 million reviews and opinions.",
            "A travel fare aggregator website and travel meta search engine for lodging reservations, offering over 28 million listings.",
            "A multinational hotel company with over 5,900 hotels in over 100 countries, including brands such as Holiday Inn, Crowne Plaza, and Kimpton.",
            "A hospitality company with over 9,000 hotels across 80 countries, including brands like Super 8, Days Inn, and La Quinta.",
            "A travel management company that provides corporate travel solutions for businesses of all sizes.",
            "A multinational hospitality company that operates over 4,800 hotels, resorts, and residences across 100 countries, including brands like Sofitel, Novotel, and Mercure."
        ]
    },
    "Mobile & Wireless": {
        "names": [
            "Apple iPhone",
            "Samsung Galaxy",
            "Google Pixel",
            "LG V60 ThinQ",
            "OnePlus 9 Pro",
            "Sony Xperia",
            "Motorola Moto G Power",
            "JBL Bluetooth Speakers",
            "Bose QuietComfort Earbuds",
            "Anker PowerCore"
        ],
        "urls": [
            "https://www.apple.com/iphone/",
            "https://www.samsung.com/us/mobile/galaxy/",
            "https://store.google.com/us/product/pixel_5",
            "https://www.lg.com/us/mobile-phones/v60-thinq-5g",
            "https://www.oneplus.com/9-pro",
            "https://www.sony.com/electronics/smartphones",
            "https://www.motorola.com/us/smartphones-moto-g-power-gen-7/p",
            "https://www.jbl.com/bluetooth-speakers/",
            "https://www.bose.com/en_us/products/headphones/earbuds/quietcomfort-earbuds.html",
            "https://us.anker.com/collections/portable-chargers"
        ],
        "descs": [
            "A popular smartphone brand known for its sleek design and innovative features.",
            "A line of Android smartphones with high-quality cameras and customizable features.",
            "A smartphone brand known for its camera and often receives the latest Android updates.",
            "A premium smartphone with advanced camera features and 5G capabilities.",
            "A high-end Android smartphone with fast charging and outstanding camera performance.",
            "A line of smartphones known for their exceptional camera and audio quality.",
            "A budget smartphone with an extensive battery life and fast performance.",
            "A brand of portable wireless speakers known for their exceptional sound quality.",
            "A pair of wireless earbuds with noise cancellation technology and excellent sound quality.",
            "A brand of portable power banks that can charge devices on the go."
        ]
    },
    "Construction & Maintenance": {
        "names": [
            "Caterpillar Inc.",
            "DeWalt",
            "John Deere",
            "Stanley Black & Decker",
            "Komatsu Ltd.",
            "3M",
            "Bosch",
            "Volvo Construction Equipment",
            "Husqvarna",
            "Black & Decker"
        ],
        "urls": [
            "https://www.caterpillar.com/en.html",
            "https://www.dewalt.com/",
            "https://www.deere.com/en/",
            "https://www.stanleyblackanddecker.com/",
            "https://home.komatsu/en/",
            "https://www.3m.com/",
            "https://www.bosch.com/",
            "https://www.volvoce.com/",
            "https://www.husqvarna.com/us/",
            "https://www.blackanddecker.com/"
        ],
        "descs": [
            "A well-known brand that provides construction equipment and machinery.",
            "A popular brand that specializes in power tools.",
            "A company that provides agricultural, construction, and forestry machines.",
            "A diversified company that produces hand tools, power tools, and other various products.",
            "A leading manufacturer of mining and construction equipment.",
            "A company that produces a variety of construction and maintenance products, such as tapes, adhesives, and abrasives.",
            "A company that produces a range of products, including power tools, automotive parts, and appliances.",
            "A company that designs, manufactures, and delivers construction equipment and services.",
            "A company that provides outdoor power tools and equipment for both consumer and professional use.",
            "A company that provides a range of power tools and outdoor equipment for consumer and professional use."
        ]
    },
    "Geographic Reference": {
        "names": [
            "Google Maps",
            "Esri",
            "TomTom",
            "Mapbox",
            "OpenStreetMap",
            "GeoNames",
            "HERE Technologies",
            "Natural Earth",
            "Geonames-JS",
            "MaxMind"
        ],
        "urls": [
            "https://www.google.com/maps",
            "https://www.esri.com/en-us/home",
            "https://www.tomtom.com/en_gb/",
            "https://www.mapbox.com/",
            "https://www.openstreetmap.org/",
            "https://www.geonames.org/",
            "https://www.here.com/",
            "https://www.naturalearthdata.com/",
            "https://github.com/walling/geonames-js",
            "https://www.maxmind.com/en/home"
        ],
        "descs": [
            "A free, web-based mapping service that provides detailed and accurate maps, as well as satellite imagery of locations around the world.",
            "A geographic information system (GIS) software that provides mapping and analytic capabilities to help businesses make data-driven decisions.",
            "A Dutch-based mapping and navigation company that produces GPS navigation devices, as well as mapping software and services.",
            "A web-based mapping platform that offers custom map design, geocoding, and mapping tools for developers and businesses.",
            "A free, collaborative, and open-source mapping project that allows users to contribute and edit maps of any location in the world.",
            "A user-contributed geographical database that provides names and location data for all countries and territories around the world.",
            "A location data and technology platform that provides mapping and location-based services, as well as fleet management and asset tracking solutions.",
            "A free, public domain dataset that provides global geographic data, including political boundaries, coastlines, and land cover.",
            "A JavaScript library that interfaces with the GeoNames API to provide easy access to detailed geographic data.",
            "A digital mapping and global geolocation service that provides IP intelligence data services, as well as fraud detection and prevention solutions."
        ]
    },
    "Special Occasions": {
        "names": [
            "David's Bridal",
            "Tiffany & Co.",
            "Godiva",
            "Hallmark",
            "Vera Wang",
            "Moët & Chandon",
            "Edible Arrangements",
            "Swarovski",
            "Shutterfly",
            "Harry & David"
        ],
        "urls": [
            "https://www.davidsbridal.com/",
            "https://www.tiffany.com/",
            "https://www.godiva.com/",
            "https://www.hallmark.com/",
            "https://www.verawang.com/",
            "https://www.moet.com/",
            "https://www.ediblearrangements.com/",
            "https://www.swarovski.com/",
            "https://www.shutterfly.com/",
            "https://www.harryanddavid.com/"
        ],
        "descs": [
            "A popular wedding dress and special occasion dress retailer with locations throughout the United States.",
            "A luxury jewelry brand known for its engagement rings and other gifts for special occasions.",
            "A high-end chocolate brand known for its delicious truffles, perfect for gifting on special occasions.",
            "A well-known brand for special occasion cards, gifts, and personalized mementos.",
            "A fashion designer known for her stunning bridal gowns and evening wear, perfect for special occasions.",
            "A luxury Champagne brand known for its high-quality bubbles, perfect for toasting special occasions.",
            "A brand that creates beautiful arrangements of fruit that make for a unique and healthy gift for special occasions.",
            "A high-end crystal jewelry brand that offers stunning pieces to celebrate any special occasion.",
            "A popular website that allows users to create personalized photo albums, prints, and gifts for special occasions.",
            "A gourmet food and gift company that offers a variety of options for special occasion gifting, like fruit baskets and wine sets."
        ]
    },
    "Nursing": {
        "names": [
            "Medela",
            "Boppy",
            "Lansinoh",
            "Tommee Tippee",
            "Huggies",
            "Philips Avent",
            "My Brest Friend",
            "Motherlove",
            "Bamboobies",
            "Boob"
        ],
        "urls": [
            "https://www.medela.us/",
            "https://www.boppy.com/",
            "https://www.lansinoh.com/",
            "https://www.tommeetippee.com/en-us/",
            "https://www.huggies.com/en-us/baby-products/nursing",
            "https://www.usa.philips.com/c-m-mo/baby-feeding/breast-pumps-and-care",
            "https://www.mybrestfriend.com/",
            "https://www.motherlove.com/",
            "https://bamboobies.com/",
            "https://www.boobdesign.com/us/nursingclothes"
        ],
        "descs": [
            "A company that provides a range of breast pumps, breastfeeding accessories, and resources to help nursing mothers.",
            "A brand that offers a range of nursing pillows designed to provide support during breastfeeding.",
            "A company that offers a variety of breastfeeding products such as breast pumps, milk storage bags, and nipple cream.",
            "A brand that provides various baby products including nursing bottles and breast pumps.",
            "A brand that offers nursing pads designed to help with leaks during breastfeeding.",
            "A brand that provides breast pumps, nursing bottles, and other breastfeeding products.",
            "A brand that offers nursing pillows designed to provide support and comfort during breastfeeding.",
            "A company that offers a range of breastfeeding supplements and herbal remedies to help support nursing mothers.",
            "A brand that offers reusable nursing pads and other breastfeeding products.",
            "A brand that provides nursing clothes designed to make breastfeeding easier and more discreet."
        ]
    },
    "Crafts": {
        "names": [
            "Michaels",
            "Joann",
            "Hobby Lobby",
            "Cricut",
            "Brother",
            "Silhouette",
            "Martha Stewart Crafts",
            "Red Heart Yarn",
            "DecoArt",
            "Darice"
        ],
        "urls": [
            "https://www.michaels.com/",
            "https://www.joann.com/",
            "https://www.hobbylobby.com/",
            "https://cricut.com/",
            "https://www.brother-usa.com/home/sewing-embroidery",
            "https://www.silhouetteamerica.com/",
            "https://marthastewart.com/907125/martha-stewart-crafts",
            "https://www.redheart.com/",
            "https://decoart.com/",
            "https://www.darice.com/"
        ],
        "descs": [
            "Arts and crafts supply store offering a wide range of products including DIY kits, painting supplies, and home decor.",
            "Another arts and crafts supply store that specializes in fabrics, sewing & quilting supplies, and knitting & crochet tools. ",
            "Retail chain store that provides home decor, floral, framing, and crafting supplies.",
            "A brand that produces electronic cutting machines and software for personal use, which allows for precision cutting of paper, leather, fabric, and more.",
            "A popular sewing machine brand that makes computerized sewing machines and embroidery machines.",
            "A brand that manufactures cutting machines, tools, and materials for DIY projects such as card making, scrapbooking, and customized apparel.",
            "A line of craft products created and curated by American television personality and entrepreneur Martha Stewart. ",
            "A brand of yarn that offers a wide variety of high-quality yarns for crochet and knitting projects, with patterns and tutorials available on their website. ",
            "A brand known for producing paints, stencils, and finishes for crafting and home decor projects.",
            "An arts and crafts supplier that offers an array of products including jewelry making supplies, foam sheets and shapes, and party supplies."
        ]
    },
    "Energy & Utilities": {
        "names": [
            "ExxonMobil",
            "Royal Dutch Shell",
            "Duke Energy",
            "National Grid",
            "NextEra Energy",
            "Con Edison",
            "Enbridge",
            "Southern Company",
            "E.ON",
            "Dominion Energy"
        ],
        "urls": [
            "https://www.exxonmobil.com/",
            "https://www.shell.com/",
            "https://www.duke-energy.com/",
            "https://www.nationalgrid.com/",
            "https://www.nexteraenergy.com/",
            "https://www.coned.com/",
            "https://www.enbridge.com/",
            "https://www.southerncompany.com/",
            "https://www.eon.com/",
            "https://www.dominionenergy.com/"
        ],
        "descs": [
            "A global oil and gas company that explores, produces, and sells energy resources.",
            "A multinational oil and gas company that provides energy and petrochemical products.",
            "A leading electric power holding company in the United States that delivers electricity to millions of customers.",
            "An international electricity and gas company that develops, operates, and maintains energy transmission systems.",
            "A clean energy company that generates electricity from wind, solar, and nuclear power.",
            "An electric, gas, and steam utility company that provides energy solutions to the New York metropolitan area.",
            "A Canadian energy transportation company that operates pipelines and energy infrastructure.",
            "A leading energy company that generates, transmits, and distributes electricity in the United States.",
            "A European energy company that specializes in energy networks, customer solutions, and renewables.",
            "A utility company that provides electricity and natural gas to customers in the United States."
        ]
    },
    "Business News": {
        "names": [
            "CNBC",
            "The Wall Street Journal",
            "Bloomberg",
            "Forbes",
            "Financial Times",
            "Harvard Business Review",
            "The Economist",
            "Barron's",
            "Fortune",
            "Business Insider"
        ],
        "urls": [
            "https://www.cnbc.com/",
            "https://www.wsj.com/",
            "https://www.bloomberg.com/",
            "https://www.forbes.com/",
            "https://www.ft.com/",
            "https://hbr.org/",
            "https://www.economist.com/",
            "https://www.barrons.com/",
            "https://fortune.com/",
            "https://www.businessinsider.com/"
        ],
        "descs": [
            "A media organization focused on delivering the latest economic and financial news.",
            "A trusted source of business news, providing insights into politics and finance.",
            "A financial data and media company delivering real-time financial news and analysis.",
            "A leading source of reliable business news, financial information, and insights into the world of entrepreneurship and successful business strategies.",
            "A global business news organization providing diverse views and opinions on news, politics, and finance.",
            "A publication focused on new ideas and researches to help business leaders improve their business acumen.",
            "A weekly publication discussing a variety of topics including business, finance, politics, technology, and more.",
            "A reliable source of business and financial news and market analysis.",
            "A global leader in business journalism providing insightful articles, interviews, and insights on the world of business.",
            "A news publication delivering real-time business news, financial insights, and analysis across different industries."
        ]
    },
    "Mathematics": {
        "names": [
            "The Art of Problem Solving",
            "Khan Academy",
            "The MathWorks",
            "Wolfram Research",
            "Coursera",
            "Mathnasium",
            "MATHCOUNTS",
            "Desmos",
            "MathJax",
            "IXL Math"
        ],
        "urls": [
            "https://artofproblemsolving.com/",
            "https://www.khanacademy.org/",
            "https://www.mathworks.com/",
            "https://www.wolfram.com/",
            "https://www.coursera.org/",
            "https://www.mathnasium.com/",
            "https://www.mathcounts.org/",
            "https://www.desmos.com/",
            "https://www.mathjax.org/",
            "https://www.ixl.com/math/"
        ],
        "descs": [
            "A website that provides comprehensive resources for students interested in problem-solving in math and other areas.",
            "A non-profit organization that offers free online courses, including math courses for all levels.",
            "A company that provides software and tools for mathematical computing and simulation, widely used in industries like engineering and finance.",
            "A company that offers various products related to computational mathematics, including Wolfram|Alpha, a knowledge engine that answers questions using computational methods.",
            "A platform that offers online courses from top universities and institutions, including many courses in math and related subjects.",
            "A math-only learning center that provides customized tutoring and enrichment programs for students of all ages and skill levels.",
            "A non-profit organization that provides math competitions, materials, and programs for middle school students.",
            "An online graphing calculator and math learning platform.",
            "A JavaScript library that enables the display of mathematical equations on web pages.",
            "An online math learning platform that provides interactive practice problems and assessments for K-12 students."
        ]
    },
    "Bicycles & Accessories": {
        "names": [
            "Trek Bikes",
            "Shimano",
            "Specialized Bikes",
            "Bontrager",
            "Cannondale",
            "Giro",
            "Park Tool",
            "Continental Tires",
            "Yakima",
            "Lezyne"
        ],
        "urls": [
            "https://www.trekbikes.com/",
            "https://bike.shimano.com",
            "https://www.specialized.com/",
            "https://www.trekbikes.com/us/en_US/equipment/cycling-components/bike-wheels/c/B514/",
            "https://www.cannondale.com/",
            "https://www.giro.com/",
            "https://www.parktool.com/",
            "https://www.continental-tires.com/bicycle",
            "https://www.yakima.com/",
            "https://www.lezyne.com/"
        ],
        "descs": [
            "A well-known brand for both road and mountain bikes with a wide range of options for all levels of cyclists.",
            "A leading brand for bike components, including gears, brakes, and pedals, with a reputation for high quality and reliability.",
            "A brand that focuses on creating bikes for various purposes, including road, mountain, and electric bikes, with an emphasis on innovation and performance.",
            "A Trek-owned brand that offers bike wheels, tires, and accessories such as helmets, handlebars, and lights.",
            "A brand that creates high-performance road, mountain, and urban bikes, known for their innovative designs and use of lightweight materials.",
            "A brand that offers bike helmets, shoes, and apparel for both men and women, with a focus on design, quality, and advanced technology.",
            "A company that specializes in bike repair and maintenance tools for home and professional use, with a wide range of high-quality products available.",
            "A company that makes bike tires for various purposes, including road, mountain, and touring bikes, known for their durability and puncture resistance.",
            "A brand that offers bike racks, cargo carriers, and other car accessories to transport bikes and gear with ease, known for their versatile and reliable products.",
            "A company that produces bike pumps, tools, and lights for cyclists of all levels, with an emphasis on high-performance designs and durable materials."
        ]
    },
    "Clubs & Organizations": {
        "names": [
            "Meetup",
            "Rotary International",
            "Toastmasters International",
            "Kiwanis International",
            "Lions Clubs International",
            "Girl Scouts of the USA",
            "Boys & Girls Clubs of America",
            "4-H",
            "National Honor Society",
            "Future Business Leaders of America"
        ],
        "urls": [
            "https://www.meetup.com/",
            "https://www.rotary.org/en",
            "https://www.toastmasters.org/",
            "https://www.kiwanis.org/",
            "https://www.lionsclubs.org/en",
            "https://www.girlscouts.org/",
            "https://www.bgca.org/",
            "https://4-h.org/",
            "https://www.nhs.us/",
            "https://www.fbla-pbl.org/"
        ],
        "descs": [
            "A platform that connects people with common interests and helps them organize and attend events in their local community.",
            "A global network of community volunteers who work on a range of projects to promote peace, fight disease, provide clean water, support education, and grow local economies.",
            "A non-profit organization that helps members improve their public speaking and leadership skills through a network of clubs around the world.",
            "A volunteer service organization focused on improving the lives of children and communities through various projects and initiatives.",
            "A humanitarian organization that works on a range of projects to support vision, diabetes awareness, youth outreach, and disaster relief efforts.",
            "An organization dedicated to empowering girls and building strong leadership skills through a range of activities and programs.",
            "A national organization that provides a safe and positive environment for kids to learn, grow, and develop through various programs and activities.",
            "A youth development organization that provides educational opportunities in the areas of science, engineering, technology, and agriculture through local clubs and programs.",
            "An organization that recognizes high-achieving high school students and provides opportunities for community service, leadership, and academic excellence.",
            "An organization that prepares students for careers in business and technology through competitions, leadership development, and networking opportunities."
        ]
    },
    "Combat Sports": {
        "names": [
            "UFC",
            "Hayabusa",
            "Revgear",
            "Venum",
            "Fairtex",
            "Cleto Reyes",
            "Twins Special",
            "Title Boxing",
            "Everlast",
            "Ringside"
        ],
        "urls": [
            "https://www.ufc.com/",
            "https://www.hayabusafight.com/",
            "https://revgear.com/",
            "https://www.venum.com/",
            "https://www.fairtex.com/",
            "https://www.cletoreyes.com/",
            "https://www.twinsfightgear.com/",
            "https://www.titleboxing.com/",
            "https://www.everlast.com/",
            "https://www.ringside.com/"
        ],
        "descs": [
            "The Ultimate Fighting Championship is the largest mixed martial arts promotion in the world.",
            "Specializes in high-quality combat sports equipment including gloves, shin guards, and headgear.",
            "A leading manufacturer of martial arts equipment including gloves, hand wraps, and headgear.",
            "One of the world's leading combat sports brands with a wide range of products including gloves, clothing, and training equipment.",
            "Known for producing Muay Thai equipment, including gloves, shin guards, and shorts.",
            "A well-known Mexican brand producing high-quality boxing gloves for over 70 years.",
            "Produces Muay Thai equipment and gloves that are highly regarded in the combat sports community.",
            "Offers a range of combat sports equipment including gloves, mitts, and bags.",
            "A traditional boxing brand that offers boxing gloves, heavy bags, and other training equipment.",
            "A popular brand that produces boxing gloves, headgear, and other MMA gear."
        ]
    },
    "Yard & Patio": {
        "names": [
            "Weber",
            "Toro",
            "Garden Treasures",
            "Black+Decker",
            "Husqvarna",
            "Sunbrella",
            "Keter",
            "Suncast",
            "Miracle-Gro",
            "Char-Broil"
        ],
        "urls": [
            "https://www.weber.com/US/en/home/",
            "https://www.toro.com/",
            "https://www.gardentreasuresliving.com/",
            "https://www.blackanddecker.com/",
            "https://www.husqvarna.com/us/",
            "https://www.sunbrella.com/",
            "https://www.keter.com/en",
            "https://www.suncast.com/",
            "https://www.miraclegro.com/",
            "https://www.charbroil.com/"
        ],
        "descs": [
            "Offers a wide range of high-quality grills and accessories for outdoor cooking.",
            "Provides lawn mowers, irrigation systems, and other yard tools to keep your lawn and garden healthy and beautiful.",
            "Offers a variety of outdoor furniture and decor to make your patio a comfortable and stylish living space.",
            "Provides a range of outdoor power tools like lawn mowers, trimmers, and leaf blowers to help you easily maintain your lawn and garden.",
            "Offers a range of outdoor power equipment including lawn mowers, chainsaws, and trimmers.",
            "Offers high-quality outdoor fabrics that are weather-resistant and durable for use on patio furniture and decor.",
            "Provides a range of outdoor storage solutions like deck boxes and sheds to help you organize your patio and yard.",
            "Offers a variety of outdoor storage solutions and furniture, including sheds, deck boxes, and patio furniture.",
            "Provides a range of lawn and garden care products, including soil, plant food, and insecticides.",
            "Offers a wide range of gas and charcoal grills, as well as accessories like grill covers and tools, to help you create the perfect outdoor cooking setup."
        ]
    },
    "TV & Video": {
        "names": [
            "Samsung",
            "LG",
            "Sony",
            "Vizio",
            "TCL",
            "Amazon Fire TV",
            "Google Chromecast",
            "Apple TV",
            "Roku",
            "Nvidia Shield TV"
        ],
        "urls": [
            "https://www.samsung.com/us/televisions-home-theater/tvs/",
            "https://www.lg.com/us/tvs/all-tvs",
            "https://www.sony.com/electronics/televisions",
            "https://www.vizio.com/en/tvs",
            "https://www.tcl.com/us/en/products/home-theater.html",
            "https://www.amazon.com/Fire-TV/b?node=8521791011",
            "https://store.google.com/us/category/connected_home?hl=en-US",
            "https://www.apple.com/apple-tv-4k/",
            "https://www.roku.com/products",
            "https://www.nvidia.com/en-us/shield/"
        ],
        "descs": [
            "A popular brand that offers a wide range of televisions (4K, QLED, LED, etc.) for every budget and need.",
            "Another brand with a diverse selection of televisions featuring OLED, NanoCell and 4K technology.",
            "Known for its high-end televisions with advanced features such as 8K resolution, HDR and OLED displays.",
            "Specializes in affordable, high-quality smart TVs with an emphasis on delivering a great viewing experience.",
            "Offers a range of affordable 4K and QLED televisions with built-in Roku technology.",
            "A streaming media player that allows users to easily access apps and watch shows and movies from various streaming services.",
            "A streaming device that allows users to \"cast\" content from their phone, tablet or computer to their TV.",
            "A streaming device with a sleek design and features such as 4K HDR and the ability to use Siri to search for content.",
            "Offers multiple streaming devices, including the Roku Streaming Stick and Roku Ultra, for a variety of needs and budgets.",
            "A high-end streaming device that supports 4K and HDR content, gaming and features the Google Assistant."
        ]
    },
    "Entertainment Media": {
        "names": [
            "Netflix",
            "Disney+",
            "Hulu",
            "HBO Max",
            "Apple TV+",
            "Amazon Prime Video",
            "YouTube",
            "Spotify",
            "Pandora",
            "Audible"
        ],
        "urls": [
            "https://www.netflix.com/",
            "https://www.disneyplus.com/",
            "https://www.hulu.com/",
            "https://www.hbomax.com/",
            "https://www.apple.com/apple-tv-plus/",
            "https://www.amazon.com/Amazon-Video",
            "https://www.youtube.com/",
            "https://www.spotify.com/",
            "https://www.pandora.com/",
            "https://www.audible.com/"
        ],
        "descs": [
            "A subscription-based streaming service offering a wide selection of movies and TV shows.",
            "A streaming platform that features a vast library of movies and series from Disney, Pixar, Marvel, and Star Wars.",
            "A subscription-based streaming service offering current and past seasons of popular TV shows.",
            "A streaming platform featuring exclusive content from HBO, as well as popular TV shows and movies.",
            "A streaming service that features original content produced by Apple.",
            "A subscription-based streaming service with a large selection of movies and TV shows.",
            "A video-sharing platform featuring user-generated content and official music videos.",
            "A digital music streaming service that allows users to listen to millions of songs and create playlists.",
            "A music streaming service that creates personalized radio stations based on the user's preferences.",
            "An audiobook and podcast service offering a wide range of spoken-word content."
        ]
    },
    "Toys": {
        "names": [
            "LEGO",
            "Barbie",
            "Hot Wheels",
            "Play-Doh",
            "Nerf",
            "Fisher-Price",
            "Hasbro",
            "Crayola",
            "American Girl Doll",
            "Paw Patrol"
        ],
        "urls": [
            "https://www.lego.com/",
            "https://barbie.mattel.com/",
            "https://www.hotwheels.com/",
            "https://playdoh.hasbro.com/en-us",
            "https://nerf.hasbro.com/en-us",
            "https://www.fisher-price.com/en-us",
            "https://www.hasbro.com/",
            "https://www.crayola.com/",
            "https://www.americangirl.com/",
            "https://pawpatrol.com/"
        ],
        "descs": [
            "A classic construction toy made out of colorful plastic building blocks",
            "An iconic doll and toy company that has been around for decades",
            "A collection of die-cast toy cars in a variety of colors and designs",
            "A modeling compound that allows children to sculpt and create their own creations",
            "A line of foam-based toys that include blasters, darts, and other play items",
            "A company known for producing toys geared towards infants and young children",
            "The parent company of many popular toy brands, including Transformers and My Little Pony",
            "A company that produces a range of art supplies for kids, including crayons, pencils, and markers",
            "A line of dolls that come with their own unique stories and accessories",
            "A popular animated television show that has its own line of toys, including action figures and playsets."
        ]
    },
    "Air Travel": {
        "names": [
            "Delta Air Lines",
            "Samsonite",
            "Bose QuietComfort 35 II",
            "Tumi",
            "United Airlines",
            "Away",
            "American Tourister",
            "Southwest Airlines",
            "GoPro HERO8 Black",
            "Hilton Hotels & Resorts"
        ],
        "urls": [
            "https://www.delta.com/",
            "https://www.samsonite.com/",
            "https://www.bose.com/en_us/products/headphones/over_ear_headphones/quietcomfort-35-wireless-ii.html",
            "https://www.tumi.com/",
            "https://www.united.com/",
            "https://www.awaytravel.com/",
            "https://shop.americantourister.com/",
            "https://www.southwest.com/",
            "https://gopro.com/en/us/shop/cameras/hero8-black/CHDHX-801-master.html",
            "https://www.hilton.com/en/"
        ],
        "descs": [
            "A major American airline with global destinations and a variety of services such as Sky Club lounges.",
            "A popular brand of luggage and travel accessories known for their durability and functionality.",
            "One of the most popular noise-canceling headphones for air travel.",
            "A luxury brand of luggage, bags, and travel accessories known for their style and quality.",
            "A major American airline with global destinations and a variety of services such as United Club lounges.",
            "A modern and stylish luggage brand that offers a variety of sizes and smart features such as built-in chargers.",
            "A budget-friendly brand of luggage and travel accessories known for their colorful and fun designs.",
            "A budget-friendly American airline that offers low fares and unique features such as open seating and no baggage fees.",
            "A popular action camera that is compact and ideal for capturing adventures during air travel.",
            "A global hotel brand with properties near airports and in popular travel destinations."
        ]
    },
    "Family-Oriented Games & Activities": {
        "names": [
            "Jenga",
            "Apples to Apples",
            "Monopoly",
            "Uno",
            "Twister",
            "Pictionary",
            "Scrabble",
            "Yahtzee",
            "Clue",
            "Bananagrams"
        ],
        "urls": [
            "https://www.jenga.com/",
            "https://www.mattelgames.com/en-us/apples-to-apples",
            "https://monopoly.hasbro.com/en-us",
            "https://www.mattelgames.com/en-us/uno",
            "https://twister.hasbro.com/en-us",
            "https://www.mattelgames.com/en-us/pictionary",
            "https://scrabble.hasbro.com/en-us",
            "https://www.hasbro.com/en-us/brands/yahtzee",
            "https://clue.hasbro.com/en-us",
            "https://bananagrams.com/"
        ],
        "descs": [
            "A classic game that tests your hand-eye coordination and strategy skills.",
            "A fun family card game where players try to match nouns with adjectives.",
            "A popular board game that teaches financial strategy and negotiation skills.",
            "A fast-paced card game that's great for all ages.",
            "A game that challenges players to contort themselves on a colorful mat.",
            "A popular drawing game where players try to guess what their teammates are drawing.",
            "A classic word game that's great for building vocabulary and critical thinking skills.",
            "A dice game that's perfect for a family game night.",
            "A mystery game where players identify suspects, weapons, and locations to solve a crime.",
            "A fast-paced word game that's perfect for travel and family game nights."
        ]
    },
    "Investing": {
        "names": [
            "Robinhood",
            "Acorns",
            "Vanguard",
            "Fidelity Investments",
            "Charles Schwab",
            "TD Ameritrade",
            "Betterment",
            "Wealthfront",
            "E-Trade",
            "Ally Invest"
        ],
        "urls": [
            "https://robinhood.com/",
            "https://www.acorns.com/",
            "https://investor.vanguard.com/home/",
            "https://www.fidelity.com/",
            "https://www.schwab.com/",
            "https://www.tdameritrade.com/",
            "https://www.betterment.com/",
            "https://www.wealthfront.com/",
            "https://us.etrade.com/home",
            "https://www.ally.com/invest/"
        ],
        "descs": [
            "A popular investing app that allows users to buy and sell stocks, ETFs, options, and cryptocurrencies with no commissions.",
            "An investment app that allows users to invest spare change from everyday purchases in a diversified portfolio.",
            "A well-known investment firm that offers a variety of low-cost mutual funds, ETFs, and retirement products.",
            "A comprehensive financial services company that offers investing, retirement planning, wealth management, and more.",
            "A popular investment firm that offers low-cost trading, comprehensive financial planning, and a range of investment products.",
            "An online brokerage that offers commission-free trading of stocks, ETFs, options, and mutual funds.",
            "An online investment platform that offers low-fee automated investment management and financial planning services.",
            "A digital investment platform that manages portfolios using technology algorithms to optimize tax efficiency and diversification.",
            "A popular online brokerage that offers a wide range of investment products and sophisticated trading tools.",
            "A low-cost online brokerage that offers self-directed trading and automated managed portfolios."
        ]
    },
    "Language Resources": {
        "names": [
            "Duolingo",
            "Rosetta Stone",
            "Babbel",
            "Anki",
            "Memrise",
            "Lingoda",
            "Busuu",
            "Pimsleur",
            "FluentU",
            "Mango Languages"
        ],
        "urls": [
            "https://www.duolingo.com/",
            "https://www.rosettastone.com",
            "https://www.babbel.com/",
            "https://apps.ankiweb.net/",
            "https://www.memrise.com/",
            "https://www.lingoda.com/",
            "https://www.busuu.com/",
            "https://www.pimsleur.com/",
            "https://www.fluentu.com/",
            "https://www.mangolanguages.com/"
        ],
        "descs": [
            "A popular language-learning platform with gamified lessons and personalized learning experiences.",
            "A language learning software with a focus on natural language immersion and interactive activities.",
            "A language learning app and website with a focus on conversational skills and real-world situations.",
            "A flashcard app with customizable decks and algorithmic learning that's useful for language learning.",
            "A language learning app and website with an emphasis on visual and auditory learning.",
            "An online language school that offers group and private lessons in multiple languages with certified teachers.",
            "A language learning app and website with a social component that allows students to connect with native speakers.",
            "An audio-based language learning program that focuses on practical conversation skills using spaced repetition techniques.",
            "A language learning resource that uses real-world videos to help learners improve their listening, speaking, and comprehension skills.",
            "A language learning platform with interactive lessons and a focus on cultural immersion."
        ]
    },
    "Team Sports": {},
    "Enterprise Technology": {
        "names": [
            "Amazon Web Services (AWS)",
            "Microsoft Azure",
            "IBM Cloud",
            "Cisco Systems",
            "Oracle Corporation",
            "Dell Technologies",
            "HP Inc.",
            "Salesforce",
            "Citrix Systems",
            "VMware"
        ],
        "urls": [
            "https://aws.amazon.com/",
            "https://azure.microsoft.com/",
            "https://www.ibm.com/cloud",
            "https://www.cisco.com/",
            "https://www.oracle.com/",
            "https://www.delltechnologies.com/",
            "https://www.hp.com/",
            "https://www.salesforce.com/",
            "https://www.citrix.com/",
            "https://www.vmware.com/"
        ],
        "descs": [
            "A comprehensive cloud computing platform that offers a range of services to help businesses scale and grow.",
            "A cloud computing platform that provides users with the flexibility and power needed to build, deploy, and manage applications.",
            "A cloud computing platform that offers a range of services, including infrastructure as a service (IaaS), platform as a service (PaaS), and software as a service (SaaS).",
            "A multinational technology conglomerate that specializes in networking hardware, software, and services.",
            "A multinational technology company that specializes in database software and technology, cloud engineered systems, and enterprise software products.",
            "A multinational technology company that provides a range of hardware and software solutions for businesses of all sizes.",
            "A multinational technology company that provides hardware and software solutions for personal and enterprise use.",
            "A customer relationship management (CRM) platform that helps businesses manage their interactions with customers and automate sales processes.",
            "A multinational technology company that provides virtualization, networking, and cloud computing solutions for businesses.",
            "A cloud computing and virtualization software company that provides businesses with the infrastructure needed to build and run their applications."
        ]
    },
    "Business Finance": {
        "names": [
            "QuickBooks",
            "Freshbooks",
            "Xero",
            "QuickBooks Online",
            "Kabbage",
            "Square Capital",
            "Expensify",
            "Gusto",
            "Paychex",
            "FreshBooks Cloud Accounting"
        ],
        "urls": [
            "https://quickbooks.intuit.com/",
            "https://www.freshbooks.com/",
            "https://www.xero.com/",
            "https://quickbooks.intuit.com/online/",
            "https://www.kabbage.com/",
            "https://squareup.com/capital",
            "https://www.expensify.com/",
            "https://gusto.com/product/payroll",
            "https://www.paychex.com/",
            "https://apps.apple.com/us/app/freshbooks-cloud-accounting/id1052884036"
        ],
        "descs": [
            "A popular accounting software for small businesses.",
            "An invoicing and accounting software for freelancers and small businesses.",
            "An accounting software for small-to-medium-sized businesses with tools for invoicing, payroll, and inventory management.",
            "A web-based version of the popular QuickBooks accounting software.",
            "A lending platform that offers small business loans and lines of credit.",
            "A lending service provided by the payment processing company Square for eligible Square users.",
            "A software that simplifies expense tracking and management, ideal for small businesses and freelancers.",
            "A payroll and HR software designed for small businesses, with tools for benefits administration, compliance management, and time tracking.",
            "A comprehensive payroll and HR management software for small to medium-sized businesses.",
            "A mobile app version of Freshbooks invoicing and accounting software."
        ]
    },
    "Vehicle Codes & Driving Laws": {
        "names": [
            "AAA Digest of Motor Laws",
            "DMV.org",
            "National Highway Traffic Safety Administration (NHTSA)",
            "Insurance Institute for Highway Safety (IIHS)",
            "State Farm Teen Driver Safety",
            "Roadside America",
            "Drive Safely",
            "Smart Start",
            "Waze",
            "Uber"
        ],
        "urls": [
            "https://drivinglaws.aaa.com/digest-of-motor-laws/",
            "https://www.dmv.org/",
            "https://www.nhtsa.gov/",
            "https://www.iihs.org/",
            "https://www.statefarm.com/simple-insights/auto-and-vehicles/teen-driver-safety",
            "https://www.roadsideamerica.com/",
            "https://www.idrivesafely.com/",
            "https://www.smartstartinc.com/",
            "https://www.waze.com/",
            "https://www.uber.com/"
        ],
        "descs": [
            "A comprehensive collection of motor vehicle laws for all U.S. states and Canadian provinces.",
            "An online resource that provides information on driving-related topics such as licensing and registration.",
            "A government agency that sets and enforces safety standards for motor vehicles and promotes safe driving practices.",
            "A non-profit organization that conducts research on vehicle safety and provides ratings for vehicles based on crash tests.",
            "A program that offers resources and tips for parents of teen drivers to help them stay safe on the road.",
            "A website that highlights odd and unusual roadside attractions across the United States.",
            "An online defensive driving course that may satisfy court-mandated requirements or lower insurance rates.",
            "A provider of ignition interlock devices that prevent drunk driving by requiring the driver to pass a breathalyzer test before starting the vehicle.",
            "A navigation app that provides real-time traffic alerts, including accidents, construction, and road closures.",
            "A ridesharing service that allows users to quickly and easily request a ride and pay through the app."
        ]
    },
    "Medical Facilities & Services": {
        "names": [
            "Mayo Clinic",
            "Cleveland Clinic",
            "Johns Hopkins Medicine",
            "Kaiser Permanente",
            "Mount Sinai Health System",
            "Massachusetts General Hospital",
            "UnitedHealth Group",
            "Tenet Healthcare",
            "HCA Healthcare",
            "CVS Health"
        ],
        "urls": [
            "https://www.mayoclinic.org/",
            "https://my.clevelandclinic.org/",
            "https://www.hopkinsmedicine.org/",
            "https://www.kaiserpermanente.org/",
            "https://www.mountsinai.org/",
            "https://www.massgeneral.org/",
            "https://www.unitedhealthgroup.com/",
            "https://www.tenethealth.com/",
            "https://hcahealthcare.com/",
            "https://www.cvshealth.com/"
        ],
        "descs": [
            "A world-renowned medical center that provides comprehensive care for patients from all over the globe.",
            "A nonprofit academic medical center that offers specialized treatments and therapies for complex medical conditions.",
            "A top-ranked medical institution that integrates patient care, teaching, and research to advance healthcare practices.",
            "A healthcare system that serves its members with high-quality care, preventive services, and health education.",
            "An academic medical center that provides patient care, research, and education to improve the health outcomes of its patients.",
            "A top-tier hospital that offers comprehensive care in more than 30 clinical specialties and subspecialties.",
            "A diversified healthcare company that offers health insurance, pharmacy benefits, and health technology services to millions of customers.",
            "A healthcare services company that manages and operates hospitals, surgical centers, and urgent care centers across the United States.",
            "An American healthcare provider that owns and operates hospitals and other healthcare facilities in 20 states.",
            "A leading healthcare company that provides pharmacy services, retail clinics, and health insurance to customers across the country."
        ]
    },
    "Face & Body Care": {
        "names": [
            "Cetaphil",
            "Dove",
            "Neutrogena",
            "Aveeno",
            "La Roche-Posay",
            "The Body Shop",
            "Glossier",
            "Eucerin",
            "Palmer's",
            "Kiehl's"
        ],
        "urls": [
            "https://www.cetaphil.com/",
            "https://www.dove.com/us/en/home.html",
            "https://www.neutrogena.com/",
            "https://www.aveeno.com/",
            "https://laroche-posay.us/",
            "https://www.thebodyshop.com/en-us",
            "https://www.glossier.com/",
            "https://www.eucerinus.com/",
            "https://www.palmers.com/en/us",
            "https://www.kiehls.com/"
        ],
        "descs": [
            "A popular brand of gentle yet effective facial and body cleansers, moisturizers, and sunscreens",
            "A widely recognized brand of soap bars, body washes, and deodorants that focus on moisturizing and nourishing skin",
            "A dermatologist-recommended brand of skincare products that range from facial cleansers to body lotions",
            "A brand that uses natural ingredients like oatmeal to soothe and protect sensitive skin through its range of body lotions and facial moisturizers",
            "A French skincare brand trusted by dermatologists for its range of products for sensitive and acne-prone skin",
            "A brand that offers a variety of skincare products for both face and body, including moisturizers, scrubs, and face masks, using mostly natural ingredients",
            "A modern, minimalist brand of skincare and makeup products that focus on enhancing natural beauty, including facial cleansers, serums, and body lotions.",
            "A brand that specializes in skincare products for sensitive and dry skin and is known for its gentle yet effective range of body lotions and facial moisturizers",
            "A trusted brand of facial and body moisturizers, lotions, and creams that use natural ingredients like cocoa butter to help heal dry and damaged skin",
            "A brand that offers high-quality, dermatologist-recommended skincare products, including facial serums, moisturizers, and body lotions, that use natural ingredients like squalane and avocado oil to improve skin health."
        ]
    },
    "Board Games": {
        "names": [
            "Catan",
            "Ticket to Ride",
            "Carcassonne",
            "Pandemic",
            "Codenames",
            "Splendor",
            "Dominion",
            "Betrayal at Baldur's Gate",
            "Scythe",
            "Settlers of America Trails to Rails"
        ],
        "urls": [
            "https://www.catan.com/",
            "https://www.daysofwonder.com/tickettoride/en/usa/",
            "https://www.zmangames.com/en/games/carcassonne/",
            "https://www.zmangames.com/en/games/pandemic/",
            "https://czechgames.com/en/codenames/",
            "https://www.asmodee.us/en/games/splendor/",
            "https://www.riograndegames.com/games/dominion/",
            "https://avalonhill.wizards.com/games/betrayal-at-baldurs-gate",
            "https://stonemaiergames.com/games/scythe/",
            "https://boardgamegeek.com/boardgame/114324/settlers-america-trails-rails"
        ],
        "descs": [
            "A strategy board game that involves trading and building settlements. ",
            "A railway-themed game where players try to connect cities by laying down train routes. ",
            "A tile-placement game where players build medieval cities and roads. ",
            "A cooperative game where players work together to stop the spread of a global pandemic. ",
            "A word game where players try to guess the words associated with their team without guessing the opposing team's words. ",
            "A strategy game where players collect gems and build their own gem-mining business. ",
            "A deck-building game where players compete to build the most powerful kingdom. ",
            "A horror-themed game where players explore a haunted city and uncover its secrets. ",
            "A strategy game set in an alternate 1920s Europe where players compete to gain control of resources and territory. ",
            "A variation of Catan where players build railways across America and trade goods to become the most powerful rail tycoon."
        ]
    },
    "Extreme Sports": {
        "names": [
            "Red Bull",
            "GoPro",
            "The North Face",
            "Oakley",
            "Vans",
            "Salomon",
            "K2 Sports",
            "Quiksilver",
            "Black Diamond",
            "Burton Snowboards"
        ],
        "urls": [
            "https://www.redbull.com",
            "https://gopro.com/",
            "https://www.thenorthface.com/",
            "https://www.oakley.com/",
            "https://www.vans.com/",
            "https://www.salomon.com/",
            "https://k2sports.com/",
            "https://www.quiksilver.com/",
            "https://www.blackdiamondequipment.com/en_US/",
            "https://www.burton.com/"
        ],
        "descs": [
            "A leading brand in the energy drink market that sponsors extreme sports events and athletes.",
            "Manufactures durable action cameras that are a popular choice among extreme sports athletes.",
            "A brand known for its high-quality outdoor gear and apparel, including clothing and equipment designed for extreme sports like rock climbing and snowboarding.",
            "A brand that offers high-quality sunglasses and goggles designed for extreme sports like surfing, snowboarding, and mountain biking.",
            "A brand that produces skate shoes and apparel that are popular among skateboarders and other extreme sports enthusiasts.",
            "A brand that offers high-performance outdoor gear and apparel, including products designed for extreme sports like skiing, snowboarding, and trail running.",
            "A company that produces a wide range of outdoor gear and apparel, including products designed for snowboarding, skiing, and skateboarding.",
            "A brand that specializes in surf and skate apparel and accessories, and has sponsored numerous extreme sports events and athletes.",
            "A brand that produces high-quality gear and apparel designed for extreme sports like rock climbing, skiing, and mountaineering.",
            "A brand that designs and produces snowboards, boots, and bindings, as well as other winter sports gear and apparel."
        ]
    },
    "Legal": {
        "names": [
            "LegalZoom",
            "Thomson Reuters",
            "LexisNexis",
            "Westlaw",
            "Avvo",
            "Rocket Lawyer",
            "FindLaw",
            "NOLO",
            "LawDepot",
            "LegalMatch"
        ],
        "urls": [
            "https://www.legalzoom.com/",
            "https://www.thomsonreuters.com/en.html",
            "https://www.lexisnexis.com/en-us/home.page",
            "https://legal.thomsonreuters.com/en/products/westlaw",
            "https://www.avvo.com/",
            "https://www.rocketlawyer.com/",
            "https://www.findlaw.com/",
            "https://www.nolo.com/",
            "https://www.lawdepot.com/",
            "https://www.legalmatch.com/"
        ],
        "descs": [
            "Offers online legal services such as forming a business, creating legal documents, and trademark registration.",
            "Provides legal solutions such as research tools, practice management software, and legal news.",
            "Offers legal research and analytics, as well as practice management software.",
            "Provides legal research tools and resources for legal professionals.",
            "A legal marketplace that connects clients with lawyers and offers legal advice.",
            "Offers online legal services such as creating legal documents and finding a lawyer.",
            "Provides online legal information and resources for consumers and legal professionals.",
            "Offers legal books and software, as well as online legal information and resources.",
            "Provides customizable legal documents such as contracts and agreements.",
            "A legal matching service that connects clients with local attorneys."
        ]
    },
    "Home Furnishings": {
        "names": [
            "IKEA",
            "West Elm",
            "Crate & Barrel",
            "Pottery Barn",
            "Restoration Hardware",
            "Wayfair",
            "Anthropologie",
            "CB2",
            "HomeGoods",
            "Zara Home"
        ],
        "urls": [
            "https://www.ikea.com/",
            "https://www.westelm.com/",
            "https://www.crateandbarrel.com/",
            "https://www.potterybarn.com/",
            "https://www.rh.com/",
            "https://www.wayfair.com/",
            "https://www.anthropologie.com/",
            "https://www.cb2.com/",
            "https://www.homegoods.com/",
            "https://www.zarahome.com/"
        ],
        "descs": [
            "A popular Swedish furniture and home decor brand known for modern and affordable designs.",
            "A modern furniture and home goods retailer featuring sustainable and handcrafted products.",
            "A home furnishings and decor brand offering a variety of styles and price points.",
            "A high-end home decor retailer that specializes in comfortable and timeless designs.",
            "A luxury home furnishings brand known for their premium materials and craftsmanship.",
            "An online retailer that offers a vast selection of furniture and home decor items from various brands and styles.",
            "A lifestyle brand that offers bohemian-chic home decor, furniture, and clothing.",
            "A modern furniture and home decor brand that focuses on urban designs and functionality.",
            "A home decor retailer that offers a wide range of affordable and eclectic products.",
            "A fashionable home furnishings brand that offers modern and trendy designs at an affordable price point."
        ]
    },
    "Electronics & Electrical": {
        "names": [
            "Samsung",
            "Apple",
            "Sony",
            "Bose",
            "LG",
            "Canon",
            "Panasonic",
            "Philips",
            "Microsoft",
            "Asus"
        ],
        "urls": [
            "https://www.samsung.com",
            "https://www.apple.com/",
            "https://www.sony.com/",
            "https://www.bose.com/",
            "https://www.lg.com/us",
            "https://www.usa.canon.com/",
            "https://www.panasonic.com/global/home.html",
            "https://www.usa.philips.com/",
            "https://www.microsoft.com/",
            "https://www.asus.com/us/"
        ],
        "descs": [
            "A global technology giant that creates electronics, appliances, and mobile devices for consumers.",
            "A multinational corporation that designs and manufactures high-end electronics, including smartphones, tablets, and laptops.",
            "A Japanese electronics company that produces high-quality television sets, gaming consoles, and audio equipment.",
            "A company that creates high-performance audio systems and headphones for home entertainment and personal listening.",
            "A Korean electronics company that creates innovative televisions, smartphones, and home appliances.",
            "A leading brand in the camera and photography industry, with high-quality cameras, lenses, and accessories.",
            "A Japanese company that produces quality electronic products & home appliances.",
            "A company that produces consumer electronics, personal care products, and healthcare equipment.",
            "A tech giant that creates software, hardware, and devices including laptops, tablets, and gaming consoles.",
            "A Taiwanese multitech company renowned for their laptops, smartphones, tablet computers, and hybrid units."
        ]
    },
    "Accounting & Auditing": {
        "names": [
            "Deloitte",
            "EY (Ernst & Young)",
            "PwC (PricewaterhouseCoopers)",
            "KPMG",
            "QuickBooks",
            "Xero",
            "Sage",
            "Wave",
            "FreshBooks",
            "Acctivate"
        ],
        "urls": [
            "https://www2.deloitte.com",
            "https://www.ey.com",
            "https://www.pwc.com",
            "https://home.kpmg",
            "https://quickbooks.intuit.com",
            "https://www.xero.com",
            "https://www.sage.com",
            "https://www.waveapps.com",
            "https://www.freshbooks.com",
            "https://acctivate.com/"
        ],
        "descs": [
            "One of the \"Big Four\" accounting firms that provide audit, consulting, tax, and advisory services. ",
            "Another one of the \"Big Four\" accounting firms which provides assurance, tax, consulting, and advisory services.",
            "A multinational professional services network and one of the largest providers of audit and assurance, advisory, and tax services.",
            "One of the largest professional services companies in the world and a member of the \"Big Four\" accounting firms.",
            "A software company that provides accounting, bookkeeping, and tax preparation software for small and medium-sized businesses.",
            "A cloud-based accounting software company that provides accounting and bookkeeping services for small and medium-sized businesses.",
            "A software company that provides accounting, payroll, HR, and payment solutions to businesses of all sizes.",
            "A free accounting software company that offers accounting, invoicing, and receipt scanning for small businesses.",
            "A cloud-based accounting software company that provides invoicing and expense-tracking services for small businesses and self-employed professionals. ",
            "A powerful inventory management system with robust accounting modules designed for small to mid-sized businesses."
        ]
    },
    "Business Services": {
        "names": [
            "ADP",
            "Salesforce",
            "Deloitte",
            "Square",
            "Dropbox",
            "Slack",
            "HubSpot",
            "Glassdoor",
            "WeWork",
            "LegalZoom"
        ],
        "urls": [
            "https://www.adp.com/",
            "https://www.salesforce.com/",
            "https://www2.deloitte.com/",
            "https://squareup.com/",
            "https://www.dropbox.com/",
            "https://slack.com/",
            "https://www.hubspot.com/",
            "https://www.glassdoor.com/",
            "https://www.wework.com/",
            "https://www.legalzoom.com/"
        ],
        "descs": [
            "A provider of HR, payroll, and benefits administration services for businesses of all sizes.",
            "A cloud-based customer relationship management (CRM) platform for sales, marketing, and customer service operations.",
            "A global consulting firm offering services in audit, tax, consulting, and advisory areas.",
            "A payment processing company that enables businesses to accept credit and debit card payments through mobile devices.",
            "A cloud storage and file sharing platform that businesses can use for collaboration and data backup.",
            "A communication platform for businesses that improves collaboration and team productivity.",
            "A software platform for inbound marketing, sales, and customer service that helps businesses grow and connect with prospects and customers.",
            "An online platform that provides job seekers with company reviews, salary data, and interview insights, and employers with recruitment and employer branding tools.",
            "A provider of flexible co-working spaces, private office spaces, and meeting rooms for businesses of all sizes.",
            "A provider of online legal services and documents such as business formation, trademark registration, and legal advice."
        ]
    },
    "Consumer Electronics": {
        "names": [
            "Apple",
            "Samsung",
            "Sony",
            "Bose",
            "LG",
            "Amazon",
            "Microsoft",
            "HP",
            "Dell",
            "Nikon"
        ],
        "urls": [
            "https://www.apple.com/",
            "https://www.samsung.com/",
            "https://www.sony.com/",
            "https://www.bose.com/",
            "https://www.lg.com/",
            "https://www.amazon.com/",
            "https://www.microsoft.com/en-us/",
            "https://www.hp.com/",
            "https://www.dell.com/",
            "https://www.nikonusa.com/"
        ],
        "descs": [
            "A well-known tech company that produces iPhones, iPads, Macbooks, and other popular electronics.",
            "A Korean electronics company that produces a wide range of products, from smartphones to TVs to home appliances.",
            "A Japanese company that produces a variety of electronics, including TVs, headphones, and gaming systems.",
            "A company that specializes in high-quality audio equipment, offering headphones, speakers, and sound systems for home theaters.",
            "A company that produces TVs, home appliances, and mobile devices with advanced features, such as 4K Ultra HD and OLED displays.",
            "A company that produces its own line of electronics, such as the Echo smart speaker and Fire TV stick, in addition to offering a wide range of products from third-party sellers.",
            "A tech company that produces Windows operating systems, Surface tablets, and Xbox gaming systems.",
            "A company that produces a range of electronics, from laptops to printers to gaming accessories.",
            "A popular brand for laptops, desktop computers, and gaming PCs.",
            "A company that produces cameras and photography equipment, ranging from professional DSLRs to compact point-and-shoots."
        ]
    },
    "Individual Sports": {
        "names": [
            "Nike",
            "Under Armour",
            "Garmin",
            "Giro",
            "Callaway",
            "Yonex",
            "Wilson",
            "Oakley",
            "Salomon",
            "Mizuno"
        ],
        "urls": [
            "https://www.nike.com",
            "https://www.underarmour.com/",
            "https://www.garmin.com",
            "https://www.giro.com",
            "https://www.callawaygolf.com/",
            "https://www.yonex.com/sports/tennis/products/",
            "https://www.wilson.com/en-us",
            "https://www.oakley.com/en-us",
            "https://www.salomon.com",
            "https://www.mizuno.com/us/en-us/homepage/"
        ],
        "descs": [
            "A sportswear and equipment brand that offers a wide range of products for individual athletes, including running shoes, basketball shoes, and workout apparel.",
            "A popular sports apparel brand that produces high-quality gear for individual athletes, particularly for runners and fitness enthusiasts.",
            "A leading brand in GPS navigation technology that produces top-of-the-line sports watches for runners, hikers, and other individual athletes.",
            "A cycling equipment brand that offers a wide range of helmets, shoes, and other accessories for individual cyclists.",
            "A golf equipment brand that produces top-quality golf clubs, balls, and accessories for individual golfers.",
            "A sports equipment brand that offers high-quality tennis gear, including rackets, balls, and bags, for individual tennis players.",
            "A well-known sports equipment brand that produces top-quality gear for individual athletes in sports such as tennis, baseball, and golf.",
            "A popular eyewear brand that offers a wide range of sunglasses and goggles for individual athletes, particularly those involved in outdoor sports and activities.",
            "A leading brand in outdoor sports equipment that produces trail running shoes, hiking boots, and other gear for individual adventurers.",
            "A sports equipment brand that offers high-quality gear for individual athletes in sports such as baseball, volleyball, and running."
        ]
    },
    "Water Sports": {
        "names": [
            "Speedo",
            "Body Glove",
            "Aqua Lung",
            "O'Neill",
            "Hyperlite",
            "Oru Kayak",
            "Wahoo",
            "Yakima",
            "Costa",
            "Aqua Sphere"
        ],
        "urls": [
            "https://www.speedousa.com/",
            "https://www.bodyglove.com/",
            "https://www.aqualung.com/",
            "https://www.oneill.com/",
            "https://www.hyperlite.com/",
            "https://www.orukayak.com/",
            "https://www.wahoofitness.com/",
            "https://www.yakima.com/",
            "https://www.costadelmar.com/home",
            "https://www.aquasphereswim.com/us/"
        ],
        "descs": [
            "A well-known brand specializing in swimwear, clothing, and accessories for various water sports such as swimming and diving.",
            "A popular brand offering wetsuits, swimsuits, rashguards, and other water sports gear for surfing, wakeboarding, and stand-up paddleboarding.",
            "A leading brand providing high-quality scuba diving gear, snorkeling gear, and swim gear for water sports enthusiasts.",
            "A popular brand offering a wide range of wetsuits, board shorts, swimsuits, and other water sports accessories.",
            "A well-known brand specializing in wakeboards, wakesurfers, and other wakeboard gear for water sports enthusiasts.",
            "A unique brand offering foldable kayaks that are easy to store, transport, and use for various water sports activities.",
            "A leading brand offering a variety of water sports gear such as waterproof heart rate monitors, GPS watches, and cycling sensors.",
            "A brand specializing in water sports racks and carriers for kayaks, canoes, and other watercraft. ",
            "A well-known brand of polarized sunglasses preferred by water sports enthusiasts for their excellent visual clarity and UV protection.",
            "A popular brand offering swimwear, goggles, and other gear for various water sports activities, including swimming and triathlons."
        ]
    },
    "Grants, Scholarships & Financial Aid": {
        "names": [
            "Fastweb",
            "FAFSA",
            "The Gates Scholarship",
            "Pell Grant",
            "Jack Kent Cooke Foundation",
            "Scholly",
            "UNCF",
            "TFS Scholarships",
            "Coca-Cola Scholars Foundation",
            "The Ron Brown Scholar Program"
        ],
        "urls": [
            "https://www.fastweb.com/",
            "https://studentaid.gov/h/apply-for-aid/fafsa",
            "https://www.thegatesscholarship.org/",
            "https://studentaid.gov/understand-aid/types/grants/pell",
            "https://www.jkcf.org/",
            "https://myscholly.com/",
            "https://uncf.org/",
            "https://www.tfs scholarships.com/",
            "https://www.coca-colascholarsfoundation.org/",
            "https://www.ronbrown.org/"
        ],
        "descs": [
            "A scholarship search engine that matches students with relevant scholarships and grants.",
            "Free Application for Federal Student Aid that helps students receive financial aid from the government.",
            "A highly selective scholarship program for minority students with significant financial need.",
            "A grant from the federal government that provides financial assistance to undergraduate students.",
            "A scholarship program that provides financial aid to high-achieving students with financial need.",
            "A scholarship search and application platform that helps students find and apply to scholarships easily.",
            "A scholarship program for minority students that provides financial assistance and support through their educational journey.",
            "A database of over 7 million scholarships worth over $41 billion in available funds.",
            "A scholarship program that recognizes high school seniors who demonstrate leadership and academic excellence.",
            "A scholarship program that provides financial assistance to African-American students who demonstrate academic achievement and leadership potential."
        ]
    },
    "Computer Hardware": {
        "names": [
            "Dell",
            "Intel",
            "Nvidia",
            "AMD",
            "Corsair",
            "Western Digital",
            "Logitech",
            "Microsoft",
            "Asus",
            "HP"
        ],
        "urls": [
            "https://www.dell.com",
            "https://www.intel.com",
            "https://www.nvidia.com",
            "https://www.amd.com",
            "https://www.corsair.com",
            "https://www.westerndigital.com",
            "https://www.logitech.com",
            "https://www.microsoft.com",
            "https://www.asus.com",
            "https://www.hp.com"
        ],
        "descs": [
            "A leading computer hardware manufacturer that produces laptops, desktops, monitors, and accessories.",
            "A multinational technology company that designs and manufactures computer processors, motherboards, and other hardware components.",
            "A leading manufacturer of graphics processing units (GPUs) that are used for high-performance gaming and professional applications.",
            "Another major computer hardware manufacturer that produces processors, graphics cards, and other components.",
            "A company that produces high-quality computer hardware components and accessories, including memory modules, power supplies, and gaming peripherals.",
            "A storage solutions provider that produces hard drives, solid-state drives (SSDs), and other tech products.",
            "A leading manufacturer of computer peripherals, such as mice, keyboards, webcams, and headsets.",
            "A tech giant that produces the Windows operating system and a range of hardware products, including the Surface series of laptops and tablets.",
            "A hardware manufacturer that produces laptops, desktops, gaming peripherals, and other computer components.",
            "A company that produces a range of hardware products, including laptops, desktops, monitors, printers, and other peripherals."
        ]
    },
    "Libraries & Museums": {
        "names": [
            "Library of Congress",
            "Smithsonian Institution",
            "Metropolitan Museum of Art",
            "British Museum",
            "Louvre Museum",
            "National Gallery of Art",
            "Getty Museum",
            "Library and Archives Canada",
            "National Museum of Natural History",
            "American Museum of Natural History"
        ],
        "urls": [
            "https://www.loc.gov/",
            "https://www.si.edu/",
            "https://www.metmuseum.org/",
            "https://www.britishmuseum.org/",
            "https://www.louvre.fr/",
            "https://www.nga.gov/",
            "http://www.getty.edu/museum/",
            "https://www.bac-lac.gc.ca/eng/Pages/home.aspx",
            "https://naturalhistory.si.edu/",
            "https://www.amnh.org/"
        ],
        "descs": [
            "The largest library in the world, containing more than 170 million items including books, maps, manuscripts, recordings, and photographs.",
            "A group of 19 museums and galleries, as well as research centers and zoos, that hold over 150 million objects, artworks, and specimens.",
            "One of the largest and most comprehensive art museums in the world, located in New York City.",
            "A museum in London that contains over 8 million objects from various cultures and civilizations throughout history.",
            "A historic museum located in Paris, France, showcasing thousands of years of art and history.",
            "A United States government-funded art museum in Washington, D.C. that contains over 150,000 pieces of art.",
            "A museum in Los Angeles that showcases pre-20th-century European paintings, drawings, sculptures, illuminated manuscripts, decorative arts, and photographs.",
            "A federal institution that preserves and provides access to Canada's documentary heritage including books, newspapers, maps, photographs, and government records.",
            "A museum in Washington, D.C. that houses over 145 million natural science specimens and cultural artifacts.",
            "A museum in New York City that contains over 33 million specimens, artifacts, and scientific specimens."
        ]
    },
    "Financial Planning & Management": {
        "names": [
            "Mint",
            "Personal Capital",
            "Betterment",
            "Wealthfront",
            "Quicken",
            "YNAB (You Need A Budget)",
            "Ramsey Solutions",
            "Charles Schwab",
            "Vanguard",
            "Fidelity"
        ],
        "urls": [
            "https://www.mint.com/",
            "https://www.personalcapital.com/",
            "https://www.betterment.com/",
            "https://www.wealthfront.com/",
            "https://www.quicken.com/",
            "https://www.youneedabudget.com/",
            "https://www.daveramsey.com/",
            "https://www.schwab.com/",
            "https://www.vanguard.com/",
            "https://www.fidelity.com/"
        ],
        "descs": [
            "A financial tracking app that helps users budget and manage their expenses.",
            "A digital wealth management platform that offers financial planning and investment management services.",
            "An online investment platform that uses robo-advisors to help users invest in a diversified portfolio based on their financial goals.",
            "Another robo-advisor platform that provides automated investment management services.",
            "A personal finance management tool that has been around for over 3 decades, helping users manage their finances and plan for retirement.",
            "A budgeting software that encourages users to prioritize their spending and save more money.",
            "A financial planning company that teaches individuals how to take control of their money and plan for their financial future.",
            "A financial services company that offers investment, banking, and brokerage services to help users manage their wealth.",
            "A reputable investment company that specializes in low-cost index funds and ETFs for individual investors.",
            "Another investment company that provides financial planning services, including retirement planning and wealth management."
        ]
    },
    "Ecology & Environment": {
        "names": [
            "Patagonia",
            "Method",
            "Seventh Generation",
            "Ecover",
            "Toms",
            "The Honest Company",
            "Bambu Home",
            "Yumbutter",
            "Klean Kanteen",
            "EarthHero"
        ],
        "urls": [
            "https://www.patagonia.com/",
            "https://methodhome.com/",
            "https://www.seventhgeneration.com/",
            "https://www.ecover.com/",
            "https://www.toms.com/",
            "https://www.honest.com/",
            "https://www.bambuhome.com/",
            "https://yumbutter.com/",
            "https://www.kleankanteen.com/",
            "https://earthhero.com/"
        ],
        "descs": [
            "A sustainable outdoor clothing brand that supports environmental activism.",
            "A cleaning products brand committed to using plant-based and biodegradable ingredients in their formulas.",
            "A brand that creates household and personal care products that are environmentally responsible and socially just.",
            "A brand that produces sustainable and biodegradable cleaning products for the household and laundry.",
            "A shoe company that supports ethical manufacturing and environmentally responsible business practices.",
            "A company that creates baby and personal care products that are safe, sustainable and eco-friendly.",
            "A brand that creates eco-friendly kitchen and dining wares made from renewable materials.",
            "A nut butter brand that uses sustainably sourced ingredients and supports reforestation projects.",
            "A brand that produces reusable water bottles and containers made from stainless steel and other sustainable materials.",
            "An eco-friendly marketplace that curates and sells a wide variety of sustainable products from different brands."
        ]
    },
    "Online Media": {
        "names": [
            "BuzzFeed",
            "Mashable",
            "Refinery29",
            "Vox Media",
            "The Skimm",
            "Vice",
            "The Verge",
            "Wired",
            "Polygon",
            "Kotaku"
        ],
        "urls": [
            "https://www.buzzfeed.com/",
            "https://mashable.com/",
            "https://www.refinery29.com/",
            "https://www.voxmedia.com/",
            "https://www.theskimm.com/",
            "https://www.vice.com/",
            "https://www.theverge.com/",
            "https://www.wired.com/",
            "https://www.polygon.com/",
            "https://kotaku.com/"
        ],
        "descs": [
            "A popular digital media site that covers a range of topics, from news and politics to entertainment and pop culture.",
            "A digital media site that covers technology, culture, science, social good, and entertainment.",
            "An online media and entertainment company that focuses on women's lifestyle and fashion.",
            "An independent media company that produces high-quality journalism across various platforms, including podcasts and video.",
            "A subscription-based media company that provides a daily email newsletter with a brief overview of the news and current events.",
            "An international media company that covers current affairs, entertainment, culture, and fashion with a unique perspective.",
            "A media outlet that covers the latest technology news, reviews, and analysis.",
            "A media outlet that reports on the latest developments in science, technology, and culture.",
            "A digital media site that focuses on video games, including reviews, news, and features.",
            "A popular video game website that covers news, reviews, and features from the world of gaming."
        ]
    },
    "HVAC & Climate Control": {
        "names": [
            "Carrier",
            "Honeywell",
            "Nest",
            "Trane",
            "Mitsubishi Electric",
            "LG",
            "Rheem",
            "Emerson",
            "Lennox",
            "Goodman"
        ],
        "urls": [
            "https://www.carrier.com/",
            "https://www.honeywellhome.com/",
            "https://store.google.com/us/magazine/nest",
            "https://www.trane.com/",
            "https://www.mitsubishielectric.com/",
            "https://www.lghvac.com/",
            "https://www.rheem.com/",
            "https://climate.emerson.com/en-us",
            "https://www.lennox.com/",
            "https://www.goodmanmfg.com/"
        ],
        "descs": [
            "A leading HVAC brand that offers a range of heating, cooling, and air quality solutions for commercial and residential spaces. ",
            "A brand that offers a wide range of smart thermostats, humidifiers, air purifiers, and other climate control devices. ",
            "A popular smart home brand that offers thermostats, cameras, and other home automation devices. ",
            "A brand known for its energy-efficient heating, cooling, and air filtration systems for both residential and commercial spaces. ",
            "A brand that offers ductless HVAC and air conditioning systems for homes and businesses. ",
            "A brand that offers commercial and residential air conditioning and heating solutions, including ducted and ductless systems. ",
            "A brand that offers heating, cooling, and water heating solutions, including air conditioners, heat pumps, and gas furnaces. ",
            "A brand that provides commercial and residential heating and air conditioning solutions, including smart thermostats, as well as commercial refrigeration and food service equipment. ",
            "A brand that offers heating, cooling, and indoor air quality solutions for residential and commercial spaces. ",
            "A brand that offers HVAC solutions, including air conditioners, heat pumps, and gas furnaces, that are affordable and energy-efficient."
        ]
    },
    "Kitchen & Dining": {
        "names": [
            "Le Creuset",
            "KitchenAid",
            "Instant Pot",
            "Pyrex",
            "OXO",
            "Williams Sonoma",
            "Vitamix",
            "Sur La Table",
            "All-Clad",
            "Cuisinart"
        ],
        "urls": [
            "https://www.lecreuset.com/",
            "https://www.kitchenaid.com/",
            "https://instantpot.com/",
            "https://www.pyrexhome.com/",
            "https://www.oxo.com/",
            "https://www.williams-sonoma.com/",
            "https://www.vitamix.com/",
            "https://www.surlatable.com/",
            "https://www.all-clad.com/",
            "https://www.cuisinart.com/"
        ],
        "descs": [
            "A high-end French cookware brand known for their colorful and durable cast iron pans.",
            "A popular kitchen appliance brand known for their stand mixers, blenders, and other countertop gadgets.",
            "A multi-functional electric pressure cooker that has taken the home-cooking world by storm.",
            "A classic glassware brand beloved for their durable and oven-safe baking dishes and storage containers.",
            "A brand that creates ergonomic and functional kitchen tools like vegetable peelers, can openers, and measuring cups.",
            "A high-end kitchen and home goods brand that sells everything from cookware to linens to dining sets.",
            "A powerful and versatile high-speed blender brand used by home cooks and chefs alike.",
            "A specialty kitchen store selling high-quality cookware, bakeware, and kitchen gadgets.",
            "A premium cookware brand known for their high-performance stainless steel and nonstick pans.",
            "A widely recognized kitchen appliance brand that offers everything from coffee makers to food processors to toaster ovens."
        ]
    },
    "Real Estate Listings": {
        "names": [
            "Zillow",
            "Realtor.com",
            "Redfin",
            "Trulia",
            "Apartments.com",
            "Zumper",
            "LoopNet",
            "Homes.com",
            "Movoto",
            "Coldwell Banker"
        ],
        "urls": [
            "https://www.zillow.com/",
            "https://www.realtor.com/",
            "https://www.redfin.com/",
            "https://www.trulia.com/",
            "https://www.apartments.com/",
            "https://www.zumper.com/",
            "https://www.loopnet.com/",
            "https://www.homes.com/",
            "https://www.movoto.com/",
            "https://www.coldwellbanker.com/"
        ],
        "descs": [
            "One of the most popular and widely used online real estate databases that lists homes for sale, apartments for rent, and related services. ",
            "Another popular online database that provides listings for homes for sale, apartments for rent, and other real estate services. ",
            "A technology-based real estate brokerage that also provides online listings and other services. ",
            "A subsidiary of Zillow that also provides online listings for homes and apartments for sale or rent. ",
            "A website that lists rental properties such as apartments, condos, and townhouses across the United States. ",
            "A rental listing website that provides a convenient platform for tenants to search for and apply to rental properties. ",
            "A commercial real estate database that lists properties for sale or lease, including office buildings, industrial spaces, and retail locations. ",
            "A real estate search engine that provides listings for homes for sale or rent, apartments, and foreclosures. ",
            "An online real estate brokerage that offers listings of homes for sale and rent, as well as other resources to assist buyers and sellers. ",
            "One of the oldest and largest real estate brokerages in the United States, with listings for properties in many states and international locations."
        ]
    },
    "Hair Care": {
        "names": [
            "Pantene",
            "Olaplex",
            "L'Oreal Paris",
            "Moroccanoil",
            "Shea Moisture",
            "TRESemmé",
            "Aveda",
            "Redken",
            "Bumble and Bumble",
            "Oribe"
        ],
        "urls": [
            "https://pantene.com/en-us",
            "https://olaplex.com/",
            "https://www.lorealparisusa.com/products/hair-care.aspx",
            "https://www.moroccanoil.com/",
            "https://www.sheamoisture.com/hair.html",
            "https://www.tresemme.com/us/en/home.html",
            "https://www.aveda.com/hair-care",
            "https://www.redken.com/haircare",
            "https://www.bumbleandbumble.com/products/hair-care",
            "https://www.oribe.com/shop/hair-care.html"
        ],
        "descs": [
            "A popular hair care brand that offers a wide range of products for different hair types and concerns.",
            "A brand known for its hair bond strengthening treatments and products that help repair damaged hair.",
            "A well-known brand that offers a broad range of hair care products, including shampoos, conditioners, and hair treatments.",
            "A brand that specializes in argan oil-infused hair products that improve hair texture, shine, and manageability.",
            "A brand that offers natural and organic hair products for different hair types, textures, and concerns.",
            "A well-known brand that provides salon-quality hair products at affordable prices.",
            "A brand that offers eco-friendly, cruelty-free hair care products for different hair types and needs.",
            "A brand that offers professional-grade hair care products for different hair types, including color-treated and thinning hair.",
            "A brand that offers cutting-edge hair care products that can give you salon-worthy hair at home.",
            "A luxury hair care brand that offers high-end hair products that not only make your hair look good but also smell incredible."
        ]
    },
    "Aerospace & Defense": {
        "names": [
            "Boeing",
            "Lockheed Martin",
            "Raytheon Technologies",
            "Northrop Grumman",
            "General Dynamics",
            "L-3 Technologies",
            "BAE Systems",
            "Aerospace Corporation",
            "Thales Group",
            "United Technologies Corporation"
        ],
        "urls": [
            "https://www.boeing.com/",
            "https://www.lockheedmartin.com/",
            "https://www.rtx.com/",
            "https://www.northropgrumman.com/",
            "https://www.gd.com/",
            "https://www.l3harris.com/",
            "https://www.baesystems.com/",
            "https://aerospace.org/",
            "https://www.thalesgroup.com/",
            "https://www.utc.com/"
        ],
        "descs": [
            "One of the world's largest aerospace companies that designs and manufactures commercial airliners, military aircraft, satellites, and missiles.",
            "A global aerospace and defense company that specializes in the development and production of advanced technology systems, products, and services.",
            "A multinational conglomerate that supplies advanced technologies, including aerospace and defense products, to commercial and government customers worldwide.",
            "A defense contractor that designs, develops, and produces military aircraft, missile systems, and other advanced technologies for the U.S. government and international customers.",
            "A global aerospace and defense company that provides a broad range of products and services, including information technology systems, marine systems, and combat vehicles.",
            "A defense contractor that supplies secure communications, intelligence, and other advanced technology solutions to government and commercial customers worldwide.",
            "A British multinational company that designs and manufactures aerospace and defense products, including combat vehicles, military aircraft, and naval ships.",
            "A non-profit corporation that provides technical support to the U.S. government, including the Department of Defense and the National Aeronautics and Space Administration (NASA).",
            "A French multinational that specializes in aerospace, defense, and security technology, including missile systems, radar equipment, and avionics.",
            "A multinational conglomerate that provides technology products and services, including aerospace and defense systems, to commercial and government customers worldwide."
        ]
    },
    "Fun & Trivia": {
        "names": [
            "Trivial Pursuit",
            "Cards Against Humanity",
            "Jeopardy!",
            "Bananagrams",
            "Exploding Kittens",
            "Trivia Crack",
            "Wits & Wagers",
            "Family Feud",
            "The Game of Life: Quarter Life Crisis",
            "MindTrap"
        ],
        "urls": [
            "https://www.trivialpursuit.com/",
            "https://cardsagainsthumanity.com/",
            "https://www.jeopardy.com/",
            "https://bananagrams.com/",
            "https://explodingkittens.com/",
            "https://www.triviacrack.com/",
            "https://www.boardgamegeek.com/boardgame/20100/wits-wagers",
            "https://www.familyfeud.com/",
            "https://www.amazon.com/Game-Life-Quarter-Crisis-Adult/dp/B07Y3YB3YP",
            "https://www.amazon.com/Mind-Trap-PUZZLES-BRAINTEASERS-CARD/dp/B000051TJG"
        ],
        "descs": [
            "A classic board game that tests players' knowledge on a variety of topics.",
            "A popular party game where players fill in the blanks in offensive statements to create hilarious combinations.",
            "A long-running game show that challenges contestants to answer questions in a variety of categories.",
            "A fast-paced word-building game that's perfect for players of all ages.",
            "A strategic card game that involves avoiding drawing \"exploding kitten\" cards while tricking your opponents.",
            "A mobile game app that quizzes players on a variety of topics in a friendly competition against friends or strangers.",
            "A trivia board game that combines general knowledge questions with betting on the likelihood of answers.",
            "A game show that has families compete by guessing popular survey responses to various questions.",
            "A spinoff of the classic board game that puts a hilarious and relatable twist on the struggles of early adulthood.",
            "A card game that challenges players to solve riddles, puzzles, and problems to win."
        ]
    },
    "Card Games": {
        "names": [
            "Cards Against Humanity",
            "Uno",
            "Exploding Kittens",
            "Set",
            "Dominion",
            "Love Letter",
            "Codenames",
            "Munchkin",
            "Fluxx",
            "Skip-Bo"
        ],
        "urls": [
            "https://cardsagainsthumanity.com/",
            "https://www.mattelgames.com/en-us/cards/uno",
            "https://explodingkittens.com/",
            "https://www.setgame.com/set",
            "https://riograndegames.com/games/dominion",
            "https://www.zmangames.com/en/products/love-letter/",
            "https://czechgames.com/en/codenames/",
            "https://munchkin.game/",
            "https://www.looneylabs.com/games/fluxx",
            "https://www.mattelgames.com/en-us/cards/skip-bo"
        ],
        "descs": [
            "A popular party game that involves filling in the blanks with the funniest, most inappropriate answers possible.",
            "A classic card game that involves matching colors and numbers to be the first to get rid of all your cards.",
            "A hilarious and addictive game involving kittens, explosions, and strategic card play.",
            "A fast-paced game that involves identifying patterns and sets of cards.",
            "A popular deck-building game in which players use cards to build the best possible kingdom.",
            "A quick and easy-to-learn game in which players aim to deliver a love letter to the princess while avoiding the other players' attempts to stop them.",
            "A word-based party game in which teams compete to guess the correct words based on clues given by their teammates.",
            "A wacky and humorous game that pits players against each other in a dungeon-crawling adventure.",
            "A card game with constantly changing rules and goals, making each round a unique and exciting experience.",
            "A classic card game in which players aim to be the first to get rid of all their cards by building sequential stacks."
        ]
    },
    "Directories & Listings": {
        "names": [
            "Yellow Pages",
            "Yelp",
            "Google My Business",
            "Angie's List",
            "Foursquare",
            "Zomato",
            "Manta",
            "TripAdvisor",
            "Houzz",
            "Yellowbook"
        ],
        "urls": [
            "https://www.yellowpages.com/",
            "https://www.yelp.com/",
            "https://www.google.com/business/",
            "https://www.angieslist.com/",
            "https://foursquare.com/",
            "https://www.zomato.com/",
            "https://www.manta.com/",
            "https://www.tripadvisor.com/",
            "https://www.houzz.com/",
            "https://www.yellowbook.com/"
        ],
        "descs": [
            "A well-known directory that helps users find various types of local businesses and services.",
            "A popular platform where users can read and post reviews about businesses in various categories.",
            "A free tool that allows business owners to manage their online presence across Google, including in search results and maps.",
            "A website where users can find and review local service providers such as contractors, healthcare professionals, and more.",
            "A location data platform that provides personalized recommendations for places to eat, drink, and visit based on users' tastes and check-ins.",
            "A platform that provides information about restaurants and other food-related businesses like cafes and bars.",
            "A directory that helps small businesses connect with more customers by displaying their contact information, reviews, and more.",
            "A popular platform that provides reviews and information about hotels, restaurants, and tourist attractions.",
            "A directory where users can find and review home design and remodeling professionals.",
            "A directory that provides information about local businesses and services across various categories."
        ]
    },
    "Motor Vehicles (By Type)": {
        "names": [
            "Toyota",
            "Ford",
            "Tesla",
            "Harley Davidson",
            "Yamaha",
            "Honda",
            "Chevrolet",
            "Porsche",
            "BMW",
            "Ducati"
        ],
        "urls": [
            "https://www.toyota.com/",
            "https://www.ford.com/",
            "https://www.tesla.com/",
            "https://www.harley-davidson.com/",
            "https://www.yamahamotorsports.com/",
            "https://www.honda.com/",
            "https://www.chevrolet.com/",
            "https://www.porsche.com/",
            "https://www.bmw.com/",
            "https://www.ducati.com/"
        ],
        "descs": [
            "A Japanese car manufacturer specializing in affordable and reliable sedans, SUVs, trucks, and hybrids.",
            "An American multinational automaker producing a wide range of vehicles including sedans, trucks, and SUVs.",
            "An electric car manufacturer that produces luxury sedans, SUVs, and sports cars.",
            "An American motorcycle manufacturer that produces cruisers, touring, and sport motorcycles.",
            "A Japanese manufacturer that produces motorsports vehicles including motorcycles, ATVs, and Side-by-Side vehicles.",
            "A Japanese automobile manufacturer producing sedans, trucks, and SUVs, as well as motorcycles, ATVs, and power equipment.",
            "An American manufacturer of cars, trucks, and SUVs, with a focus on performance and innovation.",
            "A luxury German sports car manufacturer known for producing high-performance vehicles such as the iconic 911.",
            "A German luxury automaker producing sedans, SUVs, and sports cars, with a focus on performance and innovative technology.",
            "An Italian motorcycle manufacturer specializing in high-performance sport and racing motorcycles."
        ]
    },
    "Tourist Destinations": {
        "names": [
            "Paris Tourism",
            "New York City Tourism",
            "Tokyo Tourism",
            "London Tourism",
            "Bali Tourism",
            "Dubai Tourism",
            "Rome Tourism",
            "Sydney Tourism",
            "Hawaii Tourism",
            "Barcelona Tourism"
        ],
        "urls": [
            "https://en.parisinfo.com/",
            "https://www.nycgo.com/",
            "https://www.gotokyo.org/en/index.html",
            "https://www.visitlondon.com/",
            "https://www.balitourismboard.org/",
            "https://www.visitdubai.com/",
            "https://www.turismoroma.it/en",
            "https://www.sydney.com/",
            "https://www.gohawaii.com/",
            "https://www.barcelonaturisme.com/wv3/en/"
        ],
        "descs": [
            "Paris is often called the \"City of Light\" and offers numerous tourist attractions including the Eiffel Tower, Notre Dame, and the Louvre Museum.",
            "New York City is a bustling metropolis which has something to offer everyone. Some popular attractions include the Statue of Liberty, Central Park, and Times Square.",
            "Tokyo is the capital of Japan and is renowned for its cherry blossoms, fashion, and cutting-edge technology. Must-visit attractions include the Tokyo Skytree, Tokyo Tower, and Ginza.",
            "London is a city rich in history and culture. Popular tourist attractions include the Buckingham Palace, British Museum, and the Tower of London.",
            "Bali is known for its natural beauty, beaches, and ancient temples. Top attractions include Kuta Beach, Tanah Lot Temple, and the Ubud Monkey Forest.",
            "Dubai is a modern and cosmopolitan city that epitomizes luxury and extravagance. From the iconic Burj Khalifa to the Palm Jumeirah Island, there are plenty of things to experience and see here.",
            "Rome is renowned for its historical significance, art, and cuisine. Each year, millions of people flock to Rome to soak up the culture and take in attractions such as the Colosseum, the Vatican, and the Trevi Fountain.",
            "Sydney, Australia is a popular travel destination and is known for its beaches, opera house, and iconic harbor. Other attractions include the Royal Botanical Gardens, Bondi Beach, and the Sydney Tower Eye.",
            "Hawaii is a tropical paradise and consists of several islands each with their own distinct character. Among the main attractions are the volcanoes, marine life, and stunning beaches.",
            "Barcelona is a vibrant, modern city known for its architecture, art, and culture. Popular tourist attractions include Gaudi's Park Guell, the Picasso Museum, and the Barri Gotic."
        ]
    },
    "Outdoors": {
        "names": [
            "The North Face",
            "Columbia",
            "Patagonia",
            "REI",
            "Merrell",
            "Coleman",
            "CamelBak",
            "Black Diamond",
            "Marmot",
            "Yeti"
        ],
        "urls": [
            "https://www.thenorthface.com/",
            "https://www.columbia.com/",
            "https://www.patagonia.com/home/",
            "https://www.rei.com/",
            "https://www.merrell.com/",
            "https://www.coleman.com/",
            "https://www.camelbak.com/",
            "https://www.blackdiamondequipment.com/",
            "https://www.marmot.com/",
            "https://www.yeti.com/"
        ],
        "descs": [
            "A well-known brand that offers a wide range of outdoor gear and apparel for various sports and activities.",
            "A brand offering high-quality outdoor gear and apparel for hiking, skiing, and other outdoor activities.",
            "A brand that produces high-quality outdoor clothing, particularly for winter sports and extreme outdoor activities.",
            "A well-known outdoor retail store that offers equipment and clothing for all types of outdoor activities.",
            "A brand that specializes in outdoor footwear, particularly for hiking and outdoor recreation.",
            "A brand that produces outdoor gear and equipment, particularly for camping and outdoor cooking.",
            "A brand that produces water bottles, hydration packs, and other products that are essential for outdoor activities.",
            "A brand that specializes in climbing gear and other outdoor gear and apparel.",
            "A brand that produces high-quality outdoor apparel and gear for various activities such as skiing, climbing, and camping.",
            "A brand known for its high-quality coolers, cups, and other outdoor equipment that keep your food and drinks cold during extended outdoor activities."
        ]
    },
    "Gifts & Special Event Items": {
        "names": [
            "1800Flowers",
            "Harry & David",
            "Shari's Berries",
            "Tiffany & Co.",
            "Yankee Candle",
            "Paper Source",
            "Edible Arrangements",
            "Personalization Mall",
            "Godiva Chocolatier",
            "Sephora"
        ],
        "urls": [
            "https://www.1800flowers.com/",
            "https://www.harryanddavid.com/",
            "https://www.berries.com/",
            "https://www.tiffany.com/",
            "https://www.yankeecandle.com/",
            "https://www.papersource.com/",
            "https://www.ediblearrangements.com/",
            "https://www.personalizationmall.com/",
            "https://www.godiva.com/",
            "https://www.sephora.com/"
        ],
        "descs": [
            "A website offering flower arrangements and gifts for any special occasion.",
            "A company that sells gourmet food and gift baskets.",
            "A website that offers chocolate-dipped berries as well as other sweet treats.",
            "A well-known jewelry brand that offers a wide variety of timeless pieces.",
            "A candle company that sells candles and other aromatherapy items.",
            "A store that offers unique paper products such as invitations, cards, and custom printing services.",
            "A company that specializes in delivering fruit arrangements as gifts for special occasions.",
            "A website that offers custom-made gifts such as personalized blankets, mugs, and other items.",
            "A chocolate company that offers a wide selection of luxurious chocolates and special gift sets.",
            "A makeup and beauty store that offers a wide range of products, including fragrance sets and makeup gift sets."
        ]
    },
    "Biological Sciences": {
        "names": [
            "Nature",
            "23andMe",
            "Genentech",
            "National Institutes of Health",
            "Human Genome Project",
            "CRISPR Therapeutics",
            "American Society for Biochemistry and Molecular Biology",
            "Illumina",
            "Max Planck Institute for Developmental Biology",
            "Howard Hughes Medical Institute"
        ],
        "urls": [
            "https://www.nature.com/",
            "https://www.23andme.com/",
            "https://www.gene.com/",
            "https://www.nih.gov/",
            "https://www.genome.gov/human-genome-project",
            "https://crisprtx.com/",
            "https://www.asbmb.org/",
            "https://www.illumina.com/",
            "https://www.biology.mpg.de/140976/developing_bio",
            "https://www.hhmi.org/"
        ],
        "descs": [
            "One of the most well-known publishers of scientific research in the world.",
            "A company that provides genetic testing and analysis for health and ancestry purposes.",
            "A biotechnology company that focuses on the development of medicines for serious illnesses such as cancer.",
            "A federal agency that conducts and funds medical research studies.",
            "A scientific research project that mapped the human genome.",
            "A biotechnology company that is developing gene-editing therapies to treat genetic disorders.",
            "A scientific society dedicated to advancing the understanding of the molecular basis of life.",
            "A biotechnology company that specializes in DNA sequencing and related technologies.",
            "A research institute focused on the study of developmental biology.",
            "A non-profit medical research organization that conducts research in various areas of biology and medicine."
        ]
    },
    "Vehicle Parts & Services": {
        "names": [
            "AutoZone",
            "O'Reilly Auto Parts",
            "Pep Boys",
            "Advance Auto Parts",
            "Firestone Complete Auto Care",
            "Jiffy Lube",
            "Discount Tire",
            "Napa Auto Parts",
            "Royal Purple",
            "Mobil 1"
        ],
        "urls": [
            "https://www.autozone.com/",
            "https://www.oreillyauto.com/",
            "https://www.pepboys.com/",
            "https://shop.advanceautoparts.com/",
            "https://www.firestonecompleteautocare.com/",
            "https://www.jiffylube.com/",
            "https://www.discounttire.com/",
            "https://www.napaonline.com/",
            "https://www.royalpurple.com/",
            "https://mobiloil.com/"
        ],
        "descs": [
            "A popular retailer of aftermarket auto parts and accessories.",
            "Another well-known supplier of automotive replacement parts, tools, and equipment.",
            "A one-stop shop for car maintenance and repair services, as well as parts and accessories.",
            "Offers a wide range of automotive products, including brakes, batteries, oil, and filters.",
            "Provides comprehensive auto services, including oil changes, alignment, and engine repair.",
            "Specializes in quick and convenient oil changes and other preventative maintenance services.",
            "Offers a wide selection of tires and wheels, as well as free tire checks and flat repairs.",
            "Has an extensive inventory of automotive parts, tools, and supplies for all makes and models.",
            "Produces high-performance synthetic motor oils and lubricants for a variety of vehicle applications.",
            "Offers a range of synthetic motor oils, as well as other automotive fluids and services."
        ]
    },
    "Gossip & Tabloid News": {
        "names": [
            "TMZ",
            "People",
            "Us Weekly",
            "National Enquirer",
            "OK!",
            "Radar Online",
            "Star",
            "InTouch",
            "Extra",
            "Entertainment Tonight"
        ],
        "urls": [
            "https://www.tmz.com/",
            "https://people.com/",
            "https://www.usmagazine.com/",
            "https://www.nationalenquirer.com/",
            "https://okmagazine.com/",
            "https://radaronline.com/",
            "https://www.star-magazine.co.uk/",
            "https://intouchweekly.com/",
            "https://extratv.com/",
            "https://www.etonline.com/"
        ],
        "descs": [
            "A celebrity news outlet that covers the latest breaking stories and scandals.",
            "A popular magazine that covers celebrity news, human-interest stories, and pop culture.",
            "A celebrity news outlet that covers the latest news, gossip, and photos of Hollywood stars.",
            "A tabloid newspaper that reports on celebrity scandals, UFO sightings, and conspiracy theories.",
            "A celebrity news outlet that covers the latest news, gossip, and photos of Hollywood stars.",
            "A celebrity news website that covers the latest gossip, rumors, and scandals in Hollywood.",
            "A celebrity news outlet that covers the latest news, gossip, and photos of Hollywood stars.",
            "A weekly magazine that covers celebrity news, fashion, and beauty.",
            "A media outlet that reports on the latest celebrity news, entertainment, and lifestyle.",
            "A media outlet that covers the latest celebrity news, TV shows, movies, and music."
        ]
    },
    "Business Operations": {
        "names": [
            "SAP",
            "Salesforce",
            "QuickBooks",
            "Slack",
            "Trello",
            "Asana",
            "Zendesk",
            "Microsoft Office 365",
            "AWS",
            "Workday"
        ],
        "urls": [
            "https://www.sap.com/",
            "https://www.salesforce.com/",
            "https://quickbooks.intuit.com/",
            "https://slack.com/",
            "https://trello.com/",
            "https://asana.com/",
            "https://www.zendesk.com/",
            "https://www.microsoft.com/en-us/microsoft-365",
            "https://aws.amazon.com/",
            "https://www.workday.com/"
        ],
        "descs": [
            "Enterprise Resource Planning (ERP) software that provides businesses with integrated management of financial, accounting, and other operations.",
            "Customer Relationship Management (CRM) software that helps businesses automate sales, marketing, and other customer-facing operations.",
            "Accounting software that provides small businesses with tools for managing cash flow, invoicing, and expenses.",
            "A team collaboration tool that streamlines communication and sharing of files between employees, improving business operations.",
            "Project management software that allows businesses to plan, track, and manage projects across teams and departments.",
            "A project management software that enables teams to track projects, set goals and deadlines, and collaborate effectively.",
            "A customer service software that helps businesses interact with customers through multiple channels, and provide personalized support.",
            "A cloud-based suite of productivity tools, including Word, Excel, PowerPoint, and more, that help businesses streamline work processes.",
            "Cloud computing services by Amazon, allowing businesses to achieve scalability, flexibility, and cost-effectiveness in IT operations.",
            "Enterprise cloud-based software for human resources and finance management, providing solutions for workforce analytics, payroll, expense management, and more."
        ]
    },
    "Retail Trade": {
        "names": [
            "Amazon",
            "Walmart",
            "Target",
            "Macy's",
            "H&M",
            "Aldi",
            "Nike",
            "Best Buy",
            "Sephora",
            "Zara"
        ],
        "urls": [
            "https://www.amazon.com/",
            "https://www.walmart.com/",
            "https://www.target.com/",
            "https://www.macys.com/",
            "https://www2.hm.com/en_us/index.html",
            "https://www.aldi.us/",
            "https://www.nike.com/",
            "https://www.bestbuy.com/",
            "https://www.sephora.com/",
            "https://www.zara.com/"
        ],
        "descs": [
            "One of the largest online retailers in the world, offering a vast selection of products from books and electronics to clothing and groceries. ",
            "The world's largest brick-and-mortar retailer with a wide range of products such as groceries, pharmacy, electronics, and apparel.",
            "A popular department store chain offering everything from household essentials to fashion products.",
            "A well-known department store chain that offers a wide range of fashion and home goods products.",
            "A popular fashion retailer known for its affordable and trendy clothing options for men, women, and children.",
            "A discount supermarket chain offering high-quality groceries and household essentials at affordable prices.",
            "A globally recognized brand that designs and sells footwear, clothing, and accessories for sports and lifestyle activities.",
            "A major electronics retailer that specializes in tech products such as laptops, computers, and gaming systems.",
            "A top beauty retailer that offers a wide range of makeup and skincare products from various brands.",
            "A popular fast-fashion retailer known for its trendy clothing options for men, women, and children."
        ]
    },
    "Computer & Video Games": {
        "names": [
            "PlayStation",
            "Xbox",
            "Nintendo",
            "Call of Duty",
            "Fortnite",
            "League of Legends",
            "World of Warcraft",
            "Minecraft",
            "Grand Theft Auto",
            "The Legend of Zelda"
        ],
        "urls": [
            "https://www.playstation.com/en-us/",
            "https://www.xbox.com/en-US/",
            "https://www.nintendo.com/",
            "https://www.callofduty.com/",
            "https://www.epicgames.com/fortnite/en-US/home",
            "https://na.leagueoflegends.com/en-us/",
            "https://worldofwarcraft.com/en-us/",
            "https://www.minecraft.net/en-us/",
            "https://www.rockstargames.com/V/",
            "https://www.zelda.com/"
        ],
        "descs": [
            "A popular gaming console manufacturer with a wide variety of games and accessories.",
            "Another popular gaming console manufacturer, known for its exclusive game titles.",
            "A gaming brand that specializes in family-friendly games and consoles.",
            "A first-person shooter video game franchise.",
            "A free-to-play battle royale game with a large following.",
            "A popular online multiplayer battle arena game.",
            "A massively multiplayer online role-playing game (MMORPG) with a loyal player base.",
            "A game that allows players to build and explore virtual worlds.",
            "An action-adventure video game franchise featuring open-world gameplay.",
            "A classic video game series featuring adventure and puzzle-solving elements."
        ]
    },
    "Engineering & Technology": {
        "names": [
            "IBM",
            "Microsoft",
            "Google",
            "Apple Inc.",
            "Amazon Web Services",
            "Cisco Systems",
            "Intel",
            "Hewlett Packard Enterprise",
            "Siemens",
            "Oracle Corporation"
        ],
        "urls": [
            "https://www.ibm.com/",
            "https://www.microsoft.com/",
            "https://www.google.com/",
            "https://www.apple.com/",
            "https://aws.amazon.com/",
            "https://www.cisco.com/",
            "https://www.intel.com/",
            "https://www.hpe.com/",
            "https://www.siemens.com/",
            "https://www.oracle.com/"
        ],
        "descs": [
            "A multinational technology company that specializes in cloud computing, AI, and computer hardware and software.",
            "A technology company that develops and licenses software, computer hardware, and consumer electronics.",
            "A multinational technology company that offers internet-related products and services, including search engines, cloud computing, software, and hardware.",
            "A technology company that designs and sells consumer electronics, computer software, and online services.",
            "A subsidiary of Amazon that offers a suite of cloud computing services, including storage, computing power, and databases.",
            "A multinational technology company that designs, manufactures, and sells networking equipment and telecommunications equipment.",
            "A technology company that designs and manufactures processors, system-on-chips, and other computer components.",
            "A multinational technology company that offers a wide range of IT services, including cloud computing, storage, and networking.",
            "A multinational technology company that offers products and services in the fields of power generation, energy management, automation, and industrial software.",
            "A technology company that offers database software, cloud engineered systems, and enterprise software products."
        ]
    },
    "Online Goodies": {
        "names": [
            "Etsy",
            "Amazon",
            "Zazzle",
            "Society6",
            "ThinkGeek",
            "UncommonGoods",
            "Redbubble",
            "Huckberry",
            "Loot Crate",
            "ModCloth"
        ],
        "urls": [
            "https://www.etsy.com/",
            "https://www.amazon.com/",
            "https://www.zazzle.com/",
            "https://society6.com/",
            "http://www.thinkgeek.com/",
            "https://www.uncommongoods.com/",
            "https://www.redbubble.com/",
            "https://huckberry.com/",
            "https://www.lootcrate.com/",
            "https://www.modcloth.com/"
        ],
        "descs": [
            "An online marketplace for unique and handmade items from independent sellers.",
            "A popular e-commerce website offering a wide range of products.",
            "An online retailer for customizable products such as clothing, accessories, and home decor.",
            "An e-commerce website that sells art prints, phone cases, clothing, and home decor from independent artists.",
            "An online retailer that specializes in geeky items, from Star Wars merchandise to math-themed gifts.",
            "An online retailer for unique and creative gifts, from artisanal jewelry to personalized gifts.",
            "An e-commerce website that sells funky t-shirts, stickers, phone cases, and accessories designed by independent artists.",
            "An online destination for stylish menswear, outdoor gear, and home and tech accessories.",
            "A monthly subscription box service that delivers geeky items such as collectibles, t-shirts, and figurines.",
            "An online retailer for vintage-inspired clothing, accessories, and home decor items."
        ]
    },
    "Communications Equipment": {
        "names": [
            "Cisco Systems",
            "Motorola Solutions",
            "Poly",
            "Plantronics",
            "Avaya",
            "Jabra",
            "Shure",
            "Yealink",
            "Ericsson",
            "Huawei"
        ],
        "urls": [
            "https://www.cisco.com/",
            "https://www.motorolasolutions.com/en_us/home.html",
            "https://www.poly.com/",
            "https://www.poly.com/us/en",
            "https://www.avaya.com/en/",
            "https://www.jabra.com/",
            "https://www.shure.com/",
            "https://www.yealink.com/",
            "https://www.ericsson.com/en",
            "https://www.huawei.com/en/"
        ],
        "descs": [
            "A multinational technology conglomerate that designs, manufactures, and sells networking equipment, including routers and switches.",
            "An American technology company that provides communications equipment, including two-way radios and public safety solutions.",
            "A company that is focused on delivering end-to-end communication solutions, including video conferencing and headsets.",
            "A subsidiary of Poly that specializes in audio communications equipment such as headphones and speakerphones.",
            "A communications technology company that develops solutions for businesses, including unified communications systems and contact center software.",
            "A company that produces professional audio equipment, including headsets designed for use in an office or call center environment.",
            "A company that specializes in microphone and audio equipment for professionals, including the music and broadcast industries.",
            "A company that designs and manufactures IP phones and video conferencing systems.",
            "A multinational technology company that provides communications equipment, including small-cell solutions and radios for mobile networks.",
            "A Chinese multinational technology company that produces networking equipment, including routers and switches, as well as smartphones and other consumer devices."
        ]
    },
    "Government": {
        "names": [
            "GovDeals",
            "USA.gov",
            "GSA",
            "FEMA",
            "TSA",
            "USPS",
            "White House",
            "FBI",
            "CIA",
            "IRS"
        ],
        "urls": [
            "https://www.govdeals.com/",
            "https://www.usa.gov/",
            "https://www.gsa.gov/",
            "https://www.fema.gov/",
            "https://www.tsa.gov/",
            "https://www.usps.com/",
            "https://www.whitehouse.gov/",
            "https://www.fbi.gov/",
            "https://www.cia.gov/",
            "https://www.irs.gov/"
        ],
        "descs": [
            "Online auction platform for government surplus property.",
            "Official web portal of the United States government.",
            "General Services Administration, manages government buildings and procurement contracts.",
            "Federal Emergency Management Agency, responsible for disaster response and recovery.",
            "Transportation Security Administration, responsible for airport security screening.",
            "United States Postal Service, delivers mail and packages.",
            "Official website of the White House and Executive Branch of the U.S. government.",
            "Federal Bureau of Investigation, responsible for investigating federal crimes.",
            "Central Intelligence Agency, responsible for gathering intelligence on foreign governments and organizations.",
            "Internal Revenue Service, responsible for tax collection and enforcement."
        ]
    },
    "Mental Health": {
        "names": [
            "Headspace",
            "BetterHelp",
            "Calm",
            "Talkspace",
            "Pacifica",
            "SAMHSA",
            "NAMI",
            "7 Cups",
            "MindShift",
            "Happify"
        ],
        "urls": [
            "https://www.headspace.com/",
            "https://www.betterhelp.com/",
            "https://www.calm.com/",
            "https://www.talkspace.com/",
            "https://www.thinkpacifica.com/",
            "https://www.samhsa.gov/",
            "https://www.nami.org/",
            "https://www.7cups.com/",
            "https://www.anxietycanada.com/resources/mindshift-cbt/",
            "https://www.happify.com/"
        ],
        "descs": [
            "A meditation and mindfulness app that offers guided meditations to reduce stress and improve mental wellbeing.",
            "An online platform that connects users to licensed counselors and therapists for private, convenient counseling sessions.",
            "A meditation and mindfulness app that offers guided meditations, breathing exercises, and sleep stories to improve mental wellbeing.",
            "An online therapy platform that offers messaging, video, and voice sessions with licensed therapists for mental health treatment.",
            "An app that offers daily tools for stress and anxiety management, including guided meditations, mood tracking, and cognitive behavioral therapy exercises.",
            "The Substance Abuse and Mental Health Services Administration is a government agency that provides resources and treatment referrals for mental health and substance abuse disorders.",
            "The National Alliance on Mental Illness is a non-profit organization that provides education, support, and advocacy for individuals and families affected by mental illness.",
            "An online emotional support platform that connects users with trained listeners for confidential counseling and conversation.",
            "An app that offers cognitive behavioral therapy strategies for managing anxiety and stress in daily life.",
            "An app that offers evidence-based activities and games that promote happiness and positive thinking for improved mental wellbeing."
        ]
    },
    "Networking": {
        "names": [
            "Cisco Networking",
            "Juniper Networks",
            "Aruba Networks",
            "Ubiquiti Networks",
            "Avaya Networking",
            "Extreme Networks",
            "Brocade Networking",
            "HPE Networking",
            "Fortinet Networking",
            "SonicWall Networking"
        ],
        "urls": [
            "https://www.cisco.com/c/en/us/products/index.html",
            "https://www.juniper.net/us/en/products-services/index.html",
            "https://www.arubanetworks.com/products/",
            "https://www.ui.com/products/#default",
            "https://www.avaya.com/en/products/networking/",
            "https://www.extremenetworks.com/products/",
            "https://www.brocade.com/en/products-services.html",
            "https://www.hpe.com/us/en/solutions/networking.html",
            "https://www.fortinet.com/products",
            "https://www.sonicwall.com/products/"
        ],
        "descs": [
            "A leading provider of networking equipment and solutions for both businesses and individuals.",
            "A network equipment and security systems provider for businesses of all sizes.",
            "A Hewlett Packard Enterprise company that offers Wi-Fi and networking solutions for businesses.",
            "A company that provides network devices such as wireless access points, routers, and switches for businesses and individuals.",
            "A digital communication and networking solutions provider for businesses and government entities.",
            "A company that offers network infrastructure and management solutions for businesses of all sizes.",
            "A networking solutions provider that offers a range of products including routers, switches, and software-defined networking (SDN) solutions.",
            "A company that provides networking solutions for businesses, including cloud-based and software-defined networking solutions.",
            "A provider of network security and wireless solutions for small and medium-sized businesses (SMBs) and enterprises.",
            "A provider of firewall, VPN, and wireless access point solutions for businesses, government entities, and educational institutions."
        ]
    },
    "Chemicals Industry": {
        "names": [
            "Dow Chemical Company",
            "BASF SE",
            "AkzoNobel",
            "DuPont de Nemours, Inc.",
            "Shell Chemicals",
            "Eastman Chemical Company",
            "Huntsman Corporation",
            "Dow Corning",
            "W.R. Grace & Co.",
            "Clariant"
        ],
        "urls": [
            "https://www.dow.com/",
            "https://www.basf.com/global/en.html",
            "https://www.akzonobel.com/",
            "https://www.dupont.com/",
            "https://www.shell.com/business-customers/chemicals.html",
            "https://www.eastman.com/",
            "https://www.huntsman.com/",
            "https://www.dowcorning.com/default.aspx",
            "https://www.grace.com/",
            "https://www.clariant.com/en/Home"
        ],
        "descs": [
            "A multinational corporation that produces a wide range of chemical, plastic, and agricultural products.",
            "A leading chemical company that offers a variety of products and solutions for various industries including automotive, construction, agriculture, and personal care.",
            "A Dutch multinational company that produces paints, coatings, and specialty chemicals.",
            "A science and technology company that creates solutions for various industries such as electronics, transportation, and construction.",
            "A global chemicals company that offers a diverse range of products such as solvents, plastics, and detergents.",
            "A specialty chemicals company that produces a wide range of products including adhesives, coatings, and plasticizers.",
            "A global manufacturer and marketer of differentiated chemicals such as polyurethanes, epoxy resins, and pigments.",
            "A silicone-based product manufacturer that produces a range of chemicals for automotive, construction, and personal care industries.",
            "An American chemical company that produces catalysts and specialty chemicals for the chemical, construction, and petroleum industries.",
            "A Swiss specialty chemicals company that produces pigments, additives, and performance chemicals for various industries such as plastics, agriculture, and personal care."
        ]
    },
    "Industrial Materials & Equipment": {
        "names": [
            "Caterpillar",
            "3M",
            "Siemens",
            "DuPont",
            "Honeywell",
            "Bosch",
            "SKF",
            "Emerson",
            "Eaton",
            "Parker Hannifin"
        ],
        "urls": [
            "https://www.cat.com/",
            "https://www.3m.com/",
            "https://new.siemens.com/global/en/products.html",
            "https://www.dupont.com/",
            "https://www.honeywell.com/us/en/products",
            "https://www.bosch.com/products-and-services/",
            "https://www.skf.com/us/products",
            "https://www.emerson.com/en-us/products",
            "https://www.eaton.com/us/en-us/products.html",
            "https://www.parker.com/portal/site/PARKER/menuitem.f62d264919e06e598cfcc42e37ad1ca0/?vgnextoid=dd92c2fd2a63c110VgnVCM10000032a71dacRCRD&vgnextfmt=EN"
        ],
        "descs": [
            "a global manufacturer of construction and mining equipment, diesel and natural gas engines, industrial gas turbines, and diesel-electric locomotives.",
            "a diversified technology company that produces abrasives, adhesives, chemicals, coatings, films, and filters for industrial applications.",
            "a multinational conglomerate that provides a range of products including automation and control systems, building technologies, energy management systems, and industrial software.",
            "an American company that manufactures industrial materials such as polymers, films, fibers, and chemicals for use in a variety of industries.",
            "a global company that produces automation and control solutions, safety and security systems, and other industrial products such as chemicals and specialty materials.",
            "a German multinational that develops and produces a wide range of products including automotive parts, power tools, industrial equipment, and building technologies.",
            "a Swedish company that specializes in bearings, seals, lubrication systems, and other industrial equipment for the manufacturing, energy, and other sectors.",
            "an American company that produces industrial automation systems, measurement and analytical instruments, and other technologies for a variety of applications.",
            "a power management company that produces electrical, hydraulic, and mechanical systems for industrial and commercial customers.",
            "a manufacturer of motion and control technologies including hydraulic systems, pneumatic equipment, and electromechanical components."
        ]
    },
    "Apparel": {
        "names": [
            "Nike",
            "Levi's",
            "H&M",
            "Lululemon",
            "Zara",
            "Patagonia",
            "Adidas",
            "Uniqlo",
            "The North Face",
            "J.Crew"
        ],
        "urls": [
            "https://www.nike.com/",
            "https://www.levi.com/US/en_US/",
            "https://www2.hm.com/en_us/index.html",
            "https://shop.lululemon.com/",
            "https://www.zara.com/us/",
            "https://www.patagonia.com/home/",
            "https://www.adidas.com/us",
            "https://www.uniqlo.com/us/en/home/",
            "https://www.thenorthface.com/",
            "https://www.jcrew.com/"
        ],
        "descs": [
            "A popular brand that offers athletic apparel and footwear for men, women, and children.",
            "A well-known denim brand that offers jeans and other clothing for men, women, and children.",
            "A fast-fashion brand that offers trendy clothing and accessories for men, women, and children.",
            "A brand that offers high-quality athletic apparel, especially known for their yoga pants and leggings.",
            "A fast-fashion brand that offers clothing, shoes, and accessories for men, women, and children.",
            "A brand that offers outdoor apparel and gear for men, women, and children, with a focus on sustainability.",
            "A popular brand that offers athletic apparel, footwear, and accessories for men, women, and children.",
            "A brand that offers minimalistic and stylish clothing and accessories for men, women, and children.",
            "A brand that offers outdoor apparel and gear for men, women, and children, with a focus on performance and durability.",
            "A brand that offers timeless and classic clothing and accessories for men, women, and children."
        ]
    },
    "Bed & Bath": {
        "names": [
            "Brooklinen",
            "Parachute",
            "Crane & Canopy",
            "Boll & Branch",
            "Buffy",
            "Coyuchi",
            "Casper",
            "Snowe Home",
            "West Elm",
            "The Company Store"
        ],
        "urls": [
            "https://www.brooklinen.com/",
            "https://www.parachutehome.com/",
            "https://www.craneandcanopy.com/",
            "https://www.bollandbranch.com/",
            "https://buffy.co/",
            "https://www.coyuchi.com/",
            "https://casper.com/",
            "https://snowehome.com/",
            "https://www.westelm.com/",
            "https://www.thecompanystore.com/"
        ],
        "descs": [
            "Luxury bedding and bath linens made with high-quality materials.",
            "A popular brand for premium bedding and bath essentials, including towels, robes, and slippers.",
            "A well-known brand for stylish and affordable bedding sets, duvet covers, comforters, and sheets.",
            "An organic cotton bedding brand that offers high-quality sheets, duvet covers, and pillowcases.",
            "An eco-friendly bedding brand that offers comforters, sheets, and pillows made from recycled materials.",
            "An organic bedding and bath brand specializing in sustainable and eco-friendly products.",
            "A popular brand for mattresses, pillows, and bedding essentials, available in a range of materials and sizes.",
            "A luxury bedding and bath brand known for its minimalist and high-quality linens.",
            "A furniture and home decor brand that includes bedding, towels, and bath accessories in its product line.",
            "An online retailer specializing in bedding and bath essentials, including comforters, pillows, sheets, towels, and more."
        ]
    },
    "Social Issues & Advocacy": {
        "names": [
            "ACLU",
            "Black Lives Matter",
            "Everytown for Gun Safety",
            "Human Rights Campaign",
            "National Organization for Women",
            "Planned Parenthood",
            "Southern Poverty Law Center",
            "Sierra Club",
            "Anti-Defamation League",
            "National Association for the Advancement of Colored People (NAACP)"
        ],
        "urls": [
            "https://www.aclu.org/",
            "https://blacklivesmatter.com/",
            "https://everytown.org/",
            "https://www.hrc.org/",
            "https://now.org/",
            "https://www.plannedparenthood.org/",
            "https://www.splcenter.org/",
            "https://www.sierraclub.org/",
            "https://www.adl.org/",
            "https://www.naacp.org/"
        ],
        "descs": [
            "An organization that works to defend and preserve the individual rights and liberties guaranteed by the Constitution and laws of the United States.",
            "A movement that campaigns against violence and systemic racism towards Black people.",
            "An organization that advocates for common-sense gun laws to reduce gun violence.",
            "An LGBTQ+ civil rights organization that advocates for equality and works to educate the public about LGBTQ+ issues.",
            "An organization that fights for gender equality and women's rights through legal advocacy, grassroots activism and public policy.",
            "A healthcare provider that offers reproductive services, education and advocacy to empower individuals to make informed decisions about their health.",
            "An organization that monitors hate and extremism in the United States and uses litigation and education to fight for justice and equality for marginalized communities.",
            "An environmental organization that advocates for policies to protect the planet's natural resources and works to connect people to nature.",
            "An organization that fights hate and bigotry by exposing and countering hate speech and advocating for laws to protect individuals from discrimination.",
            "A civil rights organization that advocates for racial justice and equality through litigation, advocacy, and education."
        ]
    },
    "Online Games": {
        "names": [
            "Fortnite",
            "League of Legends",
            "World of Warcraft",
            "Hearthstone",
            "Minecraft",
            "PlayerUnknown's Battlegrounds",
            "Counter-Strike: Global Offensive",
            "Apex Legends",
            "Roblox",
            "Among Us"
        ],
        "urls": [
            "https://www.epicgames.com/fortnite",
            "https://na.leagueoflegends.com/",
            "https://worldofwarcraft.com/en-us/",
            "https://playhearthstone.com/en-us/",
            "https://www.minecraft.net/en-us/",
            "https://www.pubg.com/",
            "https://store.steampowered.com/app/730/CounterStrike_Global_Offensive/",
            "https://www.ea.com/games/apex-legends",
            "https://www.roblox.com/",
            "https://innersloth.com/gameAmongUs.php"
        ],
        "descs": [
            "A popular free-to-play battle royale game with over 350 million players across the globe.",
            "A free-to-play, multiplayer online battle arena game widely popular for its competitive gameplay and esports scene.",
            "One of the most well-known massively multiplayer online role-playing games (MMORPGs) with millions of players worldwide.",
            "A free-to-play online digital collectible card game set in the Warcraft universe, developed by Blizzard Entertainment.",
            "A massively popular sandbox video game where players can build their own virtual worlds and engage in various activities.",
            "A multiplayer battle royale game where you fight to be the last one standing.",
            "A multiplayer first-person shooter game that has been popular for over 20 years.",
            "A free-to-play battle royale game with unique heroes and abilities.",
            "A game creation platform that allows users to create and play games made by other users.",
            "A multiplayer game where players work together to find the impostor on their ship."
        ]
    },
    "Domestic Services": {
        "names": [
            "Handy",
            "TaskRabbit",
            "Merry Maids",
            "Thumbtack",
            "HomeAdvisor",
            "Angi",
            "Care.com",
            "LawnStarter",
            "TIDY",
            "Molly Maid"
        ],
        "urls": [
            "https://www.handy.com/",
            "https://www.taskrabbit.com/",
            "https://www.merrymaids.com/",
            "https://www.thumbtack.com/",
            "https://www.homeadvisor.com/",
            "https://www.angi.com/",
            "https://www.care.com/",
            "https://www.lawnstarter.com/",
            "https://tidy.com/",
            "https://www.mollymaid.com/"
        ],
        "descs": [
            "A home cleaning and handyman service that allows customers to book appointments online.",
            "An online and mobile marketplace that connects customers with skilled professionals for various household tasks.",
            "A cleaning service that specializes in recurring home cleaning services.",
            "An online platform that connects customers to local professionals for various home services including house cleaning, plumbing, and landscaping services.",
            "A digital marketplace that connects homeowners with local service professionals in areas such as renovation, maintenance, and repairs.",
            "Previously known as Angie's List, Angi is an online review platform that connects homeowners with local service professionals in various fields.",
            "A platform that connects families with caregivers for services such as child care, senior care, and pet care.",
            "A platform that connects homeowners with lawn care professionals for services such as lawn mowing, fertilization, and landscaping.",
            "An on-demand home cleaning and organization service that allows customers to book appointments through a mobile app.",
            "A professional cleaning service that offers customized cleaning plans for residential customers."
        ]
    },
    "Social Sciences": {
        "names": [
            "Pearson Education",
            "Sage Publishing",
            "Oxford University Press",
            "Cambridge University Press",
            "National Geographic",
            "American Psychological Association",
            "Khan Academy",
            "Pew Research Center",
            "TED Talks",
            "Coursera"
        ],
        "urls": [
            "https://www.pearson.com/us/higher-education.html",
            "https://us.sagepub.com/en-us/nam/home",
            "https://global.oup.com/academic/subjects/social-sciences/?cc=us&lang=en&",
            "https://www.cambridge.org/us/academic/subjects/social-sciences",
            "https://www.nationalgeographic.com/",
            "https://www.apa.org/",
            "https://www.khanacademy.org/humanities",
            "https://www.pewresearch.org/",
            "https://www.ted.com/topics/social+science",
            "https://www.coursera.org/courses?query=social%20sciences"
        ],
        "descs": [
            "A publisher of textbooks and resources for students and educators in social sciences.",
            "A publisher of academic books, journals, and digital resources for social and behavioral sciences.",
            "A publisher of academic books, journals, and online resources in social sciences.",
            "A publisher of research and academic books and journals, specializing in social sciences.",
            "A media and education organization that covers social and cultural topics, including anthropology, history, and geography.",
            "A professional association for psychologists that provides resources, publications, and research in social sciences.",
            "A non-profit educational organization that offers free online courses in social sciences subjects, including history, economics, and politics.",
            "A nonpartisan research organization that conducts surveys and studies on social and political issues.",
            "A platform for sharing ideas through informative and engaging talks, including many on social sciences topics.",
            "An online learning platform that offers courses from top universities in social sciences fields such as psychology, sociology, and communication."
        ]
    },
    "Spas & Beauty Services": {
        "names": [
            "Bliss Spa",
            "Sephora",
            "Lush Cosmetics",
            "Drybar",
            "Massage Envy",
            "Benefit Cosmetics",
            "European Wax Center",
            "Ulta Beauty",
            "The Body Shop",
            "Aveda"
        ],
        "urls": [
            "https://www.blissspa.com/",
            "https://www.sephora.com/",
            "https://www.lushusa.com/",
            "https://www.thedrybar.com/",
            "https://www.massageenvy.com/",
            "https://www.benefitcosmetics.com/",
            "https://www.waxcenter.com/",
            "https://www.ulta.com/",
            "https://www.thebodyshop.com/",
            "https://www.aveda.com/"
        ],
        "descs": [
            "Offers various spa services such as massages, facials, and body treatments.",
            "Beauty retailer offering a wide range of products from makeup to skincare.",
            "Handmade cosmetics offering bath products, soaps, and skincare.",
            "A salon specializing in blowouts for all hair types.",
            "Offers massages, facials, and other spa services.",
            "Offers makeup and skincare products.",
            "Specializes in waxing services for both men and women.",
            "Retailer offering a wide range of products for makeup, skincare, and haircare.",
            "Offers cruelty-free skincare and bath products.",
            "Offers natural haircare, skincare, and beauty products."
        ]
    },
    "Transportation & Logistics": {
        "names": [
            "DHL",
            "UPS",
            "FedEx",
            "Maersk",
            "C.H. Robinson",
            "XPO Logistics",
            "J.B. Hunt",
            "Schneider National",
            "Knight-Swift",
            "Ceva Logistics"
        ],
        "urls": [
            "https://www.dhl.com/en.html",
            "https://www.ups.com/us/en/Home.page",
            "https://www.fedex.com/en-us/home.html",
            "https://www.maersk.com/",
            "https://www.chrobinson.com/",
            "https://www.xpo.com/",
            "https://www.jbhunt.com/",
            "https://schneider.com/",
            "https://www.knightswift.com/",
            "https://www.cevalogistics.com/"
        ],
        "descs": [
            "Offers a range of logistics services including express shipping, supply chain management, and warehouse solutions.",
            "Offers package delivery, logistics, and transportation solutions to businesses and individuals.",
            "Provides transportation, e-commerce, and logistics solutions including air, ground, and freight shipping services.",
            "A global logistics and transportation company that provides container shipping and supply chain management services.",
            "A third-party logistics provider that offers transportation, warehousing, and freight coordination services.",
            "Provides logistics and transportation services including freight brokerage, last-mile delivery, and global forwarding.",
            "A transportation and logistics company that offers truckload, intermodal, and dedicated contract carriage services.",
            "Provides transportation and logistics services including truckload, intermodal, and brokerage solutions.",
            "A transportation company that provides truckload and logistics services, serving North America and Mexico.",
            "Offers freight forwarding, contract logistics, and transportation management services to businesses globally."
        ]
    },
    "Agriculture & Forestry": {
        "names": [
            "John Deere",
            "Monsanto",
            "Archer Daniels Midland Company",
            "Cargill",
            "The Scotts Miracle-Gro Company",
            "Syngenta",
            "Timberland",
            "Green Tokri",
            "API Agro International",
            "Daltons foliage"
        ],
        "urls": [
            "https://www.deere.com/",
            "https://www.monsanto.com/",
            "https://www.adm.com/",
            "https://www.cargill.com/",
            "https://www.scotts.com/en-us",
            "https://www.syngenta.com/",
            "https://www.timberland.com/",
            "http://greentokri.com/",
            "https://apiagrointernational.com/",
            "https://www.daltons.co.nz/home-gardening/products/garden-care-products/foliage"
        ],
        "descs": [
            "A well-known brand providing agricultural technologies, services, and solutions.",
            "A popular biotechnology and agriculture product company that deals in herbicides and genetically modified seeds.",
            "A multinational food processing and commodities trading corporation involved in agricultural processing and food ingredients.",
            "An international producer and marketer of food, agricultural, financial, and industrial products and services.",
            "A global marketer of products for lawn and garden care.",
            "A leading global company providing AG input solutions to growers globally",
            "A famous brand that designs and promotes eco-friendly outdoor footwear and apparel, uses recycled materials to make products.",
            "A company based in India that supplies fresh and organic vegetables, fruits, and herbs for your daily needs.",
            "An agricultural company that focuses on organic farming by using natural techniques to make their products.",
            "Manufacturer of premium graded bagged growing media products designed specifically for foliage plants."
        ]
    },
    "Performing Arts": {
        "names": [
            "Broadway.com",
            "Juilliard School",
            "New York City Ballet",
            "Lincoln Center for the Performing Arts",
            "Cirque du Soleil",
            "Royal Shakespeare Company",
            "The Metropolitan Opera",
            "Alvin Ailey American Dance Theater",
            "American Ballet Theatre",
            "Second City"
        ],
        "urls": [
            "https://www.broadway.com/",
            "https://www.juilliard.edu/",
            "https://www.nycballet.com/",
            "https://www.lincolncenter.org/",
            "https://www.cirquedusoleil.com/",
            "https://www.rsc.org.uk/",
            "https://www.metopera.org/",
            "https://www.alvinailey.org/",
            "https://www.abt.org/",
            "https://www.secondcity.com/"
        ],
        "descs": [
            "A website that covers news, reviews, and information about Broadway theater productions.",
            "A prestigious performing arts conservatory in New York City that trains students in dance, drama, and music.",
            "A world-renowned ballet company based in New York City.",
            "A performing arts complex in Manhattan that hosts a range of performances, including theater, music, and dance.",
            "A Canadian entertainment company known for its unique circus-style productions.",
            "A British theater company that specializes in producing Shakespeare plays.",
            "An opera company based at the Metropolitan Opera House in New York City.",
            "A modern dance company that is known for its innovative choreography and powerful performances.",
            "One of the most prestigious ballet companies in the world, based in New York City.",
            "A Chicago-based improv comedy troupe that has launched the careers of many famous comedians."
        ]
    },
    "Offbeat": {
        "names": [
            "BlackMilk Clothing",
            "Irregular Choice",
            "Shrimps",
            "Lazy Oaf",
            "Gudetama",
            "Betsey Johnson",
            "Too Faced",
            "PopSockets",
            "Ban.do",
            "The Unemployed Philosophers Guild"
        ],
        "urls": [
            "https://blackmilkclothing.com/",
            "https://www.irregularchoice.com/",
            "https://shrimps.com/",
            "https://www.lazyoaf.com/",
            "https://www.sanrio.com/characters/gudetama",
            "https://www.betseyjohnson.com/",
            "https://www.toofaced.com/",
            "https://www.popsockets.com/",
            "https://www.bando.com/",
            "https://www.philosophersguild.com/"
        ],
        "descs": [
            "A brand that specializes in unique and quirky leggings, dresses, and tops featuring eye-catching prints.",
            "A shoe brand that creates playful and unconventional designs featuring glitter, unusual fabrics, and cartoonish elements.",
            "A luxury clothing brand that features bold, colorful faux fur coats, statement dresses, and playful accessories like beaded bags and hair clips.",
            "A UK-based brand that creates playful and colorful clothing with a cartoonish and irreverent edge.",
            "A Sanrio character that the brand describes as \"the lazy egg,\" featuring a mischievous and irreverent character plastered on everything from plush toys to phone cases.",
            "A fashion designer famous for her eccentric and playful designs featuring colorful prints, whimsical detailing, and punk rock flair.",
            "A cosmetics brand that offers playful and fun makeup products, featuring bright colors, glitter, and cute packaging.",
            "A phone accessory brand that creates quirky and offbeat pop-out phone grips and stands featuring funky designs.",
            "A lifestyle brand that creates playful and colorful accessories, stationery, and clothing featuring bold graphics and irreverent messages.",
            "A gift and novelty brand that offers quirky and offbeat products related to pop culture, literature, and art, such as mug featuring famous literary figures or magnetic finger puppets of famous philosophers."
        ]
    },
    "Pets": {
        "names": [
            "Chewy",
            "Purina",
            "Pedigree",
            "Friskies",
            "Kong",
            "Hartz",
            "Hill's Science Diet",
            "Tidy Cats",
            "Blue Buffalo",
            "Rachael Ray Nutrish"
        ],
        "urls": [
            "https://www.chewy.com/",
            "https://www.purina.com/",
            "https://www.pedigree.com/",
            "https://www.friskies.com/",
            "https://www.kongcompany.com/",
            "https://www.hartz.com/",
            "https://www.hillspet.com/science-diet",
            "https://www.tidycats.com/",
            "https://bluebuffalo.com/",
            "https://www.nutrish.com/"
        ],
        "descs": [
            "A popular online retailer that specializes in pet food, toys, and supplies.",
            "A well-known brand that produces a variety of pet food for dogs, cats, and small pets.",
            "Another commonly known brand that produces dog food and treats.",
            "A brand that specializes in cat food, treats, and cat litter.",
            "A popular brand that creates durable rubber toys for dogs.",
            "A brand that produces flea and tick treatments, pet shampoos, and other pet care products.",
            "A brand that creates dog and cat food with specific nutritional needs in mind.",
            "A brand that specializes in cat litter products.",
            "A brand that produces natural dog and cat food made with high-quality ingredients.",
            "A brand that specializes in dog and cat food made with natural ingredients and free from artificial flavors and preservatives."
        ]
    },
    "Laundry": {
        "names": [
            "Tide Pods",
            "Downy Fabric Conditioner",
            "Bounce Dryer Sheets",
            "Woolite Laundry Detergent",
            "OxiClean Stain Remover",
            "Gain Laundry Detergent",
            "Arm & Hammer Laundry Detergent",
            "Seventh Generation Laundry Detergent",
            "Persil Laundry Detergent",
            "All Laundry Detergent"
        ],
        "urls": [
            "https://tide.com/en-us/shop/type/laundry-pods",
            "https://downy.com/en-us",
            "https://bouncefresh.com/",
            "https://www.woolite.us/",
            "https://www.oxiclean.com/",
            "https://ilovegain.com/en-us/shop/type/laundry-detergent",
            "https://www.armandhammer.com/laundry",
            "https://www.seventhgeneration.com/laundry",
            "https://www.persilproclean.com/",
            "https://www.all-laundry.com/"
        ],
        "descs": [
            "A popular laundry detergent solution that comes in convenient, pre-measured pods. ",
            "A well-known brand that offers fabric softeners and dryer sheets for a softer, long-lasting freshness. ",
            "A brand that offers various dryer sheets that reduce static cling, soften clothes, and leave a fresh scent. ",
            "A gentle laundry detergent that helps to preserve the color, shape, and fabric softness of clothes. ",
            "A versatile stain remover that can be used on various surfaces and fabrics, including carpets and laundry. ",
            "A brand that offers laundry detergents with long-lasting scent and cleaning power. ",
            "A brand that offers various laundry solutions with baking soda for a deep clean and odor elimination. ",
            "A brand that specializes in natural and eco-friendly laundry products that are safe for the environment and sensitive skin. ",
            "A powerful laundry detergent that removes tough stains and leaves clothes smelling clean and fresh. ",
            "A brand that offers various laundry solutions for different fabrics, allergies and sensitivities, and scent preferences."
        ]
    },
    "Small Business": {
        "names": [
            "Square",
            "Shopify",
            "Wix",
            "FreshBooks",
            "Mailchimp",
            "QuickBooks",
            "LegalZoom",
            "GoDaddy",
            "Hootsuite",
            "Canva"
        ],
        "urls": [
            "https://squareup.com/",
            "https://www.shopify.com/",
            "https://www.wix.com/",
            "https://www.freshbooks.com/",
            "https://mailchimp.com/",
            "https://quickbooks.intuit.com/",
            "https://www.legalzoom.com/",
            "https://www.godaddy.com/",
            "https://hootsuite.com/",
            "https://www.canva.com/"
        ],
        "descs": [
            "A payment and financial services company that allows small businesses to accept credit card payments and manage their finances.",
            "An e-commerce platform that helps small businesses create online stores and sell products.",
            "A website building platform that small businesses can use to create and manage their websites.",
            "An accounting software that small businesses can use to manage invoices, expenses, and finances.",
            "An email marketing platform that small businesses can use to create and send marketing emails to their customers.",
            "A small business accounting software that helps with financial management and tax preparation.",
            "An online legal service that small businesses can use to create legal documents and incorporate their business.",
            "A domain registrar and website hosting service that small businesses can use to create and host their websites.",
            "A social media management platform that small businesses can use to manage multiple social media accounts and schedule posts.",
            "A graphic design platform that small businesses can use to create marketing materials, social media posts, and other visuals."
        ]
    },
    "Visual Art & Design": {
        "names": [
            "Adobe Creative Cloud",
            "Pantone",
            "Wacom",
            "Behance",
            "Canva",
            "Sketch",
            "Figma",
            "Dribbble",
            "CorelDRAW",
            "Procreate"
        ],
        "urls": [
            "https://www.adobe.com/creativecloud.html",
            "https://www.pantone.com/",
            "https://www.wacom.com/en-us",
            "https://www.behance.net/",
            "https://www.canva.com/",
            "https://www.sketch.com/",
            "https://www.figma.com/",
            "https://dribbble.com/",
            "https://www.coreldraw.com/",
            "https://procreate.art/"
        ],
        "descs": [
            "A software suite used for graphic design, video editing, web design, and photography.",
            "A company that provides color matching products and services, commonly used in the design and printing industries.",
            "A brand that produces interactive pen displays and tablets used for digital drawing and design.",
            "An online platform to showcase and discover creative work by designers, photographers, and other artists.",
            "A graphic design platform that allows users to create social media graphics, presentations, posters, and other visual content.",
            "A vector graphics editor and digital design tool that is primarily used for designing user interfaces and web apps.",
            "A cloud-based design tool that allows designers to collaborate on designs and create user interface prototypes.",
            "An online community for showcasing user-generated design work, including graphic design, web design, and other creative applications.",
            "A vector graphics editor that is used for creating logos, posters, and other visual designs.",
            "A digital drawing and painting app that is optimized for use on the iPad."
        ]
    },
    "Cooking & Recipes": {
        "names": [
            "Tasty",
            "Bon Appétit",
            "Allrecipes",
            "Food52",
            "Epicurious",
            "Cook's Illustrated",
            "Martha Stewart",
            "Serious Eats",
            "Simply Recipes",
            "America's Test Kitchen"
        ],
        "urls": [
            "https://tasty.co/",
            "https://www.bonappetit.com/",
            "https://www.allrecipes.com/",
            "https://food52.com/",
            "https://www.epicurious.com/",
            "https://www.cooksillustrated.com/",
            "https://www.marthastewart.com/",
            "https://www.seriouseats.com/",
            "https://www.simplyrecipes.com/",
            "https://www.americastestkitchen.com/"
        ],
        "descs": [
            "A popular online cooking platform that offers a wide variety of recipes and instructional videos.",
            "A popular food magazine that offers a wealth of cooking-related content, including recipes, articles, and videos.",
            "One of the most popular recipe websites in the world, offering a massive collection of user-submitted recipes.",
            "A recipe and cooking website that offers a curated collection of recipes, as well as articles on food and cooking tips.",
            "A go-to website for recipes, cooking tips, and food news for cooking enthusiasts of all levels.",
            "A cooking magazine and website that provides in-depth recipe testing, cooking techniques, and product reviews.",
            "A well-known name in the world of cooking and entertaining, offering recipes, cooking techniques, and lifestyle advice.",
            "A website that offers a wide range of food-related content, including recipes, science-based cooking tips, and product reviews.",
            "A popular recipe website that provides easy-to-follow recipes, cooking tips, and meal planning advice.",
            "A cooking show and website that provides recipe testing, cooking tips, and equipment and ingredient reviews."
        ]
    },
    "Fashion & Style": {
        "names": [
            "Zara",
            "Gucci",
            "Levi's",
            "Nike",
            "Chanel",
            "H&M",
            "Prada",
            "Michael Kors",
            "Adidas",
            "Burberry"
        ],
        "urls": [
            "https://www.zara.com/",
            "https://www.gucci.com",
            "https://www.levi.com/US/en_US/",
            "https://www.nike.com/",
            "https://www.chanel.com/",
            "https://www2.hm.com/",
            "https://www.prada.com/",
            "https://www.michaelkors.com/",
            "https://www.adidas.com/",
            "https://us.burberry.com/"
        ],
        "descs": [
            "A popular fast-fashion brand known for on-trend and affordable clothing.",
            "A luxury brand offering clothing, accessories, and footwear with a distinctive design.",
            "A well-known denim brand that offers a variety of styles and fits.",
            "A renowned brand of athletic wear, footwear, and accessories.",
            "A high-end fashion and beauty brand known for its timeless style and sophistication.",
            "A popular fast-fashion retailer that offers modern clothing at affordable prices.",
            "A luxury brand offering a range of products including clothing, accessories, and fragrance.",
            "A fashion brand that offers designer clothing, handbags, and accessories.",
            "A popular brand of athletic wear, footwear, and accessories.",
            "A luxury fashion brand known for its iconic trench coats and timeless designs."
        ]
    },
    "Health Conditions": {
        "names": [
            "GoodRx",
            "WebMD",
            "Mayo Clinic",
            "Zocdoc",
            "MyFitnessPal",
            "Dexcom",
            "OraQuick",
            "Benadryl",
            "Prevagen",
            "Philips Sonicare"
        ],
        "urls": [
            "https://www.goodrx.com/",
            "https://www.webmd.com/",
            "https://www.mayoclinic.org/",
            "https://www.zocdoc.com/",
            "https://www.myfitnesspal.com/",
            "https://www.dexcom.com/",
            "https://www.oraquick.com/",
            "https://www.benadryl.com/",
            "https://www.prevagen.com/",
            "https://www.usa.philips.com/c-m-pe/electric-toothbrushes"
        ],
        "descs": [
            "A website and app that provides prices and discounts on prescription medications for individuals with various health conditions.",
            "A popular online resource for medical news, health advice, and information on various health conditions.",
            "A medical center with an extensive website resource that offers expert information on different health conditions, treatment options, and preventative care.",
            "An online resource that connects patients with doctors that specialize in treating various health conditions.",
            "A health app that allows users to track their nutrition, exercise, and monitor personal health conditions.",
            "A medical device company that creates continuous glucose monitoring (CGM) systems for individuals with diabetes.",
            "A diagnostic healthcare company that provides in-home testing for a range of sexually transmitted infections.",
            "An allergy medication that provides relief for allergy symptoms caused by a variety of health conditions.",
            "A dietary supplement that promotes healthy brain function and memory, which can be beneficial for individuals with neurological health conditions.",
            "An electric toothbrush brand that offers specialized options for individuals with specific oral health conditions, such as gum disease or sensitive teeth."
        ]
    },
    "Humor": {
        "names": [
            "The Onion",
            "Cards Against Humanity",
            "Saturday Night Live",
            "Conan O'Brien",
            "Funny or Die",
            "Calvin and Hobbes",
            "The Simpsons",
            "The Daily Show with Trevor Noah",
            "SNL Digital Shorts",
            "Weird Al Yankovic"
        ],
        "urls": [
            "https://www.theonion.com/",
            "https://cardsagainsthumanity.com/",
            "https://www.nbc.com/saturday-night-live",
            "https://teamcoco.com/",
            "https://www.funnyordie.com/",
            "https://www.gocomics.com/calvinandhobbes",
            "https://www.fox.com/the-simpsons/",
            "https://www.cc.com/shows/the-daily-show-with-trevor-noah",
            "https://www.youtube.com/playlist?list=PL1GNUmw2spOvXwkS-ZHdKj7Pq3xTf-o46",
            "https://www.weirdal.com/"
        ],
        "descs": [
            "Satirical news site with humorous articles and headlines.",
            "Popular party game where players fill in the blanks to create funny or offensive phrases.",
            "Sketch comedy show that parodies current events and pop culture.",
            "Late night talk show host known for his self-deprecating humor and wacky skits.",
            "Online comedy platform with original videos, articles, and comedic series.",
            "Beloved comic strip featuring a mischievous boy and his imaginary tiger friend.",
            "Long-running animated sitcom known for its sharp satire and humor.",
            "Late night talk show that focuses on political humor and commentary.",
            "A series of short comedic sketches created by the writers of Saturday Night Live.",
            "Parody musician known for writing humorous songs based on popular hits."
        ]
    },
    "Kids & Teens": {
        "names": [
            "adidas Kids",
            "Abercrombie Kids",
            "Justice",
            "American Girl",
            "Vans",
            "LEGO",
            "PacSun",
            "Justice League",
            "Aeropostale",
            "Minecraft"
        ],
        "urls": [
            "https://www.adidas.com/us/kids",
            "https://www.abercrombie.com/shop/us/kids",
            "https://www.shopjustice.com/",
            "https://www.americangirl.com/",
            "https://www.vans.com/shop/kids",
            "https://www.lego.com/en-us/themes",
            "https://www.pacsun.com/kids/",
            "https://www.dccomics.com/characters/justice-league",
            "https://www.aeropostale.com/kids-clothing/",
            "https://www.minecraft.net/en-us"
        ],
        "descs": [
            "A well-known brand for sportswear and sneakers that offers high-quality products for kids.",
            "A fashion brand for kids and teens that offers stylish and trendy clothing options.",
            "A brand that specializes in clothing, accessories, and lifestyle products for tween girls.",
            "A brand that creates dolls and accessories that reflects the diversity of today’s girls while inspiring their imagination and creativity.",
            "A popular brand among teenagers that offers skateboard-inspired footwear and apparel.",
            "A brand that offers building toys that are designed to promote creativity and imagination in kids of all ages.",
            "A brand that focuses on surf-inspired apparel and accessories for kids and teens.",
            "The iconic comic book superhero team that appeals to both kids and teens with their unique abilities and personalities.",
            "A brand that offers trendy clothing and accessories for kids and teens at affordable prices.",
            "A popular videogame that allows kids and teens to create and explore unique worlds with their own set of rules and challenges."
        ]
    },
    "Pharmacy": {
        "names": [
            "Walgreens",
            "CVS Pharmacy",
            "Rite Aid",
            "Duane Reade",
            "Wal-Mart Pharmacy",
            "Target Pharmacy",
            "Kroger Pharmacy",
            "Publix Pharmacy",
            "Good Neighbor Pharmacy",
            "Boots"
        ],
        "urls": [
            "https://www.walgreens.com/",
            "https://www.cvs.com/",
            "https://www.riteaid.com/",
            "https://www.walgreens.com/locations/storelocator.jsp",
            "https://www.walmart.com/cp/pharmacy/5431",
            "https://www.target.com/p/pharmacy/-/N-54y52",
            "https://www.kroger.com/rx/guest/home",
            "https://www.publix.com/pharmacy-wellness/pharmacy",
            "https://www.mygnp.com/",
            "https://www.boots.com/"
        ],
        "descs": [
            "One of the largest drugstore chains in the US, offering a variety of health and wellness products.",
            "Another well-known drugstore chain that sells prescription drugs, over-the-counter medications, and personal care items.",
            "A pharmacy chain that sells health and wellness products, prescription drugs, and offers immunizations and flu shots.",
            "A chain of stores primarily located in New York City that offers a range of health and wellness products and services.",
            "A pharmacy located inside of Walmart stores that offers prescription drugs, over-the-counter medications, and personal care items.",
            "A pharmacy located inside Target stores that sells prescription drugs, over-the-counter medications, and personal care items.",
            "A pharmacy chain that sells prescription drugs, over-the-counter medications, and personal care items, and offers immunizations and flu shots.",
            "A pharmacy chain that sells prescription drugs, over-the-counter medications, and personal care items, and offers immunizations and flu shots.",
            "A network of locally owned and operated pharmacies providing personalized care and services.",
            "A UK-based pharmacy chain that sells health and wellness products, prescription drugs, and personal care items."
        ]
    },
    "Food": {
        "names": [
            "Nestle",
            "Coca-Cola",
            "Kellogg's",
            "Kraft Heinz",
            "General Mills",
            "PepsiCo",
            "Unilever",
            "Hershey's",
            "McDonald's",
            "Subway"
        ],
        "urls": [
            "https://www.nestle.com/",
            "https://www.coca-cola.com/",
            "https://www.kelloggs.com",
            "https://www.kraftheinzcompany.com/",
            "https://www.generalmills.com/",
            "https://www.pepsico.com/",
            "https://www.unilever.com/",
            "https://www.hersheys.com/",
            "https://www.mcdonalds.com/",
            "https://www.subway.com/"
        ],
        "descs": [
            "A Swiss-based multinational food and beverage company that offers a wide range of products including confectionery, bottled water, baby food, coffee, dairy products, and pet food.",
            "One of the world's largest beverage companies, offering carbonated soft drinks, sports drinks, juices, and bottled water.",
            "A well-known American food company specializing in breakfast cereals, snacks, frozen foods, and vegetarian foods.",
            "An American food company that produces a range of products including condiments, cheese, frozen food, and meals.",
            "An American manufacturer and marketer of branded consumer foods, including breakfast cereals, snacks, and yogurt.",
            "An American multinational food and beverage company, offering a wide range of products including soft drinks, sports drinks, snacks, and breakfast foods.",
            "A British-Dutch transnational company that produces a wide range of food, beverages, and consumer goods, including ice cream, tea, and margarine.",
            "A leading American chocolate and confectionery company, known for its chocolate bars, candies, and baking products.",
            "A well-known American fast-food chain that specializes in burgers, fries, and other American-style fast food.",
            "A global fast-food chain that offers made-to-order sandwiches and salads."
        ]
    },
    "General Reference": {
        "names": [
            "Encyclopedia Britannica",
            "Merriam-Webster Dictionary",
            "Oxford English Dictionary",
            "World Book Online",
            "Almanac.com",
            "Library of Congress",
            "The CIA World Factbook",
            "Bartleby.com",
            "The Chicago Manual of Style",
            "Encyclopedia of Life"
        ],
        "urls": [
            "https://www.britannica.com/",
            "https://www.merriam-webster.com/",
            "https://www.oed.com/",
            "https://www.worldbookonline.com/",
            "https://www.almanac.com/",
            "https://www.loc.gov/",
            "https://www.cia.gov/the-world-factbook/",
            "https://www.bartleby.com/",
            "https://www.chicagomanualofstyle.org/",
            "https://eol.org/"
        ],
        "descs": [
            "A well-known and trusted source of general knowledge and information, with articles written by experts in their fields.",
            "One of the most widely used and respected dictionaries, offering definitions, pronunciations, and examples of word usage.",
            "Another highly respected dictionary, with detailed etymologies and historical usage of words in the English language.",
            "A comprehensive online encyclopedia that covers a wide range of topics, with articles written at different reading levels to cater to various age groups.",
            "An annual publication containing a wealth of information on various topics, including calendars, weather, astronomy, gardening, cooking, and more.",
            "The largest library in the world, with a vast collection of books, manuscripts, and other resources spanning various disciplines.",
            "An extensive reference resource that provides information on various countries, including their geography, people, government, economy, and more.",
            "A collection of online books and reference works, including thesauruses, quotation guides, and even classic literature.",
            "A widely used style guide for writing and publishing, with detailed guidelines on grammar, punctuation, citations, and more.",
            "A collaborative online encyclopedia that aspires to document all living species on Earth, with detailed information on their taxonomy, characteristics, habitat, and distribution."
        ]
    },
    "Public Safety": {
        "names": [
            "ADT",
            "First Alert",
            "Motorola Solutions",
            "Whelen Engineering",
            "5.11 Tactical",
            "TASER International",
            "Smith & Wesson",
            "Bodyguardz",
            "Armor Express",
            "Pelican Products"
        ],
        "urls": [
            "https://www.adt.com/",
            "https://www.firstalert.com/",
            "https://www.motorolasolutions.com/en_us.html",
            "https://www.whelen.com/",
            "https://www.511tactical.com/",
            "https://taser.com/",
            "https://www.smith-wesson.com/",
            "https://www.bodyguardz.com/",
            "https://www.armorexpress.com/",
            "https://www.pelican.com/us/en/"
        ],
        "descs": [
            "Provides home and business security monitoring systems.",
            "Manufacturer of smoke alarms, carbon monoxide detectors, and home safety products.",
            "Offers communication systems and devices for public safety and emergency response.",
            "Produces warning lights and sirens for police, fire, and emergency vehicles.",
            "Famous for their clothing designed for law enforcement, military, and public safety professionals.",
            "Known for their conducted electrical weapons (CEWs) that are often used by police forces around the world.",
            "Manufacturer of firearms widely used by law enforcement and military personnel.",
            "Provides personal device protection and security solutions, including phone cases with built-in pepper spray.",
            "Produces body armor and tactical gear designed for law enforcement and military personnel.",
            "Creates durable protective cases and lighting systems used by law enforcement, emergency services, and military."
        ]
    },
    "Events & Listings": {
        "names": [
            "Eventbrite",
            "Meetup",
            "Bandsintown",
            "AllEvents.in",
            "DoStuff",
            "Goldstar",
            "Citysearch",
            "Time Out",
            "Eventful",
            "SeatGeek"
        ],
        "urls": [
            "https://www.eventbrite.com/",
            "https://www.meetup.com/",
            "https://www.bandsintown.com/",
            "https://allevents.in/",
            "https://dostuffmedia.com/",
            "https://www.goldstar.com/",
            "https://www.citysearch.com/",
            "https://www.timeout.com/",
            "https://www.eventful.com/",
            "https://seatgeek.com/"
        ],
        "descs": [
            "An online platform for organizing and registering for events of all kinds.",
            "An online platform for creating and joining groups that organize events and activities based on shared interests.",
            "A platform for discovering and tracking live music events and concerts near you.",
            "An event listing platform that covers everything from concerts and festivals to sports and business events.",
            "A media company that creates and promotes event listings and guides across a variety of cities in North America.",
            "A ticketing and event discovery platform that offers tickets to events, activities, and experiences at a discounted price.",
            "A comprehensive city guide that includes listings for events, restaurants, shopping, and more.",
            "A global media company that provides event listings, recommendations, and news in cities around the world.",
            "A platform for finding and promoting local events and activities, including concerts, festivals, and sports events.",
            "A platform for buying and selling tickets to live events, including concerts, sports games, and theater performances."
        ]
    },
    "Computer Security": {
        "names": [
            "Norton",
            "Kaspersky",
            "McAfee",
            "Bitdefender",
            "Malwarebytes",
            "Avast",
            "Trend Micro",
            "NortonLifeLock",
            "ESET",
            "F-Secure"
        ],
        "urls": [
            "https://us.norton.com/",
            "https://www.kaspersky.com/",
            "https://www.mcafee.com/",
            "https://www.bitdefender.com/",
            "https://www.malwarebytes.com/",
            "https://www.avast.com/",
            "https://www.trendmicro.com/en_us/business.html",
            "https://www.nortonlifelock.com/",
            "https://www.eset.com/us/",
            "https://www.f-secure.com/en"
        ],
        "descs": [
            "Offers antivirus and malware protection as well as online privacy solutions for all types of devices.",
            "Provides cybersecurity solutions for both personal and business users.",
            "Offers cybersecurity solutions such as antivirus, identity theft protection, and secure VPN.",
            "Provides antivirus and anti-malware protection for all types of devices.",
            "Offers both free and paid cybersecurity solutions including antivirus, anti-malware, and anti-exploit software.",
            "Provides both free and paid antivirus solutions as well as VPN and password management software.",
            "Offers cybersecurity solutions for both personal and business users including antivirus and anti-malware software.",
            "Offers comprehensive cybersecurity solutions including antivirus, VPN, and identity theft protection.",
            "Provides antivirus, anti-malware, and firewall solutions for both personal and business users.",
            "Offers antivirus and security solutions for all types of devices, including IoT and home networks."
        ]
    },
    "Family & Relationships": {
        "names": [
            "AncestryDNA",
            "23andMe",
            "The Five Love Languages by Gary Chapman",
            "365 Gathered Truths",
            "Chatbooks",
            "Lovevery",
            "Plum Print",
            "Parenting by Connection",
            "The Gottman Institute",
            "Uncommon Goods"
        ],
        "urls": [
            "https://www.ancestry.com/dna/",
            "https://www.23andme.com/",
            "https://www.5lovelanguages.com/",
            "https://www.365gatheredtruths.com/",
            "https://chatbooks.com/",
            "https://lovevery.com/",
            "https://www.plumprint.com/",
            "https://www.handinhandparenting.org/",
            "https://www.gottman.com/",
            "https://www.uncommongoods.com/gifts/family-gifts"
        ],
        "descs": [
            "This service provides DNA testing to help users discover their family history and connect with their relatives.",
            "Another DNA testing service that can help users understand their ancestry, inherited traits, and potential health risks.",
            "This book and accompanying assessment help individuals and couples understand how they give and receive love in relationships.",
            "A journal that prompts users to write down one truth about their family every day for a year, encouraging reflection and appreciation.",
            "This app allows users to easily create photo books of their family memories, making it easy to share and relive special moments.",
            "An online store that offers playthings and educational materials for children from newborn to 4 years old, with a focus on promoting positive development.",
            "This service turns children's artwork into high-quality custom books and digital files that can be cherished for years.",
            "An approach to parenting that emphasizes empathetic listening, positive attention, and play in building strong relationships with children.",
            "An organization dedicated to researching and promoting healthy relationships, with resources for couples and families to improve communication and deepen connections.",
            "A website that offers unique and thoughtful gifts for family members, from personalized jewelry to board games that bring the whole family together."
        ]
    },
    "Programming": {
        "names": [
            "JetBrains",
            "Visual Studio Code",
            "GitHub",
            "Python",
            "Stack Overflow",
            "Mozilla Developer Network",
            "Codecademy",
            "Xcode",
            "Ruby on Rails",
            "IntelliJ IDEA"
        ],
        "urls": [
            "https://www.jetbrains.com/",
            "https://code.visualstudio.com/",
            "https://github.com/",
            "https://www.python.org/",
            "https://stackoverflow.com/",
            "https://developer.mozilla.org/",
            "https://www.codecademy.com/",
            "https://developer.apple.com/xcode/",
            "https://rubyonrails.org/",
            "https://www.jetbrains.com/idea/"
        ],
        "descs": [
            "A suite of software development tools for Java, Kotlin, JavaScript, PHP, Python, Ruby, Swift, and more.",
            "A free, open-source code editor with support for multiple programming languages and extensive customization options.",
            "A web-based hosting service for version control and collaboration in software development projects.",
            "A high-level, general-purpose programming language known for its readability and simplicity.",
            "A question and answer website for programmers to solve problems and learn from one another.",
            "A community of developers who create open web technologies and resources to help others build for the web.",
            "An online learning platform that offers interactive coding courses and projects for various programming languages.",
            "An integrated development environment exclusively for macOS and iOS app development.",
            "A web application framework written in the Ruby programming language.",
            "A Java integrated development environment with advanced coding assistance and productivity features."
        ]
    },
    "Jobs": {
        "names": [
            "LinkedIn",
            "Glassdoor",
            "Indeed",
            "Monster",
            "FlexJobs",
            "ZipRecruiter",
            "LinkedIn Learning",
            "Upwork",
            "Fiverr",
            "Freelancer"
        ],
        "urls": [
            "https://www.linkedin.com/",
            "https://www.glassdoor.com/index.htm",
            "https://www.indeed.com/",
            "https://www.monster.com/",
            "https://www.flexjobs.com/",
            "https://www.ziprecruiter.com/",
            "https://www.linkedin.com/learning/",
            "https://www.upwork.com/",
            "https://www.fiverr.com/",
            "https://www.freelancer.com/"
        ],
        "descs": [
            "A social networking site that focuses on professional networking and job search",
            "A website providing company reviews, salary reports, and job listings",
            "A comprehensive job search website that aggregates job listings from various sources",
            "A global online employment solution that connects people with job opportunities",
            "A service that specializes in remote, flexible, and freelance job opportunities",
            "A job posting platform that uses AI matching technology to connect job seekers and employers",
            "A platform that provides online courses and tutorials to help individuals upgrade their skills",
            "A freelance job platform that connects businesses and talent from around the world",
            "A marketplace that offers freelance services in various categories such as design, writing, and digital marketing",
            "A global crowdsourcing marketplace that allows businesses and individuals to outsource work to freelancers."
        ]
    },
    "Beverages": {
        "names": [
            "Coca-Cola",
            "Starbucks",
            "PepsiCo",
            "Red Bull",
            "Nestle Waters",
            "Ocean Spray",
            "Coca-Cola Zero Sugar",
            "Tazo Tea",
            "Vita Coco",
            "Honest Tea"
        ],
        "urls": [
            "https://www.coca-cola.com/",
            "https://www.starbucks.com/",
            "https://www.pepsico.com/",
            "https://www.redbull.com/int-en/",
            "https://www.nestle-waters.com/",
            "https://www.oceanspray.com/",
            "https://www.coca-cola.com/gb/en/news/coca-cola-zero-sugar-what-you-need-to-know",
            "https://www.tazo.com/",
            "https://www.vitacoco.com/",
            "https://www.honesttea.com/"
        ],
        "descs": [
            "A carbonated soft drink that has been a popular beverage brand for over 100 years.",
            "A coffeehouse chain that is known for its signature coffee blends, hot and cold caffeinated and non-caffeinated drinks, and pastries.",
            "A beverage and snack company, known for its Pepsi soft drink, but also produces a variety of other non-alcoholic beverages such as Gatorade, Tropicana, and Aquafina.",
            "An energy drink that is popular among athletes, students, and professionals who need a quick energy boost. ",
            "A brand that produces different bottled waters such as Perrier, Nestle Pure Life, and Poland Spring.",
            "A brand that specializes in producing cranberry-based drinks such as cranberry juice and cranberry juice blends.",
            "A low-calorie version of Coca-Cola that has the same taste as the original recipe.",
            "A brand that offers a wide variety of teas such as green tea, black tea, and herbal tea.",
            "A brand that produces coconut water and coconut milk, which is a refreshing beverage for health-conscious consumers. ",
            "A brand that offers a variety of organic tea, juice, and lemonade options that are made with natural and organic ingredients."
        ]
    },
    "Substance Abuse": {
        "names": [
            "SAMHSA (Substance Abuse and Mental Health Services Administration)",
            "Narcotics Anonymous",
            "Alcoholics Anonymous",
            "Methadone",
            "Suboxone",
            "Narcan",
            "SMART Recovery",
            "Al-Anon",
            "The Partnership for Drug-Free Kids",
            "Addiction Center"
        ],
        "urls": [
            "https://www.samhsa.gov/",
            "https://www.na.org/",
            "https://www.aa.org/",
            "https://www.samhsa.gov/medication-assisted-treatment/treatment/methadone",
            "https://www.suboxone.com/",
            "https://www.narcan.com/",
            "https://www.smartrecovery.org/",
            "https://al-anon.org/",
            "https://drugfree.org/",
            "https://www.addictioncenter.com/"
        ],
        "descs": [
            "A government agency that provides resources and support for individuals struggling with substance abuse disorders.",
            "A non-profit organization that offers support and meetings for individuals recovering from drug addiction.",
            "Another non-profit organization that provides support and resources for individuals struggling with alcohol addiction.",
            "A medication used in medication-assisted treatment for opioid addiction.",
            "Another medication used in medication-assisted treatment for opioid addiction.",
            "An emergency medication used to reverse opioid overdose.",
            "A non-profit organization that provides support and resources for individuals struggling with addiction that do not follow traditional 12-step programs.",
            "A support group for the family and friends of individuals struggling with alcohol addiction.",
            "A non-profit organization that aims to prevent substance abuse and addiction through education and advocating for policy change.",
            "An online resource that provides information and resources for individuals and families struggling with addiction."
        ]
    },
    "Dating & Personals": {
        "names": [
            "OkCupid",
            "eHarmony",
            "Tinder",
            "Bumble",
            "SingleParentMeet",
            "Match.com",
            "Grindr",
            "HER",
            "Hinge",
            "Zoosk"
        ],
        "urls": [
            "https://www.okcupid.com/",
            "https://www.eharmony.com/",
            "https://tinder.com/",
            "https://bumble.com/",
            "https://www.singleparentmeet.com/",
            "https://www.match.com/",
            "https://www.grindr.com/",
            "https://weareher.com/",
            "https://hinge.co/",
            "https://www.zoosk.com/"
        ],
        "descs": [
            "A popular dating app that has a unique matching algorithm and in-depth user profiles.",
            "A dating site that uses a compatibility matching system to match users based on their personalities and values.",
            "A widely-used dating app that allows users to swipe through profiles and connect with matches.",
            "A dating app where women make the first move and initiate conversations with potential matches.",
            "A dating site specifically designed for single parents to connect with one another.",
            "One of the oldest and most well-known dating sites, with a large and diverse user base.",
            "A popular dating app for gay, bisexual, and queer men, with geolocation features and a chat function.",
            "A dating app specifically for lesbian, bisexual, and queer women, with a social networking component and events.",
            "A dating app that focuses on building real connections between users, with a more detailed profile set-up than other apps.",
            "A dating app with a behavioral matchmaking system that learns from users' actions and preferences."
        ]
    },
    "Education": {
        "names": [
            "Coursera",
            "Khan Academy",
            "Udemy",
            "edX",
            "Duolingo",
            "Rosetta Stone",
            "Scholastic",
            "Quizlet",
            "TED-Ed",
            "Crash Course"
        ],
        "urls": [
            "https://www.coursera.org/",
            "https://www.khanacademy.org/",
            "https://www.udemy.com/",
            "https://www.edx.org/",
            "https://www.duolingo.com/",
            "https://www.rosettastone.com/",
            "https://www.scholastic.com/home/",
            "https://quizlet.com/",
            "https://ed.ted.com/",
            "https://www.youtube.com/user/crashcourse"
        ],
        "descs": [
            "An online learning platform that offers courses from top universities and organizations worldwide.",
            "A non-profit organization that provides free educational resources and interactive online courses.",
            "An e-learning platform that offers a vast range of online courses in various disciplines at affordable rates.",
            "A massive open online course provider founded by Harvard and MIT, offering free online courses from top universities and cultural institutions.",
            "A language-learning platform that gamifies the learning process and offers courses in over 30 languages.",
            "A language-learning software that uses an immersive approach to help learners master a new language.",
            "An educational publishing company that produces books, magazines, and instructional materials for children and educators.",
            "An app and website that provides free study tools, including flashcards, games, and practice tests, for students.",
            "An online education platform that offers engaging video lessons from educators and animators around the world.",
            "A YouTube channel that produces entertaining and educational video series on various topics, including history, science, and literature."
        ]
    },
    "Nutrition": {
        "names": [
            "Quest Nutrition",
            "MyFitnessPal",
            "RXBAR",
            "Vitamix",
            "Green Chef",
            "KIND Snacks",
            "Kashi",
            "Garden of Life",
            "Halo Top",
            "Thrive Market"
        ],
        "urls": [
            "https://www.questnutrition.com/",
            "https://www.myfitnesspal.com/",
            "https://www.rxbar.com/",
            "https://www.vitamix.com/",
            "https://www.greenchef.com/",
            "https://www.kindsnacks.com/",
            "https://www.kashi.com/",
            "https://www.gardenoflife.com/",
            "https://www.halotop.com/",
            "https://thrivemarket.com/"
        ],
        "descs": [
            "A brand that offers protein bars, protein chips, and protein powders made with high-quality ingredients.",
            "A free app that allows users to track their food intake and monitor their calorie and nutrient intake.",
            "A clean-label protein bar brand that only uses a handful of simple ingredients.",
            "A high-powered blender brand that allows users to make healthy smoothies, soups, and more.",
            "A meal delivery service that offers organic and sustainable ingredients and caters to various dietary needs and preferences.",
            "A snack brand that offers bars and granola made with simple, whole ingredients such as nuts, seeds, and fruits.",
            "A brand that offers cereals, granolas, and snack bars made with whole grains and other healthy ingredients.",
            "A brand that offers organic and non-GMO whole food supplements and protein powders.",
            "A low-calorie ice cream brand that offers a healthier alternative to traditional ice cream.",
            "An online marketplace that offers a wide selection of natural and organic products, including food and supplements, at competitive prices."
        ]
    },
    "Metals & Mining": {
        "names": [
            "Rio Tinto",
            "BHP",
            "Vale",
            "Freeport-McMoRan",
            "Barrick Gold Corporation",
            "Anglo American",
            "Newmont Corporation",
            "Glencore",
            "Alcoa",
            "Southern Copper"
        ],
        "urls": [
            "https://www.riotinto.com/",
            "https://www.bhp.com/",
            "https://www.vale.com/en",
            "https://www.fcx.com/",
            "https://www.barrick.com/",
            "https://www.angloamerican.com/",
            "https://www.newmont.com/home/default.aspx",
            "https://www.glencore.com/",
            "https://www.alcoa.com/global/en/home.asp",
            "https://www.southerncoppercorp.com/"
        ],
        "descs": [
            "A global mining and metals company with operations in multiple countries, specializing in aluminum, copper, diamonds, gold, and iron ore.",
            "An Australian-headquartered company that focuses on copper, iron ore, coal, and petroleum, with operations in multiple countries.",
            "A Brazilian mining company that produces iron ore, nickel, copper, coal, and fertilizer, with operations in North and South America, Europe, and Asia.",
            "A US-based company that specializes in copper, gold, and molybdenum, with operations in North and South America, Indonesia, and Africa.",
            "A Canadian company that is the world's largest gold mining company, with operations in North and South America, Africa, and the Middle East.",
            "A UK-based company that focuses on diamonds, copper, platinum group metals, iron ore, and coal, with operations in multiple countries.",
            "A US-based company that specializes in gold mining, with operations in North and South America, Australia, and Africa.",
            "A Swiss-based company that is one of the world's largest producers and traders of commodities, including copper, cobalt, nickel, zinc, and iron ore.",
            "A US company that specializes in aluminum production, with operations in North and South America, Europe, and Australia.",
            "A US-based company that focuses on copper production, with operations in Peru and Mexico."
        ]
    },
    "Web Services": {
        "names": [
            "Amazon Web Services (AWS)",
            "Microsoft Azure",
            "Google Cloud Platform",
            "Salesforce",
            "HubSpot",
            "Stripe",
            "Dropbox",
            "Twilio",
            "SendGrid",
            "Zoom"
        ],
        "urls": [
            "https://aws.amazon.com/",
            "https://azure.microsoft.com/",
            "https://cloud.google.com/",
            "https://www.salesforce.com/",
            "https://www.hubspot.com/",
            "https://stripe.com/",
            "https://www.dropbox.com/",
            "https://www.twilio.com/",
            "https://sendgrid.com/",
            "https://zoom.us/"
        ],
        "descs": [
            "A popular cloud computing platform that offers a wide range of services to help businesses scale their operations and host their applications.",
            "A cloud computing platform that offers various services such as computing, analytics, storage, and networking for businesses of all sizes.",
            "A cloud computing platform that offers a wide range of services like virtual machines, data storage, networking, and machine learning tools.",
            "A customer relationship management (CRM) platform that provides solutions for marketing, sales, commerce, and customer service.",
            "A marketing and sales platform that provides inbound marketing tools, CRM, and marketing automation solutions for businesses.",
            "A payment processing platform that offers various services like payment gateway, fraud detection, and subscription billing solutions for businesses of all sizes.",
            "A file hosting service that allows users to store, share, and collaborate on files across different devices.",
            "A cloud communications platform that provides APIs for businesses to build messaging, voice, and video application solutions.",
            "An email delivery and management platform that provides tools for businesses to send and track transactional and marketing emails.",
            "A video conferencing and online meeting platform that allows businesses to communicate and collaborate with remote teams and clients."
        ]
    },
    "Photo & Video Sharing": {
        "names": [
            "Instagram",
            "Snapchat",
            "TikTok",
            "Flickr",
            "Google Photos",
            "Dropbox",
            "Vimeo",
            "YouTube",
            "Imgur",
            "VSCO"
        ],
        "urls": [
            "https://www.instagram.com/",
            "https://www.snapchat.com/",
            "https://www.tiktok.com/",
            "https://www.flickr.com/",
            "https://www.google.com/photos/",
            "https://www.dropbox.com/",
            "https://vimeo.com/",
            "https://www.youtube.com/",
            "https://imgur.com/",
            "https://vsco.co/"
        ],
        "descs": [
            "A social media platform for photo and video sharing.",
            "A multimedia messaging app for sharing photos and videos.",
            "A social media platform for short-form mobile videos.",
            "A popular photo sharing website and online community.",
            "A photo and video sharing service by Google that allows users to back up and share their photos and videos.",
            "A file hosting service that allows users to store and share their files, including photos and videos.",
            "A video sharing website for professionals and creatives.",
            "The world's largest video sharing platform owned by Google.",
            "An online image hosting and sharing community.",
            "A photo editing and sharing platform for creatives."
        ]
    },
    "Entertainment Industry": {
        "names": [
            "Netflix",
            "Disney+",
            "Spotify",
            "HBO Max",
            "Amazon Prime Video",
            "YouTube",
            "Apple TV+",
            "TikTok",
            "Hulu",
            "ESPN+"
        ],
        "urls": [
            "https://www.netflix.com/",
            "https://www.disneyplus.com/",
            "https://www.spotify.com/",
            "https://www.hbomax.com/",
            "https://www.amazon.com/Prime-Video",
            "https://www.youtube.com/",
            "https://www.apple.com/apple-tv-plus/",
            "https://www.tiktok.com/",
            "https://www.hulu.com/",
            "https://www.espn.com/watch/"
        ],
        "descs": [
            "A popular streaming service that provides a wide range of movies, TV shows and documentaries.",
            "An on-demand streaming service that offers exclusive access to Disney, Pixar, Marvel, Star Wars, and National Geographic content.",
            "A music streaming service with millions of songs, playlists, and podcasts.",
            "A subscription-based streaming service that offers a vast library of TV shows, movies, and documentaries.",
            "A streaming service that provides movies, TV shows, and original content to Amazon Prime members.",
            "A popular video-sharing platform that offers an immense collection of user-generated and professional video content.",
            "A streaming service with an exclusive lineup of original TV shows, movies, and documentaries.",
            "A social media platform that's focused on short-form videos that are often comedic and entertaining.",
            "A subscription-based streaming service that offers an extensive catalog of movies, TV shows, and original content.",
            "A subscription-based streaming service that provides live sports, exclusive documentaries, and original shows."
        ]
    },
    "Software": {
        "names": [
            "Microsoft Office 365",
            "Adobe Creative Cloud",
            "Slack",
            "Zoom",
            "Salesforce",
            "GitHub",
            "Atlassian Jira",
            "AWS",
            "Oracle",
            "Google Workspace"
        ],
        "urls": [
            "https://www.microsoft.com/en-us/microsoft-365",
            "https://www.adobe.com/creativecloud.html",
            "https://slack.com/",
            "https://zoom.us/",
            "https://www.salesforce.com/",
            "https://github.com/",
            "https://www.atlassian.com/software/jira",
            "https://aws.amazon.com/",
            "https://www.oracle.com/",
            "https://workspace.google.com/"
        ],
        "descs": [
            "A popular software suite that includes applications like Word, Excel, PowerPoint, and OneNote for productivity and collaboration.",
            "A collection of creative applications like Photoshop, Illustrator, and Premiere Pro for graphic design, video editing, and more.",
            "A messaging and collaboration platform for teams that integrates with many other productivity apps.",
            "A video conferencing tool that allows for online meetings, webinars, and virtual events.",
            "A cloud-based software platform for customer relationship management and enterprise resource planning.",
            "A web-based hosting service for version control and collaboration on software development projects.",
            "A project management tool for software development teams that includes agile planning and issue tracking.",
            "Amazon Web Services is a cloud-based platform for businesses to host and manage their applications and infrastructure.",
            "A provider of enterprise software and cloud solutions for businesses in a variety of industries.",
            "A suite of online tools from Google for productivity and collaboration, including tools like Gmail, Google Drive, and Google Docs."
        ]
    },
    "Vision Care": {
        "names": [
            "Warby Parker",
            "Zenni Optical",
            "LensCrafters",
            "Ray-Ban",
            "Oakley",
            "Acuvue",
            "Alcon",
            "Bausch + Lomb",
            "Proclear",
            "CooperVision"
        ],
        "urls": [
            "https://www.warbyparker.com/",
            "https://www.zennioptical.com/",
            "https://www.lenscrafters.com/",
            "https://www.ray-ban.com/usa",
            "https://www.oakley.com/",
            "https://www.acuvue.com/",
            "https://www.alcon.com/",
            "https://www.bausch.com/",
            "https://www.proclear.com/",
            "https://coopervision.com/"
        ],
        "descs": [
            "An eyewear brand that offers affordable and stylish prescription glasses and sunglasses.",
            "An online eyewear retailer that offers affordable prescription glasses and sunglasses.",
            "A popular eyewear chain that offers prescription glasses, sunglasses, and contact lenses.",
            "A well-known brand that offers stylish and high-quality sunglasses.",
            "A sporty eyewear brand that offers sunglasses and prescription glasses.",
            "A popular brand of contact lenses.",
            "A global leader in vision care, offering products such as contact lenses and eye drops.",
            "A leading eye health company that offers contact lenses, eye drops, and eye vitamins.",
            "A brand of contact lenses known for their comfortable fit and moisture-retaining technology.",
            "A leading manufacturer of contact lenses for various eye conditions."
        ]
    },
    "Humanities": {
        "names": [
            "The Metropolitan Museum of Art",
            "The Folger Shakespeare Library",
            "The Getty",
            "The Center for Hellenic Studies",
            "The British Museum",
            "The Smithsonian Institution",
            "The Library of Congress",
            "The National Endowment for the Humanities",
            "The American Council of Learned Societies",
            "The New York Public Library"
        ],
        "urls": [
            "https://www.metmuseum.org/",
            "https://www.folger.edu/",
            "https://www.getty.edu/",
            "https://chs.harvard.edu/",
            "https://www.britishmuseum.org/",
            "https://www.si.edu/",
            "https://www.loc.gov/",
            "https://www.neh.gov/",
            "https://acls.org/",
            "https://www.nypl.org/"
        ],
        "descs": [
            "A world-renowned art museum located in New York City, showcasing art from around the world throughout history.",
            "A research library in Washington, D.C. that focuses on Shakespeare and his contemporaries, as well as fostering the humanities.",
            "A cultural institution located in Los Angeles that houses a large collection of art, as well as promotes the study of the humanities.",
            "A research institute at Harvard University that focuses on the humanities related to ancient Greece and Rome.",
            "A museum located in London that houses a huge collection of art and artifacts from around the world, with a focus on the history and cultures of human civilization.",
            "A group of museums and research centers in Washington, D.C. that cover various fields of study, including anthropology, history, and art.",
            "The largest library in the world, located in Washington, D.C., that contains over 160 million items, including books, manuscripts, recordings, and more, covering a wide range of humanities topics.",
            "A grant-making government agency in the United States that provides support for research, education, and preservation in the humanities.",
            "A non-profit organization that promotes scholarship in the humanities and social sciences, offering fellowships and grants to researchers and supporting various humanities-oriented projects.",
            "A library system in New York City that offers access to countless documents and materials related to the humanities, as well as hosting events and exhibitions related to various humanities topics."
        ]
    },
    "Hotels & Accommodations": {
        "names": [
            "Hilton Hotels & Resorts",
            "Airbnb",
            "Marriott Hotels & Resorts",
            "Four Seasons Hotels and Resorts",
            "Booking.com",
            "Hyatt Hotels Corporation",
            "InterContinental Hotels Group",
            "Ritz-Carlton",
            "Expedia",
            "W Hotels"
        ],
        "urls": [
            "https://www.hilton.com/",
            "https://www.airbnb.com/",
            "https://www.marriott.com/",
            "https://www.fourseasons.com/",
            "https://www.booking.com/",
            "https://www.hyatt.com/",
            "https://www.ihg.com/",
            "https://www.ritzcarlton.com/",
            "https://www.expedia.com/",
            "https://www.marriott.com/w-hotels/travel.mi"
        ],
        "descs": [
            "A well-known hotel chain that offers luxury accommodations in over 100 countries worldwide.",
            "An online platform that allows people to rent out their homes or apartments, providing a unique and personalized travel experience.",
            "A global hotel chain that offers a variety of accommodations from high-end luxury to value-based hotels.",
            "A luxury hotel brand that offers first-class accommodations and world-class service in over 100 locations worldwide.",
            "An online travel agency that provides users with access to a wide range of accommodations, including hotels, apartments, and vacation homes.",
            "A global hospitality company that offers premium accommodations in over 60 countries worldwide.",
            "A multinational hotel company that operates over 7,000 hotels and resorts in 31 countries worldwide.",
            "A luxury hotel chain that offers exceptional service, world-class amenities, and elegant accommodations in prestigious locations worldwide.",
            "An online travel agency that provides users with access to a wide range of accommodations, as well as flights and car rentals, all in one place.",
            "A modern, luxury hotel brand that offers vibrant, design-focused accommodations in stylish urban destinations worldwide."
        ]
    },
    "International Sports Competitions": {
        "names": [
            "Olympics",
            "FIFA World Cup",
            "Wimbledon",
            "Tour de France",
            "Rugby World Cup",
            "Commonwealth Games",
            "UEFA Champions League",
            "Formula 1",
            "World Athletics Championships",
            "Asian Games"
        ],
        "urls": [
            "https://olympics.com/",
            "https://www.fifa.com/worldcup/",
            "https://www.wimbledon.com/",
            "https://www.letour.fr/en/",
            "https://www.rugbyworldcup.com/",
            "https://thecgf.com/games",
            "https://www.uefa.com/uefachampionsleague/",
            "https://www.formula1.com/",
            "https://www.worldathletics.org/competitions/world-athletics-championships",
            "https://en.asiangames2018.id/"
        ],
        "descs": [
            "The most prestigious international sports competition featuring Summer and Winter Games held every four years.",
            "The world's biggest football tournament held every four years featuring national teams from around the world.",
            "One of the four Grand Slam tennis tournaments and the oldest tennis tournament in the world held annually in London.",
            "An annual cycling race held in France that spans over three weeks and covers more than 3,500 kilometers.",
            "A rugby union tournament held every four years featuring national teams from around the world.",
            "A multi-sport event featuring athletes from the Commonwealth Nations held every four years.",
            "A club football tournament featuring the best teams from European leagues.",
            "The highest class of international auto racing involving teams from around the world competing in highly specialized cars.",
            "A biennial athletics event sanctioned by World Athletics, featuring athletes from around the world.",
            "A multi-sport event featuring athletes from Asia held every four years."
        ]
    },
    "Insurance": {
        "names": [
            "GEICO",
            "Allstate",
            "Progressive",
            "State Farm",
            "Nationwide",
            "USAA",
            "Farmers Insurance",
            "Travelers",
            "Liberty Mutual",
            "Esurance"
        ],
        "urls": [
            "https://www.geico.com/",
            "https://www.allstate.com/",
            "https://www.progressive.com/",
            "https://www.statefarm.com/",
            "https://www.nationwide.com/",
            "https://www.usaa.com/",
            "https://www.farmers.com/",
            "https://www.travelers.com/",
            "https://www.libertymutual.com/",
            "https://www.esurance.com/"
        ],
        "descs": [
            "One of the largest car insurance companies with a wide range of coverage options.",
            "Offers various types of insurance, including car, home, and life insurance.",
            "Another well-known car insurance company with competitive rates.",
            "Offers a variety of insurance types, including auto, home, and life insurance.",
            "Provides auto, homeowners, and life insurance as well as pet insurance.",
            "Serves military members, veterans, and their families with various insurance products.",
            "Provides insurance for homes, autos, and businesses.",
            "Offers a range of insurance products including auto, home, and business insurance.",
            "Offers auto, home, renters, and life insurance products.",
            "Provides car insurance coverage with a focus on online convenience and easy claims processing."
        ]
    },
    "Animal Products & Services": {
        "names": [
            "Purina",
            "Petco",
            "Chewy",
            "Hill's Science Diet",
            "Banfield Pet Hospital",
            "RedBarn Pet Products",
            "Blue Buffalo",
            "Trupanion",
            "PetSmart",
            "Whistle"
        ],
        "urls": [
            "https://www.purina.com/",
            "https://www.petco.com/",
            "https://www.chewy.com/",
            "https://www.hillspet.com/science-diet",
            "https://www.banfield.com/",
            "http://www.redbarninc.com/",
            "https://bluebuffalo.com/",
            "https://trupanion.com/",
            "https://www.petsmart.com/",
            "https://www.whistle.com/"
        ],
        "descs": [
            "A well-known brand that offers a diverse range of pet food and nutrition products for dogs, cats, and other animals.",
            "A retailer that specializes in pet products such as food, toys, grooming supplies, and more.",
            "An online retailer that offers a wide selection of pet supplies and products, including food, treats, toys, and medications.",
            "A brand of high-quality pet foods and diets that cater to the specific health needs of cats and dogs.",
            "A chain of pet hospitals that provide veterinary care services, including routine checkups, vaccinations, and more.",
            "A manufacturer of natural pet products such as treats, chews, and food made from high-quality ingredients.",
            "A brand that provides high-quality pet food and nutrition solutions for dogs and cats, including specialty diets for certain health conditions.",
            "A pet insurance provider that offers coverage for veterinary treatments, surgeries, and more.",
            "A large retailer that offers pet products, services, and grooming for dogs, cats, and other animals.",
            "A brand that offers pet tracking and monitoring devices that help pet owners keep track of their pets' location and activity levels."
        ]
    },
    "Comics & Animation": {
        "names": [
            "Marvel Comics",
            "DC Comics",
            "Image Comics",
            "Studio Ghibli",
            "The Walt Disney Company",
            "Cartoon Network",
            "Nickelodeon",
            "Dragon Ball",
            "Rick and Morty",
            "Adventure Time"
        ],
        "urls": [
            "https://www.marvel.com/",
            "https://www.dccomics.com/",
            "https://imagecomics.com/",
            "https://www.ghibli.jp/",
            "https://www.disney.com/",
            "https://www.cartoonnetwork.com/",
            "https://www.nick.com/",
            "https://www.dragonball.com/",
            "https://www.adultswim.com/videos/rick-and-morty/",
            "https://www.cartoonnetwork.com/shows/adventure-time"
        ],
        "descs": [
            "One of the largest comic book publishers in the world known for its popular characters like Spider-Man, Iron Man, and the Avengers.",
            "Comics publisher also known for its popular characters like Batman, Superman, and Wonder Woman.",
            "Another major comic book publisher that produces popular titles such as The Walking Dead, Saga, and Spawn.",
            "A Japanese animation studio famous for producing critically acclaimed and beloved films like Spirited Away and My Neighbor Totoro.",
            "A media giant that produces beloved animated films and TV shows like The Lion King and Toy Story.",
            "A popular TV network that produces a range of animated shows, from children's programming to adult-oriented shows like Rick and Morty.",
            "Another popular TV network that produces animated shows and has become known for classics like SpongeBob Squarepants and Rugrats.",
            "A long-running anime and manga series that has become an international phenomenon.",
            "An animated TV show that has become a cultural phenomenon, known for its dark humor and sci-fi absurdity.",
            "An animated TV show that gained a massive following for its unique fantasy world, quirky characters, and poignant storytelling."
        ]
    },
    "Home Improvement": {
        "names": [
            "Home Depot",
            "Lowe's",
            "Behr",
            "Sherwin-Williams",
            "Armstrong Flooring",
            "Delta",
            "Whirlpool",
            "DeWalt",
            "DAP",
            "Pella"
        ],
        "urls": [
            "https://www.homedepot.com/",
            "https://www.lowes.com/",
            "https://www.behr.com/",
            "https://www.sherwin-williams.com/",
            "https://www.armstrongflooring.com/",
            "https://www.deltafaucet.com/",
            "https://www.whirlpool.com/",
            "https://www.dewalt.com/",
            "https://www.dap.com/",
            "https://www.pella.com/"
        ],
        "descs": [
            "A retail store that offers a wide range of home improvement products, including tools, appliances, and building materials.",
            "A home improvement store that sells tools, appliances, and gardening items.",
            "A brand of paints, stains, and coatings that are used for interior and exterior home surfaces.",
            "A manufacturer of paints and coatings used for interior and exterior home surfaces.",
            "A flooring company that offers various flooring materials such as hardwood, vinyl, laminate, and tile.",
            "A brand that produces fixtures and appliances for the kitchen and bathroom, including faucets, showerheads, and accessories.",
            "A company that produces home appliances such as refrigerators, ovens, dishwashers, and washing machines.",
            "A manufacturer of power tools used for building, construction, and remodeling.",
            "A brand that produces caulks, sealants, and adhesives that are used for various home improvement projects.",
            "A company that produces windows and doors for homes, including different styles and materials."
        ]
    },
    "Consumer Resources": {
        "names": [
            "ConsumerReports",
            "Better Business Bureau",
            "National Highway Traffic Safety Administration",
            "Consumer Financial Protection Bureau",
            "Consumerlab",
            "Angie's List",
            "Edmunds",
            "Zillow",
            "Energy Star",
            "Fooducate"
        ],
        "urls": [
            "https://www.consumerreports.org/",
            "https://www.bbb.org/",
            "https://www.nhtsa.gov/",
            "https://www.consumerfinance.gov/",
            "https://www.consumerlab.com/",
            "https://www.angieslist.com/",
            "https://www.edmunds.com/",
            "https://www.zillow.com/",
            "https://www.energystar.gov/",
            "https://www.fooducate.com/"
        ],
        "descs": [
            "A nonprofit organization that provides unbiased product ratings and reviews, as well as consumer news and investigative reporting.",
            "A nonprofit organization that helps consumers find trustworthy businesses and charities, and resolves complaints between consumers and businesses.",
            "A federal agency that strives to save lives, prevent injuries, and reduce vehicle-related crashes through research, safety standards, and consumer education.",
            "A U.S. government agency that protects consumers in the financial marketplace by enforcing laws, promoting fairness, and educating the public.",
            "An independent testing company that evaluates health and wellness products, such as supplements, vitamins, and natural remedies.",
            "A membership-based service that connects consumers with top-rated local service providers in various categories, including home improvement, health, and automotive services.",
            "A car shopping and research site that provides expert reviews, pricing, and comparison tools to help consumers make informed decisions about buying or leasing a car.",
            "An online real estate platform that provides tools and resources for buying, selling, renting, or financing a home, including home values, mortgage rates, and property listings.",
            "A government-backed program that helps businesses and consumers save money and protect the environment by promoting energy-efficient products and practices.",
            "An app that scans barcodes and provides nutrition information, ingredient quality, and health highlights of food products to help consumers make healthier choices at the grocery store."
        ]
    },
    "Sporting Goods": {
        "names": [
            "Nike",
            "Adidas",
            "Under Armour",
            "The North Face",
            "Reebok",
            "Columbia Sportswear",
            "Puma",
            "Patagonia",
            "New Balance",
            "Lululemon"
        ],
        "urls": [
            "https://www.nike.com/",
            "https://www.adidas.com/",
            "https://www.underarmour.com/",
            "https://www.thenorthface.com/",
            "https://www.reebok.com/",
            "https://www.columbia.com/",
            "https://us.puma.com/",
            "https://www.patagonia.com/home/",
            "https://www.newbalance.com/",
            "https://shop.lululemon.com/"
        ],
        "descs": [
            "Offers a wide range of athletic shoes, apparel, and accessories for various sports.",
            "Produces footwear, apparel, and accessories that cater to runners, soccer players, and basketball players, among others.",
            "Offers a variety of sports clothing, shoes, and accessories for men, women, and children.",
            "Offers outdoor gear and apparel for hiking, camping, and climbing.",
            "Offers a wide range of athletic shoes and apparel for various sports, including CrossFit.",
            "Produces outdoor apparel, footwear, and accessories for a variety of sports.",
            "Offers athletic footwear, apparel, and accessories for men, women, and children, including soccer gear.",
            "Produces eco-friendly outdoor clothing and gear for various sports, including surfing and skiing.",
            "Offers athletic shoes, apparel, and accessories for running, walking, and other sports.",
            "Offers high-quality yoga, running, and fitness apparel for men and women."
        ]
    },
    "Vehicle Shopping": {
        "names": [
            "CarGurus",
            "Cars.com",
            "Autotrader",
            "Kelley Blue Book",
            "Edmunds",
            "CarMax",
            "TrueCar",
            "Vroom",
            "Carvana",
            "Shift"
        ],
        "urls": [
            "https://www.cargurus.com/",
            "https://www.cars.com/",
            "https://www.autotrader.com/",
            "https://www.kbb.com/",
            "https://www.edmunds.com/",
            "https://www.carmax.com/",
            "https://www.truecar.com/",
            "https://www.vroom.com/",
            "https://www.carvana.com/",
            "https://shift.com/"
        ],
        "descs": [
            "A website that helps customers find great deals on new and used cars from dealerships across the country.",
            "A comprehensive online resource for vehicle research and car shopping that provides reviews, comparisons, and pricing information.",
            "A website that offers a wide variety of cars, trucks, and SUVs for sale from local dealerships and private sellers, along with research and buying tools.",
            "A trusted source for car pricing and valuation, offering tools to help buyers and sellers determine fair prices for new and used vehicles.",
            "A website that offers research, reviews, and advice on new and used cars, including pricing, reliability, and safety information.",
            "A used car dealership that offers a wide selection of vehicles, easy financing options, and a no-haggle pricing policy.",
            "A website that offers pricing transparency and guaranteed savings on new and used cars, through its network of certified dealerships.",
            "An online car dealership that offers home delivery of used cars, along with financing and trade-in options.",
            "An online car dealership that offers a wide selection of used cars, along with a seven-day money-back guarantee and home delivery.",
            "An online car marketplace that helps customers buy and sell cars, with home delivery and a quality guarantee."
        ]
    },
    "Public Health": {
        "names": [
            "Centers for Disease Control and Prevention",
            "World Health Organization",
            "Johnson & Johnson",
            "Novartis",
            "Pfizer",
            "GlaxoSmithKline",
            "Merck & Co.",
            "3M Company",
            "Clorox",
            "Lysol"
        ],
        "urls": [
            "https://www.cdc.gov/",
            "https://www.who.int/",
            "https://www.jnj.com/",
            "https://www.novartis.com/",
            "https://www.pfizer.com/",
            "https://www.gsk.com/",
            "https://www.merck.com/",
            "https://www.3m.com/",
            "https://www.clorox.com/",
            "https://www.lysol.com/"
        ],
        "descs": [
            "A national public health institute in the United States that works to protect public health and safety.",
            "A specialized agency of the United Nations that emphasizes international public health.",
            "A multinational corporation that produces medical devices, pharmaceuticals, and consumer goods.",
            "A multinational pharmaceutical company that researches and develops various public health treatments and technologies.",
            "A multinational pharmaceutical company with a focus on vaccines, oncology, and rare diseases.",
            "A multinational pharmaceutical company that develops vaccines, prescription drugs, and over-the-counter medicines.",
            "A multinational pharmaceutical company that focuses on public health applications such as vaccines, antibiotics, and cancer treatments.",
            "A multinational conglomerate that provides various medical products and technologies, particularly related to infection prevention and control.",
            "An American global manufacturer of consumer and professional products, particularly cleaning agents that are vital for public health.",
            "A brand of cleaning agents and disinfectants that is particularly relevant to public health through its ability to help prevent the spread of infections."
        ]
    },
    "Service Providers": {
        "names": [
            "Verizon",
            "Geek Squad",
            "ADT",
            "Molly Maid",
            "FedEx",
            "H&R Block",
            "Merry Maids",
            "GeekHive",
            "Upside Business Travel",
            "Vistaprint"
        ],
        "urls": [
            "https://www.verizon.com/",
            "https://www.bestbuy.com/site/geek-squad/geek-squad-services/pcmcat138100050018.c?id=pcmcat138100050018",
            "https://www.adt.com/",
            "https://www.mollymaid.com/",
            "https://www.fedex.com/en-us/home.html",
            "https://www.hrblock.com/",
            "https://www.merrymaids.com/",
            "https://www.geekhive.com/",
            "https://upside.com/",
            "https://www.vistaprint.com/"
        ],
        "descs": [
            "A telecommunications company that offers internet, phone, and TV services.",
            "A tech support service provided by Best Buy that helps with everything from setting up devices to repairing them.",
            "A home security company that offers surveillance systems, professional monitoring, and other security services.",
            "A cleaning service that offers residential and commercial cleaning services.",
            "A courier service that offers shipping, printing, and logistics solutions.",
            "A tax preparation service that helps people prepare and file their taxes.",
            "A cleaning service that offers residential and commercial cleaning services.",
            "A service provider that offers custom software development, digital marketing, and digital strategy services.",
            "A travel service provider that offers deals on flights, hotels, and rental cars.",
            "A service provider that offers printing services for business cards, marketing materials, and other promotional products."
        ]
    },
    "Gambling": {
        "names": [
            "Las Vegas Sands Corp.",
            "Caesars Entertainment, Inc.",
            "MGM Resorts International",
            "WinStar World Casino and Resort",
            "Bet365",
            "PokerStars",
            "William Hill",
            "Bally's Corporation",
            "The Venetian Resort Las Vegas",
            "Atlantic City Boardwalk"
        ],
        "urls": [
            "https://www.sands.com/",
            "https://www.caesars.com/",
            "https://www.mgmresorts.com/",
            "https://www.winstar.com/",
            "https://www.bet365.com/",
            "https://www.pokerstars.com/",
            "https://williamhill.com/",
            "https://www.ballys.com/",
            "https://www.venetian.com/",
            "https://www.atlanticcitynj.com/explore/boardwalk/"
        ],
        "descs": [
            "A global developer of integrated resorts and casinos",
            "An American gaming corporation that owns and operates casinos, hotels, and golf courses under several brands",
            "A global hospitality and entertainment company with a portfolio of resorts and casinos under several brands",
            "A casino and hotel located in Thackerville, Oklahoma",
            "A British online gambling company offering sports betting, casino games, poker, and bingo",
            "An online poker cardroom owned by The Stars Group",
            "A British bookmaker with a chain of retail betting shops and online gambling products",
            "An American company that owns and manages casinos and hotels under several brands",
            "An all-suite luxury resort and casino located on the Las Vegas Strip in Paradise, Nevada",
            "A historic boardwalk in Atlantic City, New Jersey, known for its casinos and entertainment venues"
        ]
    },
    "Commercial Vehicles": {
        "names": [
            "Isuzu",
            "Hino Trucks",
            "Freightliner",
            "Kenworth"
        ],
        "urls": [
            "https://www.isuzucv.com/",
            "https://www.hino.com/trucks/",
            "https://freightliner.com/trucks/vocational/",
            "https://www.kenworth.com/trucks/t880/"
        ],
        "descs": [
            "This brand is known for its reliable and durable trucks, which are popular in the construction, landscaping, and delivery industries.",
            "Hino specializes in medium-duty trucks, such as box trucks and flatbeds, that are often used for local delivery and transportation.",
            "Freightliner offers a range of vocational trucks, including dump trucks, mixers, and refuse trucks, which are designed for specific job functions.",
            "Kenworth is a brand that offers various heavy-duty trucks, such as the T880, which is popular in the construction and mining industries."
        ]
    },
    "Restaurants": {
        "names": [
            "McDonald's",
            "Olive Garden",
            "Shake Shack",
            "Subway",
            "Ruth's Chris Steak House",
            "Chipotle",
            "The Cheesecake Factory",
            "Pizza Hut",
            "Chick-fil-A",
            "TGI Fridays"
        ],
        "urls": [
            "https://www.mcdonalds.com/",
            "https://www.olivegarden.com/",
            "https://www.shakeshack.com/",
            "https://www.subway.com/en-US",
            "https://www.ruthschris.com/",
            "https://www.chipotle.com/",
            "https://www.thecheesecakefactory.com/",
            "https://www.pizzahut.com/",
            "https://www.chick-fil-a.com/",
            "https://www.tgifridays.com/"
        ],
        "descs": [
            "A fast-food chain that serves burgers, fries, and other classic fast food items.",
            "A casual Italian restaurant chain known for their unlimited breadsticks and salad.",
            "A fast-casual restaurant chain that serves burgers, hot dogs, and shakes.",
            "A fast-food chain that specializes in sandwiches and salads.",
            "A high-end steakhouse that serves USDA Prime steaks and other classic American dishes.",
            "A fast-casual restaurant chain that serves burritos, bowls, and tacos.",
            "A casual dining restaurant chain that serves a variety of American dishes, including their famous cheesecake.",
            "A fast-food chain that specializes in pizza, pasta, and wings.",
            "A fast-food chain known for their chicken sandwiches and waffle fries.",
            "A casual dining restaurant chain that serves American cuisine and cocktails."
        ]
    }
}